FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4400.h
/* -------------------------------  USB_EP_DOEPDMA  ------------------------------- */
#define USB_EP_DOEPDMA_DMAAddr_Pos            0                                                       /*!< USB_EP DOEPDMA: DMAAddr Position        */
#define USB_EP_DOEPDMA_DMAAddr_Msk            (0xffffffffUL << USB_EP_DOEPDMA_DMAAddr_Pos)            /*!< USB_EP DOEPDMA: DMAAddr Mask            */

/* -------------------------------  USB_EP_DOEPDMAB  ------------------------------ */
#define USB_EP_DOEPDMAB_DMABufferAddr_Pos     0                                                       /*!< USB_EP DOEPDMAB: DMABufferAddr Position */
#define USB_EP_DOEPDMAB_DMABufferAddr_Msk     (0xffffffffUL << USB_EP_DOEPDMAB_DMABufferAddr_Pos)     /*!< USB_EP DOEPDMAB: DMABufferAddr Mask     */


/* ================================================================================ */
/* ================         Group 'USB_CH' Position & Mask         ================ */
/* ================================================================================ */


/* --------------------------------  USB_CH_HCCHAR  ------------------------------- */
#define USB_CH_HCCHAR_MPS_Pos                 0                                                       /*!< USB_CH HCCHAR: MPS Position             */
#define USB_CH_HCCHAR_MPS_Msk                 (0x000007ffUL << USB_CH_HCCHAR_MPS_Pos)                 /*!< USB_CH HCCHAR: MPS Mask                 */
#define USB_CH_HCCHAR_EPNum_Pos               11                                                      /*!< USB_CH HCCHAR: EPNum Position           */
#define USB_CH_HCCHAR_EPNum_Msk               (0x0fUL << USB_CH_HCCHAR_EPNum_Pos)                     /*!< USB_CH HCCHAR: EPNum Mask               */
#define USB_CH_HCCHAR_EPDir_Pos               15                                                      /*!< USB_CH HCCHAR: EPDir Position           */
#define USB_CH_HCCHAR_EPDir_Msk               (0x01UL << USB_CH_HCCHAR_EPDir_Pos)                     /*!< USB_CH HCCHAR: EPDir Mask               */
#define USB_CH_HCCHAR_EPType_Pos              18                                                      /*!< USB_CH HCCHAR: EPType Position          */
#define USB_CH_HCCHAR_EPType_Msk              (0x03UL << USB_CH_HCCHAR_EPType_Pos)                    /*!< USB_CH HCCHAR: EPType Mask              */
#define USB_CH_HCCHAR_MC_EC_Pos               20                                                      /*!< USB_CH HCCHAR: MC_EC Position           */
#define USB_CH_HCCHAR_MC_EC_Msk               (0x03UL << USB_CH_HCCHAR_MC_EC_Pos)                     /*!< USB_CH HCCHAR: MC_EC Mask               */
#define USB_CH_HCCHAR_DevAddr_Pos             22                                                      /*!< USB_CH HCCHAR: DevAddr Position         */
#define USB_CH_HCCHAR_DevAddr_Msk             (0x7fUL << USB_CH_HCCHAR_DevAddr_Pos)                   /*!< USB_CH HCCHAR: DevAddr Mask             */
#define USB_CH_HCCHAR_OddFrm_Pos              29                                                      /*!< USB_CH HCCHAR: OddFrm Position          */
#define USB_CH_HCCHAR_OddFrm_Msk              (0x01UL << USB_CH_HCCHAR_OddFrm_Pos)                    /*!< USB_CH HCCHAR: OddFrm Mask              */
#define USB_CH_HCCHAR_ChDis_Pos               30                                                      /*!< USB_CH HCCHAR: ChDis Position           */
#define USB_CH_HCCHAR_ChDis_Msk               (0x01UL << USB_CH_HCCHAR_ChDis_Pos)                     /*!< USB_CH HCCHAR: ChDis Mask               */
#define USB_CH_HCCHAR_ChEna_Pos               31                                                      /*!< USB_CH HCCHAR: ChEna Position           */
#define USB_CH_HCCHAR_ChEna_Msk               (0x01UL << USB_CH_HCCHAR_ChEna_Pos)                     /*!< USB_CH HCCHAR: ChEna Mask               */

/* --------------------------------  USB_CH_HCINT  -------------------------------- */
#define USB_CH_HCINT_XferCompl_Pos            0                                                       /*!< USB_CH HCINT: XferCompl Position        */
#define USB_CH_HCINT_XferCompl_Msk            (0x01UL << USB_CH_HCINT_XferCompl_Pos)                  /*!< USB_CH HCINT: XferCompl Mask            */
#define USB_CH_HCINT_ChHltd_Pos               1                                                       /*!< USB_CH HCINT: ChHltd Position           */
#define USB_CH_HCINT_ChHltd_Msk               (0x01UL << USB_CH_HCINT_ChHltd_Pos)                     /*!< USB_CH HCINT: ChHltd Mask               */
#define USB_CH_HCINT_AHBErr_Pos               2                                                       /*!< USB_CH HCINT: AHBErr Position           */
#define USB_CH_HCINT_AHBErr_Msk               (0x01UL << USB_CH_HCINT_AHBErr_Pos)                     /*!< USB_CH HCINT: AHBErr Mask               */
#define USB_CH_HCINT_STALL_Pos                3                                                       /*!< USB_CH HCINT: STALL Position            */
#define USB_CH_HCINT_STALL_Msk                (0x01UL << USB_CH_HCINT_STALL_Pos)                      /*!< USB_CH HCINT: STALL Mask                */
#define USB_CH_HCINT_NAK_Pos                  4                                                       /*!< USB_CH HCINT: NAK Position              */
#define USB_CH_HCINT_NAK_Msk                  (0x01UL << USB_CH_HCINT_NAK_Pos)                        /*!< USB_CH HCINT: NAK Mask                  */
#define USB_CH_HCINT_ACK_Pos                  5                                                       /*!< USB_CH HCINT: ACK Position              */
#define USB_CH_HCINT_ACK_Msk                  (0x01UL << USB_CH_HCINT_ACK_Pos)                        /*!< USB_CH HCINT: ACK Mask                  */
#define USB_CH_HCINT_NYET_Pos                 6                                                       /*!< USB_CH HCINT: NYET Position             */
#define USB_CH_HCINT_NYET_Msk                 (0x01UL << USB_CH_HCINT_NYET_Pos)                       /*!< USB_CH HCINT: NYET Mask                 */
#define USB_CH_HCINT_XactErr_Pos              7                                                       /*!< USB_CH HCINT: XactErr Position          */
#define USB_CH_HCINT_XactErr_Msk              (0x01UL << USB_CH_HCINT_XactErr_Pos)                    /*!< USB_CH HCINT: XactErr Mask              */
#define USB_CH_HCINT_BblErr_Pos               8                                                       /*!< USB_CH HCINT: BblErr Position           */
#define USB_CH_HCINT_BblErr_Msk               (0x01UL << USB_CH_HCINT_BblErr_Pos)                     /*!< USB_CH HCINT: BblErr Mask               */
#define USB_CH_HCINT_FrmOvrun_Pos             9                                                       /*!< USB_CH HCINT: FrmOvrun Position         */
#define USB_CH_HCINT_FrmOvrun_Msk             (0x01UL << USB_CH_HCINT_FrmOvrun_Pos)                   /*!< USB_CH HCINT: FrmOvrun Mask             */
#define USB_CH_HCINT_DataTglErr_Pos           10                                                      /*!< USB_CH HCINT: DataTglErr Position       */
#define USB_CH_HCINT_DataTglErr_Msk           (0x01UL << USB_CH_HCINT_DataTglErr_Pos)                 /*!< USB_CH HCINT: DataTglErr Mask           */
#define USB_CH_HCINT_BNAIntr_Pos              11                                                      /*!< USB_CH HCINT: BNAIntr Position          */
#define USB_CH_HCINT_BNAIntr_Msk              (0x01UL << USB_CH_HCINT_BNAIntr_Pos)                    /*!< USB_CH HCINT: BNAIntr Mask              */
#define USB_CH_HCINT_XCS_XACT_ERR_Pos         12                                                      /*!< USB_CH HCINT: XCS_XACT_ERR Position     */
#define USB_CH_HCINT_XCS_XACT_ERR_Msk         (0x01UL << USB_CH_HCINT_XCS_XACT_ERR_Pos)               /*!< USB_CH HCINT: XCS_XACT_ERR Mask         */
#define USB_CH_HCINT_DESC_LST_ROLLIntr_Pos    13                                                      /*!< USB_CH HCINT: DESC_LST_ROLLIntr Position */
#define USB_CH_HCINT_DESC_LST_ROLLIntr_Msk    (0x01UL << USB_CH_HCINT_DESC_LST_ROLLIntr_Pos)          /*!< USB_CH HCINT: DESC_LST_ROLLIntr Mask    */

/* -------------------------------  USB_CH_HCINTMSK  ------------------------------ */
#define USB_CH_HCINTMSK_XferComplMsk_Pos      0                                                       /*!< USB_CH HCINTMSK: XferComplMsk Position  */
#define USB_CH_HCINTMSK_XferComplMsk_Msk      (0x01UL << USB_CH_HCINTMSK_XferComplMsk_Pos)            /*!< USB_CH HCINTMSK: XferComplMsk Mask      */
#define USB_CH_HCINTMSK_ChHltdMsk_Pos         1                                                       /*!< USB_CH HCINTMSK: ChHltdMsk Position     */
#define USB_CH_HCINTMSK_ChHltdMsk_Msk         (0x01UL << USB_CH_HCINTMSK_ChHltdMsk_Pos)               /*!< USB_CH HCINTMSK: ChHltdMsk Mask         */
#define USB_CH_HCINTMSK_AHBErrMsk_Pos         2                                                       /*!< USB_CH HCINTMSK: AHBErrMsk Position     */
#define USB_CH_HCINTMSK_AHBErrMsk_Msk         (0x01UL << USB_CH_HCINTMSK_AHBErrMsk_Pos)               /*!< USB_CH HCINTMSK: AHBErrMsk Mask         */
#define USB_CH_HCINTMSK_StallMsk_Pos          3                                                       /*!< USB_CH HCINTMSK: StallMsk Position      */
#define USB_CH_HCINTMSK_StallMsk_Msk          (0x01UL << USB_CH_HCINTMSK_StallMsk_Pos)                /*!< USB_CH HCINTMSK: StallMsk Mask          */
#define USB_CH_HCINTMSK_NakMsk_Pos            4                                                       /*!< USB_CH HCINTMSK: NakMsk Position        */
#define USB_CH_HCINTMSK_NakMsk_Msk            (0x01UL << USB_CH_HCINTMSK_NakMsk_Pos)                  /*!< USB_CH HCINTMSK: NakMsk Mask            */
#define USB_CH_HCINTMSK_AckMsk_Pos            5                                                       /*!< USB_CH HCINTMSK: AckMsk Position        */
#define USB_CH_HCINTMSK_AckMsk_Msk            (0x01UL << USB_CH_HCINTMSK_AckMsk_Pos)                  /*!< USB_CH HCINTMSK: AckMsk Mask            */
#define USB_CH_HCINTMSK_NyetMsk_Pos           6                                                       /*!< USB_CH HCINTMSK: NyetMsk Position       */
#define USB_CH_HCINTMSK_NyetMsk_Msk           (0x01UL << USB_CH_HCINTMSK_NyetMsk_Pos)                 /*!< USB_CH HCINTMSK: NyetMsk Mask           */
#define USB_CH_HCINTMSK_XactErrMsk_Pos        7                                                       /*!< USB_CH HCINTMSK: XactErrMsk Position    */
#define USB_CH_HCINTMSK_XactErrMsk_Msk        (0x01UL << USB_CH_HCINTMSK_XactErrMsk_Pos)              /*!< USB_CH HCINTMSK: XactErrMsk Mask        */
#define USB_CH_HCINTMSK_BblErrMsk_Pos         8                                                       /*!< USB_CH HCINTMSK: BblErrMsk Position     */
#define USB_CH_HCINTMSK_BblErrMsk_Msk         (0x01UL << USB_CH_HCINTMSK_BblErrMsk_Pos)               /*!< USB_CH HCINTMSK: BblErrMsk Mask         */
#define USB_CH_HCINTMSK_FrmOvrunMsk_Pos       9                                                       /*!< USB_CH HCINTMSK: FrmOvrunMsk Position   */
#define USB_CH_HCINTMSK_FrmOvrunMsk_Msk       (0x01UL << USB_CH_HCINTMSK_FrmOvrunMsk_Pos)             /*!< USB_CH HCINTMSK: FrmOvrunMsk Mask       */
#define USB_CH_HCINTMSK_DataTglErrMsk_Pos     10                                                      /*!< USB_CH HCINTMSK: DataTglErrMsk Position */
#define USB_CH_HCINTMSK_DataTglErrMsk_Msk     (0x01UL << USB_CH_HCINTMSK_DataTglErrMsk_Pos)           /*!< USB_CH HCINTMSK: DataTglErrMsk Mask     */
#define USB_CH_HCINTMSK_BNAIntrMsk_Pos        11                                                      /*!< USB_CH HCINTMSK: BNAIntrMsk Position    */
#define USB_CH_HCINTMSK_BNAIntrMsk_Msk        (0x01UL << USB_CH_HCINTMSK_BNAIntrMsk_Pos)              /*!< USB_CH HCINTMSK: BNAIntrMsk Mask        */
#define USB_CH_HCINTMSK_DESC_LST_ROLLIntrMsk_Pos 13                                                   /*!< USB_CH HCINTMSK: DESC_LST_ROLLIntrMsk Position */
#define USB_CH_HCINTMSK_DESC_LST_ROLLIntrMsk_Msk (0x01UL << USB_CH_HCINTMSK_DESC_LST_ROLLIntrMsk_Pos) /*!< USB_CH HCINTMSK: DESC_LST_ROLLIntrMsk Mask */

/* --------------------------  USB_CH_HCTSIZ_BUFFERMODE  -------------------------- */
#define USB_CH_HCTSIZ_BUFFERMODE_XferSize_Pos 0                                                       /*!< USB_CH HCTSIZ_BUFFERMODE: XferSize Position */
#define USB_CH_HCTSIZ_BUFFERMODE_XferSize_Msk (0x0007ffffUL << USB_CH_HCTSIZ_BUFFERMODE_XferSize_Pos) /*!< USB_CH HCTSIZ_BUFFERMODE: XferSize Mask */
#define USB_CH_HCTSIZ_BUFFERMODE_PktCnt_Pos   19                                                      /*!< USB_CH HCTSIZ_BUFFERMODE: PktCnt Position */
#define USB_CH_HCTSIZ_BUFFERMODE_PktCnt_Msk   (0x000003ffUL << USB_CH_HCTSIZ_BUFFERMODE_PktCnt_Pos)   /*!< USB_CH HCTSIZ_BUFFERMODE: PktCnt Mask   */
#define USB_CH_HCTSIZ_BUFFERMODE_Pid_Pos      29                                                      /*!< USB_CH HCTSIZ_BUFFERMODE: Pid Position  */
#define USB_CH_HCTSIZ_BUFFERMODE_Pid_Msk      (0x03UL << USB_CH_HCTSIZ_BUFFERMODE_Pid_Pos)            /*!< USB_CH HCTSIZ_BUFFERMODE: Pid Mask      */

/* --------------------------  USB_CH_HCTSIZ_SCATGATHER  -------------------------- */
#define USB_CH_HCTSIZ_SCATGATHER_SCHED_INFO_Pos 0                                                     /*!< USB_CH HCTSIZ_SCATGATHER: SCHED_INFO Position */
#define USB_CH_HCTSIZ_SCATGATHER_SCHED_INFO_Msk (0x000000ffUL << USB_CH_HCTSIZ_SCATGATHER_SCHED_INFO_Pos)/*!< USB_CH HCTSIZ_SCATGATHER: SCHED_INFO Mask */
#define USB_CH_HCTSIZ_SCATGATHER_NTD_Pos      8                                                       /*!< USB_CH HCTSIZ_SCATGATHER: NTD Position  */
#define USB_CH_HCTSIZ_SCATGATHER_NTD_Msk      (0x000000ffUL << USB_CH_HCTSIZ_SCATGATHER_NTD_Pos)      /*!< USB_CH HCTSIZ_SCATGATHER: NTD Mask      */
#define USB_CH_HCTSIZ_SCATGATHER_Pid_Pos      29                                                      /*!< USB_CH HCTSIZ_SCATGATHER: Pid Position  */
#define USB_CH_HCTSIZ_SCATGATHER_Pid_Msk      (0x03UL << USB_CH_HCTSIZ_SCATGATHER_Pid_Pos)            /*!< USB_CH HCTSIZ_SCATGATHER: Pid Mask      */

/* ---------------------------  USB_CH_HCDMA_BUFFERMODE  -------------------------- */
#define USB_CH_HCDMA_BUFFERMODE_DMAAddr_Pos   0                                                       /*!< USB_CH HCDMA_BUFFERMODE: DMAAddr Position */
#define USB_CH_HCDMA_BUFFERMODE_DMAAddr_Msk   (0xffffffffUL << USB_CH_HCDMA_BUFFERMODE_DMAAddr_Pos)   /*!< USB_CH HCDMA_BUFFERMODE: DMAAddr Mask   */

/* ---------------------------  USB_CH_HCDMA_SCATGATHER  -------------------------- */
#define USB_CH_HCDMA_SCATGATHER_CTD_Pos       3                                                       /*!< USB_CH HCDMA_SCATGATHER: CTD Position   */
#define USB_CH_HCDMA_SCATGATHER_CTD_Msk       (0x3fUL << USB_CH_HCDMA_SCATGATHER_CTD_Pos)             /*!< USB_CH HCDMA_SCATGATHER: CTD Mask       */
#define USB_CH_HCDMA_SCATGATHER_DMAAddr_Pos   9                                                       /*!< USB_CH HCDMA_SCATGATHER: DMAAddr Position */
#define USB_CH_HCDMA_SCATGATHER_DMAAddr_Msk   (0x007fffffUL << USB_CH_HCDMA_SCATGATHER_DMAAddr_Pos)   /*!< USB_CH HCDMA_SCATGATHER: DMAAddr Mask   */

/* --------------------------------  USB_CH_HCDMAB  ------------------------------- */
#define USB_CH_HCDMAB_Buffer_Address_Pos      0                                                       /*!< USB_CH HCDMAB: Buffer_Address Position  */
#define USB_CH_HCDMAB_Buffer_Address_Msk      (0xffffffffUL << USB_CH_HCDMAB_Buffer_Address_Pos)      /*!< USB_CH HCDMAB: Buffer_Address Mask      */


/* ================================================================================ */
/* ================          Group 'USIC' Position & Mask          ================ */
/* ================================================================================ */


/* -----------------------------------  USIC_ID  ---------------------------------- */
#define USIC_ID_MOD_REV_Pos                   0                                                       /*!< USIC ID: MOD_REV Position               */
#define USIC_ID_MOD_REV_Msk                   (0x000000ffUL << USIC_ID_MOD_REV_Pos)                   /*!< USIC ID: MOD_REV Mask                   */
#define USIC_ID_MOD_TYPE_Pos                  8                                                       /*!< USIC ID: MOD_TYPE Position              */
#define USIC_ID_MOD_TYPE_Msk                  (0x000000ffUL << USIC_ID_MOD_TYPE_Pos)                  /*!< USIC ID: MOD_TYPE Mask                  */
#define USIC_ID_MOD_NUMBER_Pos                16                                                      /*!< USIC ID: MOD_NUMBER Position            */
#define USIC_ID_MOD_NUMBER_Msk                (0x0000ffffUL << USIC_ID_MOD_NUMBER_Pos)                /*!< USIC ID: MOD_NUMBER Mask                */


/* ================================================================================ */
/* ================         Group 'USIC_CH' Position & Mask        ================ */
/* ================================================================================ */


/* --------------------------------  USIC_CH_CCFG  -------------------------------- */
#define USIC_CH_CCFG_SSC_Pos                  0                                                       /*!< USIC_CH CCFG: SSC Position              */
#define USIC_CH_CCFG_SSC_Msk                  (0x01UL << USIC_CH_CCFG_SSC_Pos)                        /*!< USIC_CH CCFG: SSC Mask                  */
#define USIC_CH_CCFG_ASC_Pos                  1                                                       /*!< USIC_CH CCFG: ASC Position              */
#define USIC_CH_CCFG_ASC_Msk                  (0x01UL << USIC_CH_CCFG_ASC_Pos)                        /*!< USIC_CH CCFG: ASC Mask                  */
#define USIC_CH_CCFG_IIC_Pos                  2                                                       /*!< USIC_CH CCFG: IIC Position              */
#define USIC_CH_CCFG_IIC_Msk                  (0x01UL << USIC_CH_CCFG_IIC_Pos)                        /*!< USIC_CH CCFG: IIC Mask                  */
#define USIC_CH_CCFG_IIS_Pos                  3                                                       /*!< USIC_CH CCFG: IIS Position              */
#define USIC_CH_CCFG_IIS_Msk                  (0x01UL << USIC_CH_CCFG_IIS_Pos)                        /*!< USIC_CH CCFG: IIS Mask                  */
#define USIC_CH_CCFG_RB_Pos                   6                                                       /*!< USIC_CH CCFG: RB Position               */
#define USIC_CH_CCFG_RB_Msk                   (0x01UL << USIC_CH_CCFG_RB_Pos)                         /*!< USIC_CH CCFG: RB Mask                   */
#define USIC_CH_CCFG_TB_Pos                   7                                                       /*!< USIC_CH CCFG: TB Position               */
#define USIC_CH_CCFG_TB_Msk                   (0x01UL << USIC_CH_CCFG_TB_Pos)                         /*!< USIC_CH CCFG: TB Mask                   */

/* --------------------------------  USIC_CH_KSCFG  ------------------------------- */
#define USIC_CH_KSCFG_MODEN_Pos               0                                                       /*!< USIC_CH KSCFG: MODEN Position           */
#define USIC_CH_KSCFG_MODEN_Msk               (0x01UL << USIC_CH_KSCFG_MODEN_Pos)                     /*!< USIC_CH KSCFG: MODEN Mask               */
#define USIC_CH_KSCFG_BPMODEN_Pos             1                                                       /*!< USIC_CH KSCFG: BPMODEN Position         */
#define USIC_CH_KSCFG_BPMODEN_Msk             (0x01UL << USIC_CH_KSCFG_BPMODEN_Pos)                   /*!< USIC_CH KSCFG: BPMODEN Mask             */
#define USIC_CH_KSCFG_NOMCFG_Pos              4                                                       /*!< USIC_CH KSCFG: NOMCFG Position          */
#define USIC_CH_KSCFG_NOMCFG_Msk              (0x03UL << USIC_CH_KSCFG_NOMCFG_Pos)                    /*!< USIC_CH KSCFG: NOMCFG Mask              */
#define USIC_CH_KSCFG_BPNOM_Pos               7                                                       /*!< USIC_CH KSCFG: BPNOM Position           */
#define USIC_CH_KSCFG_BPNOM_Msk               (0x01UL << USIC_CH_KSCFG_BPNOM_Pos)                     /*!< USIC_CH KSCFG: BPNOM Mask               */
#define USIC_CH_KSCFG_SUMCFG_Pos              8                                                       /*!< USIC_CH KSCFG: SUMCFG Position          */
#define USIC_CH_KSCFG_SUMCFG_Msk              (0x03UL << USIC_CH_KSCFG_SUMCFG_Pos)                    /*!< USIC_CH KSCFG: SUMCFG Mask              */
#define USIC_CH_KSCFG_BPSUM_Pos               11                                                      /*!< USIC_CH KSCFG: BPSUM Position           */
#define USIC_CH_KSCFG_BPSUM_Msk               (0x01UL << USIC_CH_KSCFG_BPSUM_Pos)                     /*!< USIC_CH KSCFG: BPSUM Mask               */

/* ---------------------------------  USIC_CH_FDR  -------------------------------- */
#define USIC_CH_FDR_STEP_Pos                  0                                                       /*!< USIC_CH FDR: STEP Position              */
#define USIC_CH_FDR_STEP_Msk                  (0x000003ffUL << USIC_CH_FDR_STEP_Pos)                  /*!< USIC_CH FDR: STEP Mask                  */
#define USIC_CH_FDR_DM_Pos                    14                                                      /*!< USIC_CH FDR: DM Position                */
#define USIC_CH_FDR_DM_Msk                    (0x03UL << USIC_CH_FDR_DM_Pos)                          /*!< USIC_CH FDR: DM Mask                    */
#define USIC_CH_FDR_RESULT_Pos                16                                                      /*!< USIC_CH FDR: RESULT Position            */
#define USIC_CH_FDR_RESULT_Msk                (0x000003ffUL << USIC_CH_FDR_RESULT_Pos)                /*!< USIC_CH FDR: RESULT Mask                */

