FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4400.h
/* -----------------------------------  DSD_CLC  ---------------------------------- */
#define DSD_CLC_DISR_Pos                      0                                                       /*!< DSD CLC: DISR Position                  */
#define DSD_CLC_DISR_Msk                      (0x01UL << DSD_CLC_DISR_Pos)                            /*!< DSD CLC: DISR Mask                      */
#define DSD_CLC_DISS_Pos                      1                                                       /*!< DSD CLC: DISS Position                  */
#define DSD_CLC_DISS_Msk                      (0x01UL << DSD_CLC_DISS_Pos)                            /*!< DSD CLC: DISS Mask                      */
#define DSD_CLC_EDIS_Pos                      3                                                       /*!< DSD CLC: EDIS Position                  */
#define DSD_CLC_EDIS_Msk                      (0x01UL << DSD_CLC_EDIS_Pos)                            /*!< DSD CLC: EDIS Mask                      */

/* -----------------------------------  DSD_ID  ----------------------------------- */
#define DSD_ID_MOD_REV_Pos                    0                                                       /*!< DSD ID: MOD_REV Position                */
#define DSD_ID_MOD_REV_Msk                    (0x000000ffUL << DSD_ID_MOD_REV_Pos)                    /*!< DSD ID: MOD_REV Mask                    */
#define DSD_ID_MOD_TYPE_Pos                   8                                                       /*!< DSD ID: MOD_TYPE Position               */
#define DSD_ID_MOD_TYPE_Msk                   (0x000000ffUL << DSD_ID_MOD_TYPE_Pos)                   /*!< DSD ID: MOD_TYPE Mask                   */
#define DSD_ID_MOD_NUMBER_Pos                 16                                                      /*!< DSD ID: MOD_NUMBER Position             */
#define DSD_ID_MOD_NUMBER_Msk                 (0x0000ffffUL << DSD_ID_MOD_NUMBER_Pos)                 /*!< DSD ID: MOD_NUMBER Mask                 */

/* -----------------------------------  DSD_OCS  ---------------------------------- */
#define DSD_OCS_SUS_Pos                       24                                                      /*!< DSD OCS: SUS Position                   */
#define DSD_OCS_SUS_Msk                       (0x0fUL << DSD_OCS_SUS_Pos)                             /*!< DSD OCS: SUS Mask                       */
#define DSD_OCS_SUS_P_Pos                     28                                                      /*!< DSD OCS: SUS_P Position                 */
#define DSD_OCS_SUS_P_Msk                     (0x01UL << DSD_OCS_SUS_P_Pos)                           /*!< DSD OCS: SUS_P Mask                     */
#define DSD_OCS_SUSSTA_Pos                    29                                                      /*!< DSD OCS: SUSSTA Position                */
#define DSD_OCS_SUSSTA_Msk                    (0x01UL << DSD_OCS_SUSSTA_Pos)                          /*!< DSD OCS: SUSSTA Mask                    */

/* ---------------------------------  DSD_GLOBCFG  -------------------------------- */
#define DSD_GLOBCFG_MCSEL_Pos                 0                                                       /*!< DSD GLOBCFG: MCSEL Position             */
#define DSD_GLOBCFG_MCSEL_Msk                 (0x07UL << DSD_GLOBCFG_MCSEL_Pos)                       /*!< DSD GLOBCFG: MCSEL Mask                 */

/* ---------------------------------  DSD_GLOBRC  --------------------------------- */
#define DSD_GLOBRC_CH0RUN_Pos                 0                                                       /*!< DSD GLOBRC: CH0RUN Position             */
#define DSD_GLOBRC_CH0RUN_Msk                 (0x01UL << DSD_GLOBRC_CH0RUN_Pos)                       /*!< DSD GLOBRC: CH0RUN Mask                 */
#define DSD_GLOBRC_CH1RUN_Pos                 1                                                       /*!< DSD GLOBRC: CH1RUN Position             */
#define DSD_GLOBRC_CH1RUN_Msk                 (0x01UL << DSD_GLOBRC_CH1RUN_Pos)                       /*!< DSD GLOBRC: CH1RUN Mask                 */
#define DSD_GLOBRC_CH2RUN_Pos                 2                                                       /*!< DSD GLOBRC: CH2RUN Position             */
#define DSD_GLOBRC_CH2RUN_Msk                 (0x01UL << DSD_GLOBRC_CH2RUN_Pos)                       /*!< DSD GLOBRC: CH2RUN Mask                 */
#define DSD_GLOBRC_CH3RUN_Pos                 3                                                       /*!< DSD GLOBRC: CH3RUN Position             */
#define DSD_GLOBRC_CH3RUN_Msk                 (0x01UL << DSD_GLOBRC_CH3RUN_Pos)                       /*!< DSD GLOBRC: CH3RUN Mask                 */

/* ----------------------------------  DSD_CGCFG  --------------------------------- */
#define DSD_CGCFG_CGMOD_Pos                   0                                                       /*!< DSD CGCFG: CGMOD Position               */
#define DSD_CGCFG_CGMOD_Msk                   (0x03UL << DSD_CGCFG_CGMOD_Pos)                         /*!< DSD CGCFG: CGMOD Mask                   */
#define DSD_CGCFG_BREV_Pos                    2                                                       /*!< DSD CGCFG: BREV Position                */
#define DSD_CGCFG_BREV_Msk                    (0x01UL << DSD_CGCFG_BREV_Pos)                          /*!< DSD CGCFG: BREV Mask                    */
#define DSD_CGCFG_SIGPOL_Pos                  3                                                       /*!< DSD CGCFG: SIGPOL Position              */
#define DSD_CGCFG_SIGPOL_Msk                  (0x01UL << DSD_CGCFG_SIGPOL_Pos)                        /*!< DSD CGCFG: SIGPOL Mask                  */
#define DSD_CGCFG_DIVCG_Pos                   4                                                       /*!< DSD CGCFG: DIVCG Position               */
#define DSD_CGCFG_DIVCG_Msk                   (0x0fUL << DSD_CGCFG_DIVCG_Pos)                         /*!< DSD CGCFG: DIVCG Mask                   */
#define DSD_CGCFG_RUN_Pos                     15                                                      /*!< DSD CGCFG: RUN Position                 */
#define DSD_CGCFG_RUN_Msk                     (0x01UL << DSD_CGCFG_RUN_Pos)                           /*!< DSD CGCFG: RUN Mask                     */
#define DSD_CGCFG_BITCOUNT_Pos                16                                                      /*!< DSD CGCFG: BITCOUNT Position            */
#define DSD_CGCFG_BITCOUNT_Msk                (0x1fUL << DSD_CGCFG_BITCOUNT_Pos)                      /*!< DSD CGCFG: BITCOUNT Mask                */
#define DSD_CGCFG_STEPCOUNT_Pos               24                                                      /*!< DSD CGCFG: STEPCOUNT Position           */
#define DSD_CGCFG_STEPCOUNT_Msk               (0x0fUL << DSD_CGCFG_STEPCOUNT_Pos)                     /*!< DSD CGCFG: STEPCOUNT Mask               */
#define DSD_CGCFG_STEPS_Pos                   28                                                      /*!< DSD CGCFG: STEPS Position               */
#define DSD_CGCFG_STEPS_Msk                   (0x01UL << DSD_CGCFG_STEPS_Pos)                         /*!< DSD CGCFG: STEPS Mask                   */
#define DSD_CGCFG_STEPD_Pos                   29                                                      /*!< DSD CGCFG: STEPD Position               */
#define DSD_CGCFG_STEPD_Msk                   (0x01UL << DSD_CGCFG_STEPD_Pos)                         /*!< DSD CGCFG: STEPD Mask                   */
#define DSD_CGCFG_SGNCG_Pos                   30                                                      /*!< DSD CGCFG: SGNCG Position               */
#define DSD_CGCFG_SGNCG_Msk                   (0x01UL << DSD_CGCFG_SGNCG_Pos)                         /*!< DSD CGCFG: SGNCG Mask                   */

/* ---------------------------------  DSD_EVFLAG  --------------------------------- */
#define DSD_EVFLAG_RESEV0_Pos                 0                                                       /*!< DSD EVFLAG: RESEV0 Position             */
#define DSD_EVFLAG_RESEV0_Msk                 (0x01UL << DSD_EVFLAG_RESEV0_Pos)                       /*!< DSD EVFLAG: RESEV0 Mask                 */
#define DSD_EVFLAG_RESEV1_Pos                 1                                                       /*!< DSD EVFLAG: RESEV1 Position             */
#define DSD_EVFLAG_RESEV1_Msk                 (0x01UL << DSD_EVFLAG_RESEV1_Pos)                       /*!< DSD EVFLAG: RESEV1 Mask                 */
#define DSD_EVFLAG_RESEV2_Pos                 2                                                       /*!< DSD EVFLAG: RESEV2 Position             */
#define DSD_EVFLAG_RESEV2_Msk                 (0x01UL << DSD_EVFLAG_RESEV2_Pos)                       /*!< DSD EVFLAG: RESEV2 Mask                 */
#define DSD_EVFLAG_RESEV3_Pos                 3                                                       /*!< DSD EVFLAG: RESEV3 Position             */
#define DSD_EVFLAG_RESEV3_Msk                 (0x01UL << DSD_EVFLAG_RESEV3_Pos)                       /*!< DSD EVFLAG: RESEV3 Mask                 */
#define DSD_EVFLAG_ALEV0_Pos                  16                                                      /*!< DSD EVFLAG: ALEV0 Position              */
#define DSD_EVFLAG_ALEV0_Msk                  (0x01UL << DSD_EVFLAG_ALEV0_Pos)                        /*!< DSD EVFLAG: ALEV0 Mask                  */
#define DSD_EVFLAG_ALEV1_Pos                  17                                                      /*!< DSD EVFLAG: ALEV1 Position              */
#define DSD_EVFLAG_ALEV1_Msk                  (0x01UL << DSD_EVFLAG_ALEV1_Pos)                        /*!< DSD EVFLAG: ALEV1 Mask                  */
#define DSD_EVFLAG_ALEV2_Pos                  18                                                      /*!< DSD EVFLAG: ALEV2 Position              */
#define DSD_EVFLAG_ALEV2_Msk                  (0x01UL << DSD_EVFLAG_ALEV2_Pos)                        /*!< DSD EVFLAG: ALEV2 Mask                  */
#define DSD_EVFLAG_ALEV3_Pos                  19                                                      /*!< DSD EVFLAG: ALEV3 Position              */
#define DSD_EVFLAG_ALEV3_Msk                  (0x01UL << DSD_EVFLAG_ALEV3_Pos)                        /*!< DSD EVFLAG: ALEV3 Mask                  */
#define DSD_EVFLAG_ALEV4_Pos                  20                                                      /*!< DSD EVFLAG: ALEV4 Position              */
#define DSD_EVFLAG_ALEV4_Msk                  (0x01UL << DSD_EVFLAG_ALEV4_Pos)                        /*!< DSD EVFLAG: ALEV4 Mask                  */
#define DSD_EVFLAG_ALEV5_Pos                  21                                                      /*!< DSD EVFLAG: ALEV5 Position              */
#define DSD_EVFLAG_ALEV5_Msk                  (0x01UL << DSD_EVFLAG_ALEV5_Pos)                        /*!< DSD EVFLAG: ALEV5 Mask                  */
#define DSD_EVFLAG_ALEV6_Pos                  22                                                      /*!< DSD EVFLAG: ALEV6 Position              */
#define DSD_EVFLAG_ALEV6_Msk                  (0x01UL << DSD_EVFLAG_ALEV6_Pos)                        /*!< DSD EVFLAG: ALEV6 Mask                  */
#define DSD_EVFLAG_ALEV7_Pos                  23                                                      /*!< DSD EVFLAG: ALEV7 Position              */
#define DSD_EVFLAG_ALEV7_Msk                  (0x01UL << DSD_EVFLAG_ALEV7_Pos)                        /*!< DSD EVFLAG: ALEV7 Mask                  */
#define DSD_EVFLAG_ALEV8_Pos                  24                                                      /*!< DSD EVFLAG: ALEV8 Position              */
#define DSD_EVFLAG_ALEV8_Msk                  (0x01UL << DSD_EVFLAG_ALEV8_Pos)                        /*!< DSD EVFLAG: ALEV8 Mask                  */
#define DSD_EVFLAG_ALEV9_Pos                  25                                                      /*!< DSD EVFLAG: ALEV9 Position              */
#define DSD_EVFLAG_ALEV9_Msk                  (0x01UL << DSD_EVFLAG_ALEV9_Pos)                        /*!< DSD EVFLAG: ALEV9 Mask                  */

/* --------------------------------  DSD_EVFLAGCLR  ------------------------------- */
#define DSD_EVFLAGCLR_RESEC0_Pos              0                                                       /*!< DSD EVFLAGCLR: RESEC0 Position          */
#define DSD_EVFLAGCLR_RESEC0_Msk              (0x01UL << DSD_EVFLAGCLR_RESEC0_Pos)                    /*!< DSD EVFLAGCLR: RESEC0 Mask              */
#define DSD_EVFLAGCLR_RESEC1_Pos              1                                                       /*!< DSD EVFLAGCLR: RESEC1 Position          */
#define DSD_EVFLAGCLR_RESEC1_Msk              (0x01UL << DSD_EVFLAGCLR_RESEC1_Pos)                    /*!< DSD EVFLAGCLR: RESEC1 Mask              */
#define DSD_EVFLAGCLR_RESEC2_Pos              2                                                       /*!< DSD EVFLAGCLR: RESEC2 Position          */
#define DSD_EVFLAGCLR_RESEC2_Msk              (0x01UL << DSD_EVFLAGCLR_RESEC2_Pos)                    /*!< DSD EVFLAGCLR: RESEC2 Mask              */
#define DSD_EVFLAGCLR_RESEC3_Pos              3                                                       /*!< DSD EVFLAGCLR: RESEC3 Position          */
#define DSD_EVFLAGCLR_RESEC3_Msk              (0x01UL << DSD_EVFLAGCLR_RESEC3_Pos)                    /*!< DSD EVFLAGCLR: RESEC3 Mask              */
#define DSD_EVFLAGCLR_ALEC0_Pos               16                                                      /*!< DSD EVFLAGCLR: ALEC0 Position           */
#define DSD_EVFLAGCLR_ALEC0_Msk               (0x01UL << DSD_EVFLAGCLR_ALEC0_Pos)                     /*!< DSD EVFLAGCLR: ALEC0 Mask               */
#define DSD_EVFLAGCLR_ALEC1_Pos               17                                                      /*!< DSD EVFLAGCLR: ALEC1 Position           */
#define DSD_EVFLAGCLR_ALEC1_Msk               (0x01UL << DSD_EVFLAGCLR_ALEC1_Pos)                     /*!< DSD EVFLAGCLR: ALEC1 Mask               */
#define DSD_EVFLAGCLR_ALEC2_Pos               18                                                      /*!< DSD EVFLAGCLR: ALEC2 Position           */
#define DSD_EVFLAGCLR_ALEC2_Msk               (0x01UL << DSD_EVFLAGCLR_ALEC2_Pos)                     /*!< DSD EVFLAGCLR: ALEC2 Mask               */
#define DSD_EVFLAGCLR_ALEC3_Pos               19                                                      /*!< DSD EVFLAGCLR: ALEC3 Position           */
#define DSD_EVFLAGCLR_ALEC3_Msk               (0x01UL << DSD_EVFLAGCLR_ALEC3_Pos)                     /*!< DSD EVFLAGCLR: ALEC3 Mask               */


/* ================================================================================ */
/* ================         Group 'DSD_CH' Position & Mask         ================ */
/* ================================================================================ */


/* --------------------------------  DSD_CH_MODCFG  ------------------------------- */
#define DSD_CH_MODCFG_DIVM_Pos                16                                                      /*!< DSD_CH MODCFG: DIVM Position            */
#define DSD_CH_MODCFG_DIVM_Msk                (0x0fUL << DSD_CH_MODCFG_DIVM_Pos)                      /*!< DSD_CH MODCFG: DIVM Mask                */
#define DSD_CH_MODCFG_DWC_Pos                 23                                                      /*!< DSD_CH MODCFG: DWC Position             */
#define DSD_CH_MODCFG_DWC_Msk                 (0x01UL << DSD_CH_MODCFG_DWC_Pos)                       /*!< DSD_CH MODCFG: DWC Mask                 */

/* --------------------------------  DSD_CH_DICFG  -------------------------------- */
#define DSD_CH_DICFG_DSRC_Pos                 0                                                       /*!< DSD_CH DICFG: DSRC Position             */
#define DSD_CH_DICFG_DSRC_Msk                 (0x0fUL << DSD_CH_DICFG_DSRC_Pos)                       /*!< DSD_CH DICFG: DSRC Mask                 */
#define DSD_CH_DICFG_DSWC_Pos                 7                                                       /*!< DSD_CH DICFG: DSWC Position             */
#define DSD_CH_DICFG_DSWC_Msk                 (0x01UL << DSD_CH_DICFG_DSWC_Pos)                       /*!< DSD_CH DICFG: DSWC Mask                 */
#define DSD_CH_DICFG_ITRMODE_Pos              8                                                       /*!< DSD_CH DICFG: ITRMODE Position          */
#define DSD_CH_DICFG_ITRMODE_Msk              (0x03UL << DSD_CH_DICFG_ITRMODE_Pos)                    /*!< DSD_CH DICFG: ITRMODE Mask              */
#define DSD_CH_DICFG_TSTRMODE_Pos             10                                                      /*!< DSD_CH DICFG: TSTRMODE Position         */
#define DSD_CH_DICFG_TSTRMODE_Msk             (0x03UL << DSD_CH_DICFG_TSTRMODE_Pos)                   /*!< DSD_CH DICFG: TSTRMODE Mask             */
#define DSD_CH_DICFG_TRSEL_Pos                12                                                      /*!< DSD_CH DICFG: TRSEL Position            */
#define DSD_CH_DICFG_TRSEL_Msk                (0x07UL << DSD_CH_DICFG_TRSEL_Pos)                      /*!< DSD_CH DICFG: TRSEL Mask                */
#define DSD_CH_DICFG_TRWC_Pos                 15                                                      /*!< DSD_CH DICFG: TRWC Position             */
#define DSD_CH_DICFG_TRWC_Msk                 (0x01UL << DSD_CH_DICFG_TRWC_Pos)                       /*!< DSD_CH DICFG: TRWC Mask                 */
#define DSD_CH_DICFG_CSRC_Pos                 16                                                      /*!< DSD_CH DICFG: CSRC Position             */
#define DSD_CH_DICFG_CSRC_Msk                 (0x0fUL << DSD_CH_DICFG_CSRC_Pos)                       /*!< DSD_CH DICFG: CSRC Mask                 */
#define DSD_CH_DICFG_STROBE_Pos               20                                                      /*!< DSD_CH DICFG: STROBE Position           */
#define DSD_CH_DICFG_STROBE_Msk               (0x0fUL << DSD_CH_DICFG_STROBE_Pos)                     /*!< DSD_CH DICFG: STROBE Mask               */
#define DSD_CH_DICFG_SCWC_Pos                 31                                                      /*!< DSD_CH DICFG: SCWC Position             */
#define DSD_CH_DICFG_SCWC_Msk                 (0x01UL << DSD_CH_DICFG_SCWC_Pos)                       /*!< DSD_CH DICFG: SCWC Mask                 */

/* --------------------------------  DSD_CH_FCFGC  -------------------------------- */
#define DSD_CH_FCFGC_CFMDF_Pos                0                                                       /*!< DSD_CH FCFGC: CFMDF Position            */
#define DSD_CH_FCFGC_CFMDF_Msk                (0x000000ffUL << DSD_CH_FCFGC_CFMDF_Pos)                /*!< DSD_CH FCFGC: CFMDF Mask                */
#define DSD_CH_FCFGC_CFMC_Pos                 8                                                       /*!< DSD_CH FCFGC: CFMC Position             */
#define DSD_CH_FCFGC_CFMC_Msk                 (0x03UL << DSD_CH_FCFGC_CFMC_Pos)                       /*!< DSD_CH FCFGC: CFMC Mask                 */
#define DSD_CH_FCFGC_CFEN_Pos                 10                                                      /*!< DSD_CH FCFGC: CFEN Position             */
#define DSD_CH_FCFGC_CFEN_Msk                 (0x01UL << DSD_CH_FCFGC_CFEN_Pos)                       /*!< DSD_CH FCFGC: CFEN Mask                 */
#define DSD_CH_FCFGC_SRGM_Pos                 14                                                      /*!< DSD_CH FCFGC: SRGM Position             */
#define DSD_CH_FCFGC_SRGM_Msk                 (0x03UL << DSD_CH_FCFGC_SRGM_Pos)                       /*!< DSD_CH FCFGC: SRGM Mask                 */
#define DSD_CH_FCFGC_CFMSV_Pos                16                                                      /*!< DSD_CH FCFGC: CFMSV Position            */
#define DSD_CH_FCFGC_CFMSV_Msk                (0x000000ffUL << DSD_CH_FCFGC_CFMSV_Pos)                /*!< DSD_CH FCFGC: CFMSV Mask                */
#define DSD_CH_FCFGC_CFMDCNT_Pos              24                                                      /*!< DSD_CH FCFGC: CFMDCNT Position          */
#define DSD_CH_FCFGC_CFMDCNT_Msk              (0x000000ffUL << DSD_CH_FCFGC_CFMDCNT_Pos)              /*!< DSD_CH FCFGC: CFMDCNT Mask              */

/* --------------------------------  DSD_CH_FCFGA  -------------------------------- */
#define DSD_CH_FCFGA_CFADF_Pos                0                                                       /*!< DSD_CH FCFGA: CFADF Position            */
#define DSD_CH_FCFGA_CFADF_Msk                (0x000000ffUL << DSD_CH_FCFGA_CFADF_Pos)                /*!< DSD_CH FCFGA: CFADF Mask                */
#define DSD_CH_FCFGA_CFAC_Pos                 8                                                       /*!< DSD_CH FCFGA: CFAC Position             */
#define DSD_CH_FCFGA_CFAC_Msk                 (0x03UL << DSD_CH_FCFGA_CFAC_Pos)                       /*!< DSD_CH FCFGA: CFAC Mask                 */
#define DSD_CH_FCFGA_SRGA_Pos                 10                                                      /*!< DSD_CH FCFGA: SRGA Position             */
#define DSD_CH_FCFGA_SRGA_Msk                 (0x03UL << DSD_CH_FCFGA_SRGA_Pos)                       /*!< DSD_CH FCFGA: SRGA Mask                 */
#define DSD_CH_FCFGA_ESEL_Pos                 12                                                      /*!< DSD_CH FCFGA: ESEL Position             */
#define DSD_CH_FCFGA_ESEL_Msk                 (0x03UL << DSD_CH_FCFGA_ESEL_Pos)                       /*!< DSD_CH FCFGA: ESEL Mask                 */
#define DSD_CH_FCFGA_EGT_Pos                  14                                                      /*!< DSD_CH FCFGA: EGT Position              */
#define DSD_CH_FCFGA_EGT_Msk                  (0x01UL << DSD_CH_FCFGA_EGT_Pos)                        /*!< DSD_CH FCFGA: EGT Mask                  */
#define DSD_CH_FCFGA_CFADCNT_Pos              24                                                      /*!< DSD_CH FCFGA: CFADCNT Position          */
#define DSD_CH_FCFGA_CFADCNT_Msk              (0x000000ffUL << DSD_CH_FCFGA_CFADCNT_Pos)              /*!< DSD_CH FCFGA: CFADCNT Mask              */

