FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4400.h
/* --------------------------------  DSD_CH_IWCTR  -------------------------------- */
#define DSD_CH_IWCTR_NVALCNT_Pos              0                                                       /*!< DSD_CH IWCTR: NVALCNT Position          */
#define DSD_CH_IWCTR_NVALCNT_Msk              (0x3fUL << DSD_CH_IWCTR_NVALCNT_Pos)                    /*!< DSD_CH IWCTR: NVALCNT Mask              */
#define DSD_CH_IWCTR_INTEN_Pos                7                                                       /*!< DSD_CH IWCTR: INTEN Position            */
#define DSD_CH_IWCTR_INTEN_Msk                (0x01UL << DSD_CH_IWCTR_INTEN_Pos)                      /*!< DSD_CH IWCTR: INTEN Mask                */
#define DSD_CH_IWCTR_REPCNT_Pos               8                                                       /*!< DSD_CH IWCTR: REPCNT Position           */
#define DSD_CH_IWCTR_REPCNT_Msk               (0x0fUL << DSD_CH_IWCTR_REPCNT_Pos)                     /*!< DSD_CH IWCTR: REPCNT Mask               */
#define DSD_CH_IWCTR_REPVAL_Pos               12                                                      /*!< DSD_CH IWCTR: REPVAL Position           */
#define DSD_CH_IWCTR_REPVAL_Msk               (0x0fUL << DSD_CH_IWCTR_REPVAL_Pos)                     /*!< DSD_CH IWCTR: REPVAL Mask               */
#define DSD_CH_IWCTR_NVALDIS_Pos              16                                                      /*!< DSD_CH IWCTR: NVALDIS Position          */
#define DSD_CH_IWCTR_NVALDIS_Msk              (0x3fUL << DSD_CH_IWCTR_NVALDIS_Pos)                    /*!< DSD_CH IWCTR: NVALDIS Mask              */
#define DSD_CH_IWCTR_IWS_Pos                  23                                                      /*!< DSD_CH IWCTR: IWS Position              */
#define DSD_CH_IWCTR_IWS_Msk                  (0x01UL << DSD_CH_IWCTR_IWS_Pos)                        /*!< DSD_CH IWCTR: IWS Mask                  */
#define DSD_CH_IWCTR_NVALINT_Pos              24                                                      /*!< DSD_CH IWCTR: NVALINT Position          */
#define DSD_CH_IWCTR_NVALINT_Msk              (0x3fUL << DSD_CH_IWCTR_NVALINT_Pos)                    /*!< DSD_CH IWCTR: NVALINT Mask              */

/* -------------------------------  DSD_CH_BOUNDSEL  ------------------------------ */
#define DSD_CH_BOUNDSEL_BOUNDARYL_Pos         0                                                       /*!< DSD_CH BOUNDSEL: BOUNDARYL Position     */
#define DSD_CH_BOUNDSEL_BOUNDARYL_Msk         (0x0000ffffUL << DSD_CH_BOUNDSEL_BOUNDARYL_Pos)         /*!< DSD_CH BOUNDSEL: BOUNDARYL Mask         */
#define DSD_CH_BOUNDSEL_BOUNDARYU_Pos         16                                                      /*!< DSD_CH BOUNDSEL: BOUNDARYU Position     */
#define DSD_CH_BOUNDSEL_BOUNDARYU_Msk         (0x0000ffffUL << DSD_CH_BOUNDSEL_BOUNDARYU_Pos)         /*!< DSD_CH BOUNDSEL: BOUNDARYU Mask         */

/* ---------------------------------  DSD_CH_RESM  -------------------------------- */
#define DSD_CH_RESM_RESULT_Pos                0                                                       /*!< DSD_CH RESM: RESULT Position            */
#define DSD_CH_RESM_RESULT_Msk                (0x0000ffffUL << DSD_CH_RESM_RESULT_Pos)                /*!< DSD_CH RESM: RESULT Mask                */

/* ---------------------------------  DSD_CH_OFFM  -------------------------------- */
#define DSD_CH_OFFM_OFFSET_Pos                0                                                       /*!< DSD_CH OFFM: OFFSET Position            */
#define DSD_CH_OFFM_OFFSET_Msk                (0x0000ffffUL << DSD_CH_OFFM_OFFSET_Pos)                /*!< DSD_CH OFFM: OFFSET Mask                */

/* ---------------------------------  DSD_CH_RESA  -------------------------------- */
#define DSD_CH_RESA_RESULT_Pos                0                                                       /*!< DSD_CH RESA: RESULT Position            */
#define DSD_CH_RESA_RESULT_Msk                (0x0000ffffUL << DSD_CH_RESA_RESULT_Pos)                /*!< DSD_CH RESA: RESULT Mask                */

/* --------------------------------  DSD_CH_TSTMP  -------------------------------- */
#define DSD_CH_TSTMP_RESULT_Pos               0                                                       /*!< DSD_CH TSTMP: RESULT Position           */
#define DSD_CH_TSTMP_RESULT_Msk               (0x0000ffffUL << DSD_CH_TSTMP_RESULT_Pos)               /*!< DSD_CH TSTMP: RESULT Mask               */
#define DSD_CH_TSTMP_CFMDCNT_Pos              16                                                      /*!< DSD_CH TSTMP: CFMDCNT Position          */
#define DSD_CH_TSTMP_CFMDCNT_Msk              (0x000000ffUL << DSD_CH_TSTMP_CFMDCNT_Pos)              /*!< DSD_CH TSTMP: CFMDCNT Mask              */
#define DSD_CH_TSTMP_NVALCNT_Pos              24                                                      /*!< DSD_CH TSTMP: NVALCNT Position          */
#define DSD_CH_TSTMP_NVALCNT_Msk              (0x3fUL << DSD_CH_TSTMP_NVALCNT_Pos)                    /*!< DSD_CH TSTMP: NVALCNT Mask              */

/* --------------------------------  DSD_CH_CGSYNC  ------------------------------- */
#define DSD_CH_CGSYNC_SDCOUNT_Pos             0                                                       /*!< DSD_CH CGSYNC: SDCOUNT Position         */
#define DSD_CH_CGSYNC_SDCOUNT_Msk             (0x000000ffUL << DSD_CH_CGSYNC_SDCOUNT_Pos)             /*!< DSD_CH CGSYNC: SDCOUNT Mask             */
#define DSD_CH_CGSYNC_SDCAP_Pos               8                                                       /*!< DSD_CH CGSYNC: SDCAP Position           */
#define DSD_CH_CGSYNC_SDCAP_Msk               (0x000000ffUL << DSD_CH_CGSYNC_SDCAP_Pos)               /*!< DSD_CH CGSYNC: SDCAP Mask               */
#define DSD_CH_CGSYNC_SDPOS_Pos               16                                                      /*!< DSD_CH CGSYNC: SDPOS Position           */
#define DSD_CH_CGSYNC_SDPOS_Msk               (0x000000ffUL << DSD_CH_CGSYNC_SDPOS_Pos)               /*!< DSD_CH CGSYNC: SDPOS Mask               */
#define DSD_CH_CGSYNC_SDNEG_Pos               24                                                      /*!< DSD_CH CGSYNC: SDNEG Position           */
#define DSD_CH_CGSYNC_SDNEG_Msk               (0x000000ffUL << DSD_CH_CGSYNC_SDNEG_Pos)               /*!< DSD_CH CGSYNC: SDNEG Mask               */

