FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4400.h
/* -------------------------------  HRPWM0_CSGTRSG  ------------------------------- */
#define HRPWM0_CSGTRSG_D0STE_Pos              0                                                       /*!< HRPWM0 CSGTRSG: D0STE Position          */
#define HRPWM0_CSGTRSG_D0STE_Msk              (0x01UL << HRPWM0_CSGTRSG_D0STE_Pos)                    /*!< HRPWM0 CSGTRSG: D0STE Mask              */
#define HRPWM0_CSGTRSG_SW0ST_Pos              1                                                       /*!< HRPWM0 CSGTRSG: SW0ST Position          */
#define HRPWM0_CSGTRSG_SW0ST_Msk              (0x01UL << HRPWM0_CSGTRSG_SW0ST_Pos)                    /*!< HRPWM0 CSGTRSG: SW0ST Mask              */
#define HRPWM0_CSGTRSG_D1STE_Pos              4                                                       /*!< HRPWM0 CSGTRSG: D1STE Position          */
#define HRPWM0_CSGTRSG_D1STE_Msk              (0x01UL << HRPWM0_CSGTRSG_D1STE_Pos)                    /*!< HRPWM0 CSGTRSG: D1STE Mask              */
#define HRPWM0_CSGTRSG_SW1ST_Pos              5                                                       /*!< HRPWM0 CSGTRSG: SW1ST Position          */
#define HRPWM0_CSGTRSG_SW1ST_Msk              (0x01UL << HRPWM0_CSGTRSG_SW1ST_Pos)                    /*!< HRPWM0 CSGTRSG: SW1ST Mask              */
#define HRPWM0_CSGTRSG_D2STE_Pos              8                                                       /*!< HRPWM0 CSGTRSG: D2STE Position          */
#define HRPWM0_CSGTRSG_D2STE_Msk              (0x01UL << HRPWM0_CSGTRSG_D2STE_Pos)                    /*!< HRPWM0 CSGTRSG: D2STE Mask              */
#define HRPWM0_CSGTRSG_SW2ST_Pos              9                                                       /*!< HRPWM0 CSGTRSG: SW2ST Position          */
#define HRPWM0_CSGTRSG_SW2ST_Msk              (0x01UL << HRPWM0_CSGTRSG_SW2ST_Pos)                    /*!< HRPWM0 CSGTRSG: SW2ST Mask              */

/* --------------------------------  HRPWM0_HRCCFG  ------------------------------- */
#define HRPWM0_HRCCFG_HRCPM_Pos               0                                                       /*!< HRPWM0 HRCCFG: HRCPM Position           */
#define HRPWM0_HRCCFG_HRCPM_Msk               (0x01UL << HRPWM0_HRCCFG_HRCPM_Pos)                     /*!< HRPWM0 HRCCFG: HRCPM Mask               */
#define HRPWM0_HRCCFG_HRC0E_Pos               4                                                       /*!< HRPWM0 HRCCFG: HRC0E Position           */
#define HRPWM0_HRCCFG_HRC0E_Msk               (0x01UL << HRPWM0_HRCCFG_HRC0E_Pos)                     /*!< HRPWM0 HRCCFG: HRC0E Mask               */
#define HRPWM0_HRCCFG_HRC1E_Pos               5                                                       /*!< HRPWM0 HRCCFG: HRC1E Position           */
#define HRPWM0_HRCCFG_HRC1E_Msk               (0x01UL << HRPWM0_HRCCFG_HRC1E_Pos)                     /*!< HRPWM0 HRCCFG: HRC1E Mask               */
#define HRPWM0_HRCCFG_HRC2E_Pos               6                                                       /*!< HRPWM0 HRCCFG: HRC2E Position           */
#define HRPWM0_HRCCFG_HRC2E_Msk               (0x01UL << HRPWM0_HRCCFG_HRC2E_Pos)                     /*!< HRPWM0 HRCCFG: HRC2E Mask               */
#define HRPWM0_HRCCFG_HRC3E_Pos               7                                                       /*!< HRPWM0 HRCCFG: HRC3E Position           */
#define HRPWM0_HRCCFG_HRC3E_Msk               (0x01UL << HRPWM0_HRCCFG_HRC3E_Pos)                     /*!< HRPWM0 HRCCFG: HRC3E Mask               */
#define HRPWM0_HRCCFG_CLKC_Pos                16                                                      /*!< HRPWM0 HRCCFG: CLKC Position            */
#define HRPWM0_HRCCFG_CLKC_Msk                (0x07UL << HRPWM0_HRCCFG_CLKC_Pos)                      /*!< HRPWM0 HRCCFG: CLKC Mask                */
#define HRPWM0_HRCCFG_LRC0E_Pos               20                                                      /*!< HRPWM0 HRCCFG: LRC0E Position           */
#define HRPWM0_HRCCFG_LRC0E_Msk               (0x01UL << HRPWM0_HRCCFG_LRC0E_Pos)                     /*!< HRPWM0 HRCCFG: LRC0E Mask               */
#define HRPWM0_HRCCFG_LRC1E_Pos               21                                                      /*!< HRPWM0 HRCCFG: LRC1E Position           */
#define HRPWM0_HRCCFG_LRC1E_Msk               (0x01UL << HRPWM0_HRCCFG_LRC1E_Pos)                     /*!< HRPWM0 HRCCFG: LRC1E Mask               */
#define HRPWM0_HRCCFG_LRC2E_Pos               22                                                      /*!< HRPWM0 HRCCFG: LRC2E Position           */
#define HRPWM0_HRCCFG_LRC2E_Msk               (0x01UL << HRPWM0_HRCCFG_LRC2E_Pos)                     /*!< HRPWM0 HRCCFG: LRC2E Mask               */
#define HRPWM0_HRCCFG_LRC3E_Pos               23                                                      /*!< HRPWM0 HRCCFG: LRC3E Position           */
#define HRPWM0_HRCCFG_LRC3E_Msk               (0x01UL << HRPWM0_HRCCFG_LRC3E_Pos)                     /*!< HRPWM0 HRCCFG: LRC3E Mask               */

/* -------------------------------  HRPWM0_HRCSTRG  ------------------------------- */
#define HRPWM0_HRCSTRG_H0ES_Pos               0                                                       /*!< HRPWM0 HRCSTRG: H0ES Position           */
#define HRPWM0_HRCSTRG_H0ES_Msk               (0x01UL << HRPWM0_HRCSTRG_H0ES_Pos)                     /*!< HRPWM0 HRCSTRG: H0ES Mask               */
#define HRPWM0_HRCSTRG_H0DES_Pos              1                                                       /*!< HRPWM0 HRCSTRG: H0DES Position          */
#define HRPWM0_HRCSTRG_H0DES_Msk              (0x01UL << HRPWM0_HRCSTRG_H0DES_Pos)                    /*!< HRPWM0 HRCSTRG: H0DES Mask              */
#define HRPWM0_HRCSTRG_H1ES_Pos               4                                                       /*!< HRPWM0 HRCSTRG: H1ES Position           */
#define HRPWM0_HRCSTRG_H1ES_Msk               (0x01UL << HRPWM0_HRCSTRG_H1ES_Pos)                     /*!< HRPWM0 HRCSTRG: H1ES Mask               */
#define HRPWM0_HRCSTRG_H1DES_Pos              5                                                       /*!< HRPWM0 HRCSTRG: H1DES Position          */
#define HRPWM0_HRCSTRG_H1DES_Msk              (0x01UL << HRPWM0_HRCSTRG_H1DES_Pos)                    /*!< HRPWM0 HRCSTRG: H1DES Mask              */
#define HRPWM0_HRCSTRG_H2ES_Pos               8                                                       /*!< HRPWM0 HRCSTRG: H2ES Position           */
#define HRPWM0_HRCSTRG_H2ES_Msk               (0x01UL << HRPWM0_HRCSTRG_H2ES_Pos)                     /*!< HRPWM0 HRCSTRG: H2ES Mask               */
#define HRPWM0_HRCSTRG_H2DES_Pos              9                                                       /*!< HRPWM0 HRCSTRG: H2DES Position          */
#define HRPWM0_HRCSTRG_H2DES_Msk              (0x01UL << HRPWM0_HRCSTRG_H2DES_Pos)                    /*!< HRPWM0 HRCSTRG: H2DES Mask              */
#define HRPWM0_HRCSTRG_H3ES_Pos               12                                                      /*!< HRPWM0 HRCSTRG: H3ES Position           */
#define HRPWM0_HRCSTRG_H3ES_Msk               (0x01UL << HRPWM0_HRCSTRG_H3ES_Pos)                     /*!< HRPWM0 HRCSTRG: H3ES Mask               */
#define HRPWM0_HRCSTRG_H3DES_Pos              13                                                      /*!< HRPWM0 HRCSTRG: H3DES Position          */
#define HRPWM0_HRCSTRG_H3DES_Msk              (0x01UL << HRPWM0_HRCSTRG_H3DES_Pos)                    /*!< HRPWM0 HRCSTRG: H3DES Mask              */

