FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4400.h
/* -------------------------------  HRPWM0_CSG_SRS  ------------------------------- */
#define HRPWM0_CSG_SRS_VLS1S_Pos              0                                                       /*!< HRPWM0_CSG SRS: VLS1S Position          */
#define HRPWM0_CSG_SRS_VLS1S_Msk              (0x03UL << HRPWM0_CSG_SRS_VLS1S_Pos)                    /*!< HRPWM0_CSG SRS: VLS1S Mask              */
#define HRPWM0_CSG_SRS_VLS2S_Pos              2                                                       /*!< HRPWM0_CSG SRS: VLS2S Position          */
#define HRPWM0_CSG_SRS_VLS2S_Msk              (0x03UL << HRPWM0_CSG_SRS_VLS2S_Pos)                    /*!< HRPWM0_CSG SRS: VLS2S Mask              */
#define HRPWM0_CSG_SRS_TRLS_Pos               4                                                       /*!< HRPWM0_CSG SRS: TRLS Position           */
#define HRPWM0_CSG_SRS_TRLS_Msk               (0x03UL << HRPWM0_CSG_SRS_TRLS_Pos)                     /*!< HRPWM0_CSG SRS: TRLS Mask               */
#define HRPWM0_CSG_SRS_SSLS_Pos               6                                                       /*!< HRPWM0_CSG SRS: SSLS Position           */
#define HRPWM0_CSG_SRS_SSLS_Msk               (0x03UL << HRPWM0_CSG_SRS_SSLS_Pos)                     /*!< HRPWM0_CSG SRS: SSLS Mask               */
#define HRPWM0_CSG_SRS_STLS_Pos               8                                                       /*!< HRPWM0_CSG SRS: STLS Position           */
#define HRPWM0_CSG_SRS_STLS_Msk               (0x03UL << HRPWM0_CSG_SRS_STLS_Pos)                     /*!< HRPWM0_CSG SRS: STLS Mask               */
#define HRPWM0_CSG_SRS_CRFLS_Pos              10                                                      /*!< HRPWM0_CSG SRS: CRFLS Position          */
#define HRPWM0_CSG_SRS_CRFLS_Msk              (0x03UL << HRPWM0_CSG_SRS_CRFLS_Pos)                    /*!< HRPWM0_CSG SRS: CRFLS Mask              */
#define HRPWM0_CSG_SRS_CSLS_Pos               12                                                      /*!< HRPWM0_CSG SRS: CSLS Position           */
#define HRPWM0_CSG_SRS_CSLS_Msk               (0x03UL << HRPWM0_CSG_SRS_CSLS_Pos)                     /*!< HRPWM0_CSG SRS: CSLS Mask               */

/* -------------------------------  HRPWM0_CSG_SWS  ------------------------------- */
#define HRPWM0_CSG_SWS_SVLS1_Pos              0                                                       /*!< HRPWM0_CSG SWS: SVLS1 Position          */
#define HRPWM0_CSG_SWS_SVLS1_Msk              (0x01UL << HRPWM0_CSG_SWS_SVLS1_Pos)                    /*!< HRPWM0_CSG SWS: SVLS1 Mask              */
#define HRPWM0_CSG_SWS_SVLS2_Pos              1                                                       /*!< HRPWM0_CSG SWS: SVLS2 Position          */
#define HRPWM0_CSG_SWS_SVLS2_Msk              (0x01UL << HRPWM0_CSG_SWS_SVLS2_Pos)                    /*!< HRPWM0_CSG SWS: SVLS2 Mask              */
#define HRPWM0_CSG_SWS_STRGS_Pos              2                                                       /*!< HRPWM0_CSG SWS: STRGS Position          */
#define HRPWM0_CSG_SWS_STRGS_Msk              (0x01UL << HRPWM0_CSG_SWS_STRGS_Pos)                    /*!< HRPWM0_CSG SWS: STRGS Mask              */
#define HRPWM0_CSG_SWS_SSTRS_Pos              3                                                       /*!< HRPWM0_CSG SWS: SSTRS Position          */
#define HRPWM0_CSG_SWS_SSTRS_Msk              (0x01UL << HRPWM0_CSG_SWS_SSTRS_Pos)                    /*!< HRPWM0_CSG SWS: SSTRS Mask              */
#define HRPWM0_CSG_SWS_SSTPS_Pos              4                                                       /*!< HRPWM0_CSG SWS: SSTPS Position          */
#define HRPWM0_CSG_SWS_SSTPS_Msk              (0x01UL << HRPWM0_CSG_SWS_SSTPS_Pos)                    /*!< HRPWM0_CSG SWS: SSTPS Mask              */
#define HRPWM0_CSG_SWS_SSTD_Pos               5                                                       /*!< HRPWM0_CSG SWS: SSTD Position           */
#define HRPWM0_CSG_SWS_SSTD_Msk               (0x01UL << HRPWM0_CSG_SWS_SSTD_Pos)                     /*!< HRPWM0_CSG SWS: SSTD Mask               */
#define HRPWM0_CSG_SWS_SCRS_Pos               6                                                       /*!< HRPWM0_CSG SWS: SCRS Position           */
#define HRPWM0_CSG_SWS_SCRS_Msk               (0x01UL << HRPWM0_CSG_SWS_SCRS_Pos)                     /*!< HRPWM0_CSG SWS: SCRS Mask               */
#define HRPWM0_CSG_SWS_SCFS_Pos               7                                                       /*!< HRPWM0_CSG SWS: SCFS Position           */
#define HRPWM0_CSG_SWS_SCFS_Msk               (0x01UL << HRPWM0_CSG_SWS_SCFS_Pos)                     /*!< HRPWM0_CSG SWS: SCFS Mask               */
#define HRPWM0_CSG_SWS_SCSS_Pos               8                                                       /*!< HRPWM0_CSG SWS: SCSS Position           */
#define HRPWM0_CSG_SWS_SCSS_Msk               (0x01UL << HRPWM0_CSG_SWS_SCSS_Pos)                     /*!< HRPWM0_CSG SWS: SCSS Mask               */

/* -------------------------------  HRPWM0_CSG_SWC  ------------------------------- */
#define HRPWM0_CSG_SWC_CVLS1_Pos              0                                                       /*!< HRPWM0_CSG SWC: CVLS1 Position          */
#define HRPWM0_CSG_SWC_CVLS1_Msk              (0x01UL << HRPWM0_CSG_SWC_CVLS1_Pos)                    /*!< HRPWM0_CSG SWC: CVLS1 Mask              */
#define HRPWM0_CSG_SWC_CVLS2_Pos              1                                                       /*!< HRPWM0_CSG SWC: CVLS2 Position          */
#define HRPWM0_CSG_SWC_CVLS2_Msk              (0x01UL << HRPWM0_CSG_SWC_CVLS2_Pos)                    /*!< HRPWM0_CSG SWC: CVLS2 Mask              */
#define HRPWM0_CSG_SWC_CTRGS_Pos              2                                                       /*!< HRPWM0_CSG SWC: CTRGS Position          */
#define HRPWM0_CSG_SWC_CTRGS_Msk              (0x01UL << HRPWM0_CSG_SWC_CTRGS_Pos)                    /*!< HRPWM0_CSG SWC: CTRGS Mask              */
#define HRPWM0_CSG_SWC_CSTRS_Pos              3                                                       /*!< HRPWM0_CSG SWC: CSTRS Position          */
#define HRPWM0_CSG_SWC_CSTRS_Msk              (0x01UL << HRPWM0_CSG_SWC_CSTRS_Pos)                    /*!< HRPWM0_CSG SWC: CSTRS Mask              */
#define HRPWM0_CSG_SWC_CSTPS_Pos              4                                                       /*!< HRPWM0_CSG SWC: CSTPS Position          */
#define HRPWM0_CSG_SWC_CSTPS_Msk              (0x01UL << HRPWM0_CSG_SWC_CSTPS_Pos)                    /*!< HRPWM0_CSG SWC: CSTPS Mask              */
#define HRPWM0_CSG_SWC_CSTD_Pos               5                                                       /*!< HRPWM0_CSG SWC: CSTD Position           */
#define HRPWM0_CSG_SWC_CSTD_Msk               (0x01UL << HRPWM0_CSG_SWC_CSTD_Pos)                     /*!< HRPWM0_CSG SWC: CSTD Mask               */
#define HRPWM0_CSG_SWC_CCRS_Pos               6                                                       /*!< HRPWM0_CSG SWC: CCRS Position           */
#define HRPWM0_CSG_SWC_CCRS_Msk               (0x01UL << HRPWM0_CSG_SWC_CCRS_Pos)                     /*!< HRPWM0_CSG SWC: CCRS Mask               */
#define HRPWM0_CSG_SWC_CCFS_Pos               7                                                       /*!< HRPWM0_CSG SWC: CCFS Position           */
#define HRPWM0_CSG_SWC_CCFS_Msk               (0x01UL << HRPWM0_CSG_SWC_CCFS_Pos)                     /*!< HRPWM0_CSG SWC: CCFS Mask               */
#define HRPWM0_CSG_SWC_CCSS_Pos               8                                                       /*!< HRPWM0_CSG SWC: CCSS Position           */
#define HRPWM0_CSG_SWC_CCSS_Msk               (0x01UL << HRPWM0_CSG_SWC_CCSS_Pos)                     /*!< HRPWM0_CSG SWC: CCSS Mask               */

