FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4400.h
/* ------------------------------  HRPWM0_CSG_ISTAT  ------------------------------ */
#define HRPWM0_CSG_ISTAT_VLS1S_Pos            0                                                       /*!< HRPWM0_CSG ISTAT: VLS1S Position        */
#define HRPWM0_CSG_ISTAT_VLS1S_Msk            (0x01UL << HRPWM0_CSG_ISTAT_VLS1S_Pos)                  /*!< HRPWM0_CSG ISTAT: VLS1S Mask            */
#define HRPWM0_CSG_ISTAT_VLS2S_Pos            1                                                       /*!< HRPWM0_CSG ISTAT: VLS2S Position        */
#define HRPWM0_CSG_ISTAT_VLS2S_Msk            (0x01UL << HRPWM0_CSG_ISTAT_VLS2S_Pos)                  /*!< HRPWM0_CSG ISTAT: VLS2S Mask            */
#define HRPWM0_CSG_ISTAT_TRGSS_Pos            2                                                       /*!< HRPWM0_CSG ISTAT: TRGSS Position        */
#define HRPWM0_CSG_ISTAT_TRGSS_Msk            (0x01UL << HRPWM0_CSG_ISTAT_TRGSS_Pos)                  /*!< HRPWM0_CSG ISTAT: TRGSS Mask            */
#define HRPWM0_CSG_ISTAT_STRSS_Pos            3                                                       /*!< HRPWM0_CSG ISTAT: STRSS Position        */
#define HRPWM0_CSG_ISTAT_STRSS_Msk            (0x01UL << HRPWM0_CSG_ISTAT_STRSS_Pos)                  /*!< HRPWM0_CSG ISTAT: STRSS Mask            */
#define HRPWM0_CSG_ISTAT_STPSS_Pos            4                                                       /*!< HRPWM0_CSG ISTAT: STPSS Position        */
#define HRPWM0_CSG_ISTAT_STPSS_Msk            (0x01UL << HRPWM0_CSG_ISTAT_STPSS_Pos)                  /*!< HRPWM0_CSG ISTAT: STPSS Mask            */
#define HRPWM0_CSG_ISTAT_STDS_Pos             5                                                       /*!< HRPWM0_CSG ISTAT: STDS Position         */
#define HRPWM0_CSG_ISTAT_STDS_Msk             (0x01UL << HRPWM0_CSG_ISTAT_STDS_Pos)                   /*!< HRPWM0_CSG ISTAT: STDS Mask             */
#define HRPWM0_CSG_ISTAT_CRSS_Pos             6                                                       /*!< HRPWM0_CSG ISTAT: CRSS Position         */
#define HRPWM0_CSG_ISTAT_CRSS_Msk             (0x01UL << HRPWM0_CSG_ISTAT_CRSS_Pos)                   /*!< HRPWM0_CSG ISTAT: CRSS Mask             */
#define HRPWM0_CSG_ISTAT_CFSS_Pos             7                                                       /*!< HRPWM0_CSG ISTAT: CFSS Position         */
#define HRPWM0_CSG_ISTAT_CFSS_Msk             (0x01UL << HRPWM0_CSG_ISTAT_CFSS_Pos)                   /*!< HRPWM0_CSG ISTAT: CFSS Mask             */
#define HRPWM0_CSG_ISTAT_CSES_Pos             8                                                       /*!< HRPWM0_CSG ISTAT: CSES Position         */
#define HRPWM0_CSG_ISTAT_CSES_Msk             (0x01UL << HRPWM0_CSG_ISTAT_CSES_Pos)                   /*!< HRPWM0_CSG ISTAT: CSES Mask             */


/* ================================================================================ */
/* ================      struct 'HRPWM0_CSG0' Position & Mask      ================ */
/* ================================================================================ */


/* -------------------------------  HRPWM0_CSG0_DCI  ------------------------------ */
#define HRPWM0_CSG0_DCI_SVIS_Pos              0                                                       /*!< HRPWM0_CSG0 DCI: SVIS Position          */
#define HRPWM0_CSG0_DCI_SVIS_Msk              (0x0fUL << HRPWM0_CSG0_DCI_SVIS_Pos)                    /*!< HRPWM0_CSG0 DCI: SVIS Mask              */
#define HRPWM0_CSG0_DCI_STRIS_Pos             4                                                       /*!< HRPWM0_CSG0 DCI: STRIS Position         */
#define HRPWM0_CSG0_DCI_STRIS_Msk             (0x0fUL << HRPWM0_CSG0_DCI_STRIS_Pos)                   /*!< HRPWM0_CSG0 DCI: STRIS Mask             */
#define HRPWM0_CSG0_DCI_STPIS_Pos             8                                                       /*!< HRPWM0_CSG0 DCI: STPIS Position         */
#define HRPWM0_CSG0_DCI_STPIS_Msk             (0x0fUL << HRPWM0_CSG0_DCI_STPIS_Pos)                   /*!< HRPWM0_CSG0 DCI: STPIS Mask             */
#define HRPWM0_CSG0_DCI_TRGIS_Pos             12                                                      /*!< HRPWM0_CSG0 DCI: TRGIS Position         */
#define HRPWM0_CSG0_DCI_TRGIS_Msk             (0x0fUL << HRPWM0_CSG0_DCI_TRGIS_Pos)                   /*!< HRPWM0_CSG0 DCI: TRGIS Mask             */
#define HRPWM0_CSG0_DCI_STIS_Pos              16                                                      /*!< HRPWM0_CSG0 DCI: STIS Position          */
#define HRPWM0_CSG0_DCI_STIS_Msk              (0x0fUL << HRPWM0_CSG0_DCI_STIS_Pos)                    /*!< HRPWM0_CSG0 DCI: STIS Mask              */
#define HRPWM0_CSG0_DCI_SCS_Pos               20                                                      /*!< HRPWM0_CSG0 DCI: SCS Position           */
#define HRPWM0_CSG0_DCI_SCS_Msk               (0x03UL << HRPWM0_CSG0_DCI_SCS_Pos)                     /*!< HRPWM0_CSG0 DCI: SCS Mask               */

/* -------------------------------  HRPWM0_CSG0_IES  ------------------------------ */
#define HRPWM0_CSG0_IES_SVLS_Pos              0                                                       /*!< HRPWM0_CSG0 IES: SVLS Position          */
#define HRPWM0_CSG0_IES_SVLS_Msk              (0x03UL << HRPWM0_CSG0_IES_SVLS_Pos)                    /*!< HRPWM0_CSG0 IES: SVLS Mask              */
#define HRPWM0_CSG0_IES_STRES_Pos             2                                                       /*!< HRPWM0_CSG0 IES: STRES Position         */
#define HRPWM0_CSG0_IES_STRES_Msk             (0x03UL << HRPWM0_CSG0_IES_STRES_Pos)                   /*!< HRPWM0_CSG0 IES: STRES Mask             */
#define HRPWM0_CSG0_IES_STPES_Pos             4                                                       /*!< HRPWM0_CSG0 IES: STPES Position         */
#define HRPWM0_CSG0_IES_STPES_Msk             (0x03UL << HRPWM0_CSG0_IES_STPES_Pos)                   /*!< HRPWM0_CSG0 IES: STPES Mask             */
#define HRPWM0_CSG0_IES_TRGES_Pos             6                                                       /*!< HRPWM0_CSG0 IES: TRGES Position         */
#define HRPWM0_CSG0_IES_TRGES_Msk             (0x03UL << HRPWM0_CSG0_IES_TRGES_Pos)                   /*!< HRPWM0_CSG0 IES: TRGES Mask             */
#define HRPWM0_CSG0_IES_STES_Pos              8                                                       /*!< HRPWM0_CSG0 IES: STES Position          */
#define HRPWM0_CSG0_IES_STES_Msk              (0x03UL << HRPWM0_CSG0_IES_STES_Pos)                    /*!< HRPWM0_CSG0 IES: STES Mask              */

/* -------------------------------  HRPWM0_CSG0_SC  ------------------------------- */
#define HRPWM0_CSG0_SC_PSRM_Pos               0                                                       /*!< HRPWM0_CSG0 SC: PSRM Position           */
#define HRPWM0_CSG0_SC_PSRM_Msk               (0x03UL << HRPWM0_CSG0_SC_PSRM_Pos)                     /*!< HRPWM0_CSG0 SC: PSRM Mask               */
#define HRPWM0_CSG0_SC_PSTM_Pos               2                                                       /*!< HRPWM0_CSG0 SC: PSTM Position           */
#define HRPWM0_CSG0_SC_PSTM_Msk               (0x03UL << HRPWM0_CSG0_SC_PSTM_Pos)                     /*!< HRPWM0_CSG0 SC: PSTM Mask               */
#define HRPWM0_CSG0_SC_FPD_Pos                4                                                       /*!< HRPWM0_CSG0 SC: FPD Position            */
#define HRPWM0_CSG0_SC_FPD_Msk                (0x01UL << HRPWM0_CSG0_SC_FPD_Pos)                      /*!< HRPWM0_CSG0 SC: FPD Mask                */
#define HRPWM0_CSG0_SC_PSV_Pos                5                                                       /*!< HRPWM0_CSG0 SC: PSV Position            */
#define HRPWM0_CSG0_SC_PSV_Msk                (0x03UL << HRPWM0_CSG0_SC_PSV_Pos)                      /*!< HRPWM0_CSG0 SC: PSV Mask                */
#define HRPWM0_CSG0_SC_SCM_Pos                8                                                       /*!< HRPWM0_CSG0 SC: SCM Position            */
#define HRPWM0_CSG0_SC_SCM_Msk                (0x03UL << HRPWM0_CSG0_SC_SCM_Pos)                      /*!< HRPWM0_CSG0 SC: SCM Mask                */
#define HRPWM0_CSG0_SC_SSRM_Pos               10                                                      /*!< HRPWM0_CSG0 SC: SSRM Position           */
#define HRPWM0_CSG0_SC_SSRM_Msk               (0x03UL << HRPWM0_CSG0_SC_SSRM_Pos)                     /*!< HRPWM0_CSG0 SC: SSRM Mask               */
#define HRPWM0_CSG0_SC_SSTM_Pos               12                                                      /*!< HRPWM0_CSG0 SC: SSTM Position           */
#define HRPWM0_CSG0_SC_SSTM_Msk               (0x03UL << HRPWM0_CSG0_SC_SSTM_Pos)                     /*!< HRPWM0_CSG0 SC: SSTM Mask               */
#define HRPWM0_CSG0_SC_SVSC_Pos               14                                                      /*!< HRPWM0_CSG0 SC: SVSC Position           */
#define HRPWM0_CSG0_SC_SVSC_Msk               (0x03UL << HRPWM0_CSG0_SC_SVSC_Pos)                     /*!< HRPWM0_CSG0 SC: SVSC Mask               */
#define HRPWM0_CSG0_SC_SWSM_Pos               16                                                      /*!< HRPWM0_CSG0 SC: SWSM Position           */
#define HRPWM0_CSG0_SC_SWSM_Msk               (0x03UL << HRPWM0_CSG0_SC_SWSM_Pos)                     /*!< HRPWM0_CSG0 SC: SWSM Mask               */
#define HRPWM0_CSG0_SC_GCFG_Pos               18                                                      /*!< HRPWM0_CSG0 SC: GCFG Position           */
#define HRPWM0_CSG0_SC_GCFG_Msk               (0x03UL << HRPWM0_CSG0_SC_GCFG_Pos)                     /*!< HRPWM0_CSG0 SC: GCFG Mask               */
#define HRPWM0_CSG0_SC_IST_Pos                20                                                      /*!< HRPWM0_CSG0 SC: IST Position            */
#define HRPWM0_CSG0_SC_IST_Msk                (0x01UL << HRPWM0_CSG0_SC_IST_Pos)                      /*!< HRPWM0_CSG0 SC: IST Mask                */
#define HRPWM0_CSG0_SC_PSE_Pos                21                                                      /*!< HRPWM0_CSG0 SC: PSE Position            */
#define HRPWM0_CSG0_SC_PSE_Msk                (0x01UL << HRPWM0_CSG0_SC_PSE_Pos)                      /*!< HRPWM0_CSG0 SC: PSE Mask                */
#define HRPWM0_CSG0_SC_PSWM_Pos               24                                                      /*!< HRPWM0_CSG0 SC: PSWM Position           */
#define HRPWM0_CSG0_SC_PSWM_Msk               (0x03UL << HRPWM0_CSG0_SC_PSWM_Pos)                     /*!< HRPWM0_CSG0 SC: PSWM Mask               */

/* -------------------------------  HRPWM0_CSG0_PC  ------------------------------- */
#define HRPWM0_CSG0_PC_PSWV_Pos               0                                                       /*!< HRPWM0_CSG0 PC: PSWV Position           */
#define HRPWM0_CSG0_PC_PSWV_Msk               (0x3fUL << HRPWM0_CSG0_PC_PSWV_Pos)                     /*!< HRPWM0_CSG0 PC: PSWV Mask               */

