FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4400.h
/* ------------------------------  HRPWM0_CSG0_DSV1  ------------------------------ */
#define HRPWM0_CSG0_DSV1_DSV1_Pos             0                                                       /*!< HRPWM0_CSG0 DSV1: DSV1 Position         */
#define HRPWM0_CSG0_DSV1_DSV1_Msk             (0x000003ffUL << HRPWM0_CSG0_DSV1_DSV1_Pos)             /*!< HRPWM0_CSG0 DSV1: DSV1 Mask             */

/* ------------------------------  HRPWM0_CSG0_DSV2  ------------------------------ */
#define HRPWM0_CSG0_DSV2_DSV2_Pos             0                                                       /*!< HRPWM0_CSG0 DSV2: DSV2 Position         */
#define HRPWM0_CSG0_DSV2_DSV2_Msk             (0x000003ffUL << HRPWM0_CSG0_DSV2_DSV2_Pos)             /*!< HRPWM0_CSG0 DSV2: DSV2 Mask             */

/* ------------------------------  HRPWM0_CSG0_SDSV1  ----------------------------- */
#define HRPWM0_CSG0_SDSV1_SDSV1_Pos           0                                                       /*!< HRPWM0_CSG0 SDSV1: SDSV1 Position       */
#define HRPWM0_CSG0_SDSV1_SDSV1_Msk           (0x000003ffUL << HRPWM0_CSG0_SDSV1_SDSV1_Pos)           /*!< HRPWM0_CSG0 SDSV1: SDSV1 Mask           */

/* -------------------------------  HRPWM0_CSG0_SPC  ------------------------------ */
#define HRPWM0_CSG0_SPC_SPSWV_Pos             0                                                       /*!< HRPWM0_CSG0 SPC: SPSWV Position         */
#define HRPWM0_CSG0_SPC_SPSWV_Msk             (0x3fUL << HRPWM0_CSG0_SPC_SPSWV_Pos)                   /*!< HRPWM0_CSG0 SPC: SPSWV Mask             */

/* -------------------------------  HRPWM0_CSG0_CC  ------------------------------- */
#define HRPWM0_CSG0_CC_IBS_Pos                0                                                       /*!< HRPWM0_CSG0 CC: IBS Position            */
#define HRPWM0_CSG0_CC_IBS_Msk                (0x0fUL << HRPWM0_CSG0_CC_IBS_Pos)                      /*!< HRPWM0_CSG0 CC: IBS Mask                */
#define HRPWM0_CSG0_CC_IMCS_Pos               8                                                       /*!< HRPWM0_CSG0 CC: IMCS Position           */
#define HRPWM0_CSG0_CC_IMCS_Msk               (0x01UL << HRPWM0_CSG0_CC_IMCS_Pos)                     /*!< HRPWM0_CSG0 CC: IMCS Mask               */
#define HRPWM0_CSG0_CC_IMCC_Pos               9                                                       /*!< HRPWM0_CSG0 CC: IMCC Position           */
#define HRPWM0_CSG0_CC_IMCC_Msk               (0x03UL << HRPWM0_CSG0_CC_IMCC_Pos)                     /*!< HRPWM0_CSG0 CC: IMCC Mask               */
#define HRPWM0_CSG0_CC_ESE_Pos                11                                                      /*!< HRPWM0_CSG0 CC: ESE Position            */
#define HRPWM0_CSG0_CC_ESE_Msk                (0x01UL << HRPWM0_CSG0_CC_ESE_Pos)                      /*!< HRPWM0_CSG0 CC: ESE Mask                */
#define HRPWM0_CSG0_CC_OIE_Pos                12                                                      /*!< HRPWM0_CSG0 CC: OIE Position            */
#define HRPWM0_CSG0_CC_OIE_Msk                (0x01UL << HRPWM0_CSG0_CC_OIE_Pos)                      /*!< HRPWM0_CSG0 CC: OIE Mask                */
#define HRPWM0_CSG0_CC_OSE_Pos                13                                                      /*!< HRPWM0_CSG0 CC: OSE Position            */
#define HRPWM0_CSG0_CC_OSE_Msk                (0x01UL << HRPWM0_CSG0_CC_OSE_Pos)                      /*!< HRPWM0_CSG0 CC: OSE Mask                */
#define HRPWM0_CSG0_CC_BLMC_Pos               14                                                      /*!< HRPWM0_CSG0 CC: BLMC Position           */
#define HRPWM0_CSG0_CC_BLMC_Msk               (0x03UL << HRPWM0_CSG0_CC_BLMC_Pos)                     /*!< HRPWM0_CSG0 CC: BLMC Mask               */
#define HRPWM0_CSG0_CC_EBE_Pos                16                                                      /*!< HRPWM0_CSG0 CC: EBE Position            */
#define HRPWM0_CSG0_CC_EBE_Msk                (0x01UL << HRPWM0_CSG0_CC_EBE_Pos)                      /*!< HRPWM0_CSG0 CC: EBE Mask                */
#define HRPWM0_CSG0_CC_COFE_Pos               17                                                      /*!< HRPWM0_CSG0 CC: COFE Position           */
#define HRPWM0_CSG0_CC_COFE_Msk               (0x01UL << HRPWM0_CSG0_CC_COFE_Pos)                     /*!< HRPWM0_CSG0 CC: COFE Mask               */
#define HRPWM0_CSG0_CC_COFM_Pos               18                                                      /*!< HRPWM0_CSG0 CC: COFM Position           */
#define HRPWM0_CSG0_CC_COFM_Msk               (0x0fUL << HRPWM0_CSG0_CC_COFM_Pos)                     /*!< HRPWM0_CSG0 CC: COFM Mask               */
#define HRPWM0_CSG0_CC_COFC_Pos               24                                                      /*!< HRPWM0_CSG0 CC: COFC Position           */
#define HRPWM0_CSG0_CC_COFC_Msk               (0x03UL << HRPWM0_CSG0_CC_COFC_Pos)                     /*!< HRPWM0_CSG0 CC: COFC Mask               */

/* -------------------------------  HRPWM0_CSG0_PLC  ------------------------------ */
#define HRPWM0_CSG0_PLC_IPLS_Pos              0                                                       /*!< HRPWM0_CSG0 PLC: IPLS Position          */
#define HRPWM0_CSG0_PLC_IPLS_Msk              (0x0fUL << HRPWM0_CSG0_PLC_IPLS_Pos)                    /*!< HRPWM0_CSG0 PLC: IPLS Mask              */
#define HRPWM0_CSG0_PLC_PLCL_Pos              8                                                       /*!< HRPWM0_CSG0 PLC: PLCL Position          */
#define HRPWM0_CSG0_PLC_PLCL_Msk              (0x03UL << HRPWM0_CSG0_PLC_PLCL_Pos)                    /*!< HRPWM0_CSG0 PLC: PLCL Mask              */
#define HRPWM0_CSG0_PLC_PSL_Pos               10                                                      /*!< HRPWM0_CSG0 PLC: PSL Position           */
#define HRPWM0_CSG0_PLC_PSL_Msk               (0x01UL << HRPWM0_CSG0_PLC_PSL_Pos)                     /*!< HRPWM0_CSG0 PLC: PSL Mask               */
#define HRPWM0_CSG0_PLC_PLSW_Pos              11                                                      /*!< HRPWM0_CSG0 PLC: PLSW Position          */
#define HRPWM0_CSG0_PLC_PLSW_Msk              (0x01UL << HRPWM0_CSG0_PLC_PLSW_Pos)                    /*!< HRPWM0_CSG0 PLC: PLSW Mask              */
#define HRPWM0_CSG0_PLC_PLEC_Pos              12                                                      /*!< HRPWM0_CSG0 PLC: PLEC Position          */
#define HRPWM0_CSG0_PLC_PLEC_Msk              (0x03UL << HRPWM0_CSG0_PLC_PLEC_Pos)                    /*!< HRPWM0_CSG0 PLC: PLEC Mask              */
#define HRPWM0_CSG0_PLC_PLXC_Pos              14                                                      /*!< HRPWM0_CSG0 PLC: PLXC Position          */
#define HRPWM0_CSG0_PLC_PLXC_Msk              (0x03UL << HRPWM0_CSG0_PLC_PLXC_Pos)                    /*!< HRPWM0_CSG0 PLC: PLXC Mask              */

