FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4400.h
/* -------------------------------  HRPWM0_CSG0_BLV  ------------------------------ */
#define HRPWM0_CSG0_BLV_BLV_Pos               0                                                       /*!< HRPWM0_CSG0 BLV: BLV Position           */
#define HRPWM0_CSG0_BLV_BLV_Msk               (0x000000ffUL << HRPWM0_CSG0_BLV_BLV_Pos)               /*!< HRPWM0_CSG0 BLV: BLV Mask               */

/* -------------------------------  HRPWM0_CSG0_SRE  ------------------------------ */
#define HRPWM0_CSG0_SRE_VLS1E_Pos             0                                                       /*!< HRPWM0_CSG0 SRE: VLS1E Position         */
#define HRPWM0_CSG0_SRE_VLS1E_Msk             (0x01UL << HRPWM0_CSG0_SRE_VLS1E_Pos)                   /*!< HRPWM0_CSG0 SRE: VLS1E Mask             */
#define HRPWM0_CSG0_SRE_VLS2E_Pos             1                                                       /*!< HRPWM0_CSG0 SRE: VLS2E Position         */
#define HRPWM0_CSG0_SRE_VLS2E_Msk             (0x01UL << HRPWM0_CSG0_SRE_VLS2E_Pos)                   /*!< HRPWM0_CSG0 SRE: VLS2E Mask             */
#define HRPWM0_CSG0_SRE_TRGSE_Pos             2                                                       /*!< HRPWM0_CSG0 SRE: TRGSE Position         */
#define HRPWM0_CSG0_SRE_TRGSE_Msk             (0x01UL << HRPWM0_CSG0_SRE_TRGSE_Pos)                   /*!< HRPWM0_CSG0 SRE: TRGSE Mask             */
#define HRPWM0_CSG0_SRE_STRSE_Pos             3                                                       /*!< HRPWM0_CSG0 SRE: STRSE Position         */
#define HRPWM0_CSG0_SRE_STRSE_Msk             (0x01UL << HRPWM0_CSG0_SRE_STRSE_Pos)                   /*!< HRPWM0_CSG0 SRE: STRSE Mask             */
#define HRPWM0_CSG0_SRE_STPSE_Pos             4                                                       /*!< HRPWM0_CSG0 SRE: STPSE Position         */
#define HRPWM0_CSG0_SRE_STPSE_Msk             (0x01UL << HRPWM0_CSG0_SRE_STPSE_Pos)                   /*!< HRPWM0_CSG0 SRE: STPSE Mask             */
#define HRPWM0_CSG0_SRE_STDE_Pos              5                                                       /*!< HRPWM0_CSG0 SRE: STDE Position          */
#define HRPWM0_CSG0_SRE_STDE_Msk              (0x01UL << HRPWM0_CSG0_SRE_STDE_Pos)                    /*!< HRPWM0_CSG0 SRE: STDE Mask              */
#define HRPWM0_CSG0_SRE_CRSE_Pos              6                                                       /*!< HRPWM0_CSG0 SRE: CRSE Position          */
#define HRPWM0_CSG0_SRE_CRSE_Msk              (0x01UL << HRPWM0_CSG0_SRE_CRSE_Pos)                    /*!< HRPWM0_CSG0 SRE: CRSE Mask              */
#define HRPWM0_CSG0_SRE_CFSE_Pos              7                                                       /*!< HRPWM0_CSG0 SRE: CFSE Position          */
#define HRPWM0_CSG0_SRE_CFSE_Msk              (0x01UL << HRPWM0_CSG0_SRE_CFSE_Pos)                    /*!< HRPWM0_CSG0 SRE: CFSE Mask              */
#define HRPWM0_CSG0_SRE_CSEE_Pos              8                                                       /*!< HRPWM0_CSG0 SRE: CSEE Position          */
#define HRPWM0_CSG0_SRE_CSEE_Msk              (0x01UL << HRPWM0_CSG0_SRE_CSEE_Pos)                    /*!< HRPWM0_CSG0 SRE: CSEE Mask              */

/* -------------------------------  HRPWM0_CSG0_SRS  ------------------------------ */
#define HRPWM0_CSG0_SRS_VLS1S_Pos             0                                                       /*!< HRPWM0_CSG0 SRS: VLS1S Position         */
#define HRPWM0_CSG0_SRS_VLS1S_Msk             (0x03UL << HRPWM0_CSG0_SRS_VLS1S_Pos)                   /*!< HRPWM0_CSG0 SRS: VLS1S Mask             */
#define HRPWM0_CSG0_SRS_VLS2S_Pos             2                                                       /*!< HRPWM0_CSG0 SRS: VLS2S Position         */
#define HRPWM0_CSG0_SRS_VLS2S_Msk             (0x03UL << HRPWM0_CSG0_SRS_VLS2S_Pos)                   /*!< HRPWM0_CSG0 SRS: VLS2S Mask             */
#define HRPWM0_CSG0_SRS_TRLS_Pos              4                                                       /*!< HRPWM0_CSG0 SRS: TRLS Position          */
#define HRPWM0_CSG0_SRS_TRLS_Msk              (0x03UL << HRPWM0_CSG0_SRS_TRLS_Pos)                    /*!< HRPWM0_CSG0 SRS: TRLS Mask              */
#define HRPWM0_CSG0_SRS_SSLS_Pos              6                                                       /*!< HRPWM0_CSG0 SRS: SSLS Position          */
#define HRPWM0_CSG0_SRS_SSLS_Msk              (0x03UL << HRPWM0_CSG0_SRS_SSLS_Pos)                    /*!< HRPWM0_CSG0 SRS: SSLS Mask              */
#define HRPWM0_CSG0_SRS_STLS_Pos              8                                                       /*!< HRPWM0_CSG0 SRS: STLS Position          */
#define HRPWM0_CSG0_SRS_STLS_Msk              (0x03UL << HRPWM0_CSG0_SRS_STLS_Pos)                    /*!< HRPWM0_CSG0 SRS: STLS Mask              */
#define HRPWM0_CSG0_SRS_CRFLS_Pos             10                                                      /*!< HRPWM0_CSG0 SRS: CRFLS Position         */
#define HRPWM0_CSG0_SRS_CRFLS_Msk             (0x03UL << HRPWM0_CSG0_SRS_CRFLS_Pos)                   /*!< HRPWM0_CSG0 SRS: CRFLS Mask             */
#define HRPWM0_CSG0_SRS_CSLS_Pos              12                                                      /*!< HRPWM0_CSG0 SRS: CSLS Position          */
#define HRPWM0_CSG0_SRS_CSLS_Msk              (0x03UL << HRPWM0_CSG0_SRS_CSLS_Pos)                    /*!< HRPWM0_CSG0 SRS: CSLS Mask              */

/* -------------------------------  HRPWM0_CSG0_SWS  ------------------------------ */
#define HRPWM0_CSG0_SWS_SVLS1_Pos             0                                                       /*!< HRPWM0_CSG0 SWS: SVLS1 Position         */
#define HRPWM0_CSG0_SWS_SVLS1_Msk             (0x01UL << HRPWM0_CSG0_SWS_SVLS1_Pos)                   /*!< HRPWM0_CSG0 SWS: SVLS1 Mask             */
#define HRPWM0_CSG0_SWS_SVLS2_Pos             1                                                       /*!< HRPWM0_CSG0 SWS: SVLS2 Position         */
#define HRPWM0_CSG0_SWS_SVLS2_Msk             (0x01UL << HRPWM0_CSG0_SWS_SVLS2_Pos)                   /*!< HRPWM0_CSG0 SWS: SVLS2 Mask             */
#define HRPWM0_CSG0_SWS_STRGS_Pos             2                                                       /*!< HRPWM0_CSG0 SWS: STRGS Position         */
#define HRPWM0_CSG0_SWS_STRGS_Msk             (0x01UL << HRPWM0_CSG0_SWS_STRGS_Pos)                   /*!< HRPWM0_CSG0 SWS: STRGS Mask             */
#define HRPWM0_CSG0_SWS_SSTRS_Pos             3                                                       /*!< HRPWM0_CSG0 SWS: SSTRS Position         */
#define HRPWM0_CSG0_SWS_SSTRS_Msk             (0x01UL << HRPWM0_CSG0_SWS_SSTRS_Pos)                   /*!< HRPWM0_CSG0 SWS: SSTRS Mask             */
#define HRPWM0_CSG0_SWS_SSTPS_Pos             4                                                       /*!< HRPWM0_CSG0 SWS: SSTPS Position         */
#define HRPWM0_CSG0_SWS_SSTPS_Msk             (0x01UL << HRPWM0_CSG0_SWS_SSTPS_Pos)                   /*!< HRPWM0_CSG0 SWS: SSTPS Mask             */
#define HRPWM0_CSG0_SWS_SSTD_Pos              5                                                       /*!< HRPWM0_CSG0 SWS: SSTD Position          */
#define HRPWM0_CSG0_SWS_SSTD_Msk              (0x01UL << HRPWM0_CSG0_SWS_SSTD_Pos)                    /*!< HRPWM0_CSG0 SWS: SSTD Mask              */
#define HRPWM0_CSG0_SWS_SCRS_Pos              6                                                       /*!< HRPWM0_CSG0 SWS: SCRS Position          */
#define HRPWM0_CSG0_SWS_SCRS_Msk              (0x01UL << HRPWM0_CSG0_SWS_SCRS_Pos)                    /*!< HRPWM0_CSG0 SWS: SCRS Mask              */
#define HRPWM0_CSG0_SWS_SCFS_Pos              7                                                       /*!< HRPWM0_CSG0 SWS: SCFS Position          */
#define HRPWM0_CSG0_SWS_SCFS_Msk              (0x01UL << HRPWM0_CSG0_SWS_SCFS_Pos)                    /*!< HRPWM0_CSG0 SWS: SCFS Mask              */
#define HRPWM0_CSG0_SWS_SCSS_Pos              8                                                       /*!< HRPWM0_CSG0 SWS: SCSS Position          */
#define HRPWM0_CSG0_SWS_SCSS_Msk              (0x01UL << HRPWM0_CSG0_SWS_SCSS_Pos)                    /*!< HRPWM0_CSG0 SWS: SCSS Mask              */

/* -------------------------------  HRPWM0_CSG0_SWC  ------------------------------ */
#define HRPWM0_CSG0_SWC_CVLS1_Pos             0                                                       /*!< HRPWM0_CSG0 SWC: CVLS1 Position         */
#define HRPWM0_CSG0_SWC_CVLS1_Msk             (0x01UL << HRPWM0_CSG0_SWC_CVLS1_Pos)                   /*!< HRPWM0_CSG0 SWC: CVLS1 Mask             */
#define HRPWM0_CSG0_SWC_CVLS2_Pos             1                                                       /*!< HRPWM0_CSG0 SWC: CVLS2 Position         */
#define HRPWM0_CSG0_SWC_CVLS2_Msk             (0x01UL << HRPWM0_CSG0_SWC_CVLS2_Pos)                   /*!< HRPWM0_CSG0 SWC: CVLS2 Mask             */
#define HRPWM0_CSG0_SWC_CTRGS_Pos             2                                                       /*!< HRPWM0_CSG0 SWC: CTRGS Position         */
#define HRPWM0_CSG0_SWC_CTRGS_Msk             (0x01UL << HRPWM0_CSG0_SWC_CTRGS_Pos)                   /*!< HRPWM0_CSG0 SWC: CTRGS Mask             */
#define HRPWM0_CSG0_SWC_CSTRS_Pos             3                                                       /*!< HRPWM0_CSG0 SWC: CSTRS Position         */
#define HRPWM0_CSG0_SWC_CSTRS_Msk             (0x01UL << HRPWM0_CSG0_SWC_CSTRS_Pos)                   /*!< HRPWM0_CSG0 SWC: CSTRS Mask             */
#define HRPWM0_CSG0_SWC_CSTPS_Pos             4                                                       /*!< HRPWM0_CSG0 SWC: CSTPS Position         */
#define HRPWM0_CSG0_SWC_CSTPS_Msk             (0x01UL << HRPWM0_CSG0_SWC_CSTPS_Pos)                   /*!< HRPWM0_CSG0 SWC: CSTPS Mask             */
#define HRPWM0_CSG0_SWC_CSTD_Pos              5                                                       /*!< HRPWM0_CSG0 SWC: CSTD Position          */
#define HRPWM0_CSG0_SWC_CSTD_Msk              (0x01UL << HRPWM0_CSG0_SWC_CSTD_Pos)                    /*!< HRPWM0_CSG0 SWC: CSTD Mask              */
#define HRPWM0_CSG0_SWC_CCRS_Pos              6                                                       /*!< HRPWM0_CSG0 SWC: CCRS Position          */
#define HRPWM0_CSG0_SWC_CCRS_Msk              (0x01UL << HRPWM0_CSG0_SWC_CCRS_Pos)                    /*!< HRPWM0_CSG0 SWC: CCRS Mask              */
#define HRPWM0_CSG0_SWC_CCFS_Pos              7                                                       /*!< HRPWM0_CSG0 SWC: CCFS Position          */
#define HRPWM0_CSG0_SWC_CCFS_Msk              (0x01UL << HRPWM0_CSG0_SWC_CCFS_Pos)                    /*!< HRPWM0_CSG0 SWC: CCFS Mask              */
#define HRPWM0_CSG0_SWC_CCSS_Pos              8                                                       /*!< HRPWM0_CSG0 SWC: CCSS Position          */
#define HRPWM0_CSG0_SWC_CCSS_Msk              (0x01UL << HRPWM0_CSG0_SWC_CCSS_Pos)                    /*!< HRPWM0_CSG0 SWC: CCSS Mask              */

/* ------------------------------  HRPWM0_CSG0_ISTAT  ----------------------------- */
#define HRPWM0_CSG0_ISTAT_VLS1S_Pos           0                                                       /*!< HRPWM0_CSG0 ISTAT: VLS1S Position       */
#define HRPWM0_CSG0_ISTAT_VLS1S_Msk           (0x01UL << HRPWM0_CSG0_ISTAT_VLS1S_Pos)                 /*!< HRPWM0_CSG0 ISTAT: VLS1S Mask           */
#define HRPWM0_CSG0_ISTAT_VLS2S_Pos           1                                                       /*!< HRPWM0_CSG0 ISTAT: VLS2S Position       */
#define HRPWM0_CSG0_ISTAT_VLS2S_Msk           (0x01UL << HRPWM0_CSG0_ISTAT_VLS2S_Pos)                 /*!< HRPWM0_CSG0 ISTAT: VLS2S Mask           */
#define HRPWM0_CSG0_ISTAT_TRGSS_Pos           2                                                       /*!< HRPWM0_CSG0 ISTAT: TRGSS Position       */
#define HRPWM0_CSG0_ISTAT_TRGSS_Msk           (0x01UL << HRPWM0_CSG0_ISTAT_TRGSS_Pos)                 /*!< HRPWM0_CSG0 ISTAT: TRGSS Mask           */
#define HRPWM0_CSG0_ISTAT_STRSS_Pos           3                                                       /*!< HRPWM0_CSG0 ISTAT: STRSS Position       */
#define HRPWM0_CSG0_ISTAT_STRSS_Msk           (0x01UL << HRPWM0_CSG0_ISTAT_STRSS_Pos)                 /*!< HRPWM0_CSG0 ISTAT: STRSS Mask           */
#define HRPWM0_CSG0_ISTAT_STPSS_Pos           4                                                       /*!< HRPWM0_CSG0 ISTAT: STPSS Position       */
#define HRPWM0_CSG0_ISTAT_STPSS_Msk           (0x01UL << HRPWM0_CSG0_ISTAT_STPSS_Pos)                 /*!< HRPWM0_CSG0 ISTAT: STPSS Mask           */
#define HRPWM0_CSG0_ISTAT_STDS_Pos            5                                                       /*!< HRPWM0_CSG0 ISTAT: STDS Position        */
#define HRPWM0_CSG0_ISTAT_STDS_Msk            (0x01UL << HRPWM0_CSG0_ISTAT_STDS_Pos)                  /*!< HRPWM0_CSG0 ISTAT: STDS Mask            */
#define HRPWM0_CSG0_ISTAT_CRSS_Pos            6                                                       /*!< HRPWM0_CSG0 ISTAT: CRSS Position        */
#define HRPWM0_CSG0_ISTAT_CRSS_Msk            (0x01UL << HRPWM0_CSG0_ISTAT_CRSS_Pos)                  /*!< HRPWM0_CSG0 ISTAT: CRSS Mask            */
#define HRPWM0_CSG0_ISTAT_CFSS_Pos            7                                                       /*!< HRPWM0_CSG0 ISTAT: CFSS Position        */
#define HRPWM0_CSG0_ISTAT_CFSS_Msk            (0x01UL << HRPWM0_CSG0_ISTAT_CFSS_Pos)                  /*!< HRPWM0_CSG0 ISTAT: CFSS Mask            */
#define HRPWM0_CSG0_ISTAT_CSES_Pos            8                                                       /*!< HRPWM0_CSG0 ISTAT: CSES Position        */
#define HRPWM0_CSG0_ISTAT_CSES_Msk            (0x01UL << HRPWM0_CSG0_ISTAT_CSES_Pos)                  /*!< HRPWM0_CSG0 ISTAT: CSES Mask            */


/* ================================================================================ */
/* ================      struct 'HRPWM0_CSG1' Position & Mask      ================ */
/* ================================================================================ */


/* -------------------------------  HRPWM0_CSG1_DCI  ------------------------------ */
#define HRPWM0_CSG1_DCI_SVIS_Pos              0                                                       /*!< HRPWM0_CSG1 DCI: SVIS Position          */
#define HRPWM0_CSG1_DCI_SVIS_Msk              (0x0fUL << HRPWM0_CSG1_DCI_SVIS_Pos)                    /*!< HRPWM0_CSG1 DCI: SVIS Mask              */
#define HRPWM0_CSG1_DCI_STRIS_Pos             4                                                       /*!< HRPWM0_CSG1 DCI: STRIS Position         */
#define HRPWM0_CSG1_DCI_STRIS_Msk             (0x0fUL << HRPWM0_CSG1_DCI_STRIS_Pos)                   /*!< HRPWM0_CSG1 DCI: STRIS Mask             */
#define HRPWM0_CSG1_DCI_STPIS_Pos             8                                                       /*!< HRPWM0_CSG1 DCI: STPIS Position         */
#define HRPWM0_CSG1_DCI_STPIS_Msk             (0x0fUL << HRPWM0_CSG1_DCI_STPIS_Pos)                   /*!< HRPWM0_CSG1 DCI: STPIS Mask             */
#define HRPWM0_CSG1_DCI_TRGIS_Pos             12                                                      /*!< HRPWM0_CSG1 DCI: TRGIS Position         */
#define HRPWM0_CSG1_DCI_TRGIS_Msk             (0x0fUL << HRPWM0_CSG1_DCI_TRGIS_Pos)                   /*!< HRPWM0_CSG1 DCI: TRGIS Mask             */
#define HRPWM0_CSG1_DCI_STIS_Pos              16                                                      /*!< HRPWM0_CSG1 DCI: STIS Position          */
#define HRPWM0_CSG1_DCI_STIS_Msk              (0x0fUL << HRPWM0_CSG1_DCI_STIS_Pos)                    /*!< HRPWM0_CSG1 DCI: STIS Mask              */
#define HRPWM0_CSG1_DCI_SCS_Pos               20                                                      /*!< HRPWM0_CSG1 DCI: SCS Position           */
#define HRPWM0_CSG1_DCI_SCS_Msk               (0x03UL << HRPWM0_CSG1_DCI_SCS_Pos)                     /*!< HRPWM0_CSG1 DCI: SCS Mask               */

/* -------------------------------  HRPWM0_CSG1_IES  ------------------------------ */
#define HRPWM0_CSG1_IES_SVLS_Pos              0                                                       /*!< HRPWM0_CSG1 IES: SVLS Position          */
#define HRPWM0_CSG1_IES_SVLS_Msk              (0x03UL << HRPWM0_CSG1_IES_SVLS_Pos)                    /*!< HRPWM0_CSG1 IES: SVLS Mask              */
#define HRPWM0_CSG1_IES_STRES_Pos             2                                                       /*!< HRPWM0_CSG1 IES: STRES Position         */
#define HRPWM0_CSG1_IES_STRES_Msk             (0x03UL << HRPWM0_CSG1_IES_STRES_Pos)                   /*!< HRPWM0_CSG1 IES: STRES Mask             */
#define HRPWM0_CSG1_IES_STPES_Pos             4                                                       /*!< HRPWM0_CSG1 IES: STPES Position         */
#define HRPWM0_CSG1_IES_STPES_Msk             (0x03UL << HRPWM0_CSG1_IES_STPES_Pos)                   /*!< HRPWM0_CSG1 IES: STPES Mask             */
#define HRPWM0_CSG1_IES_TRGES_Pos             6                                                       /*!< HRPWM0_CSG1 IES: TRGES Position         */
#define HRPWM0_CSG1_IES_TRGES_Msk             (0x03UL << HRPWM0_CSG1_IES_TRGES_Pos)                   /*!< HRPWM0_CSG1 IES: TRGES Mask             */
#define HRPWM0_CSG1_IES_STES_Pos              8                                                       /*!< HRPWM0_CSG1 IES: STES Position          */
#define HRPWM0_CSG1_IES_STES_Msk              (0x03UL << HRPWM0_CSG1_IES_STES_Pos)                    /*!< HRPWM0_CSG1 IES: STES Mask              */

/* -------------------------------  HRPWM0_CSG1_SC  ------------------------------- */
#define HRPWM0_CSG1_SC_PSRM_Pos               0                                                       /*!< HRPWM0_CSG1 SC: PSRM Position           */
#define HRPWM0_CSG1_SC_PSRM_Msk               (0x03UL << HRPWM0_CSG1_SC_PSRM_Pos)                     /*!< HRPWM0_CSG1 SC: PSRM Mask               */
#define HRPWM0_CSG1_SC_PSTM_Pos               2                                                       /*!< HRPWM0_CSG1 SC: PSTM Position           */
#define HRPWM0_CSG1_SC_PSTM_Msk               (0x03UL << HRPWM0_CSG1_SC_PSTM_Pos)                     /*!< HRPWM0_CSG1 SC: PSTM Mask               */
#define HRPWM0_CSG1_SC_FPD_Pos                4                                                       /*!< HRPWM0_CSG1 SC: FPD Position            */
#define HRPWM0_CSG1_SC_FPD_Msk                (0x01UL << HRPWM0_CSG1_SC_FPD_Pos)                      /*!< HRPWM0_CSG1 SC: FPD Mask                */
#define HRPWM0_CSG1_SC_PSV_Pos                5                                                       /*!< HRPWM0_CSG1 SC: PSV Position            */
#define HRPWM0_CSG1_SC_PSV_Msk                (0x03UL << HRPWM0_CSG1_SC_PSV_Pos)                      /*!< HRPWM0_CSG1 SC: PSV Mask                */
#define HRPWM0_CSG1_SC_SCM_Pos                8                                                       /*!< HRPWM0_CSG1 SC: SCM Position            */
#define HRPWM0_CSG1_SC_SCM_Msk                (0x03UL << HRPWM0_CSG1_SC_SCM_Pos)                      /*!< HRPWM0_CSG1 SC: SCM Mask                */
#define HRPWM0_CSG1_SC_SSRM_Pos               10                                                      /*!< HRPWM0_CSG1 SC: SSRM Position           */
#define HRPWM0_CSG1_SC_SSRM_Msk               (0x03UL << HRPWM0_CSG1_SC_SSRM_Pos)                     /*!< HRPWM0_CSG1 SC: SSRM Mask               */
#define HRPWM0_CSG1_SC_SSTM_Pos               12                                                      /*!< HRPWM0_CSG1 SC: SSTM Position           */
#define HRPWM0_CSG1_SC_SSTM_Msk               (0x03UL << HRPWM0_CSG1_SC_SSTM_Pos)                     /*!< HRPWM0_CSG1 SC: SSTM Mask               */
#define HRPWM0_CSG1_SC_SVSC_Pos               14                                                      /*!< HRPWM0_CSG1 SC: SVSC Position           */
#define HRPWM0_CSG1_SC_SVSC_Msk               (0x03UL << HRPWM0_CSG1_SC_SVSC_Pos)                     /*!< HRPWM0_CSG1 SC: SVSC Mask               */
#define HRPWM0_CSG1_SC_SWSM_Pos               16                                                      /*!< HRPWM0_CSG1 SC: SWSM Position           */
#define HRPWM0_CSG1_SC_SWSM_Msk               (0x03UL << HRPWM0_CSG1_SC_SWSM_Pos)                     /*!< HRPWM0_CSG1 SC: SWSM Mask               */
#define HRPWM0_CSG1_SC_GCFG_Pos               18                                                      /*!< HRPWM0_CSG1 SC: GCFG Position           */
#define HRPWM0_CSG1_SC_GCFG_Msk               (0x03UL << HRPWM0_CSG1_SC_GCFG_Pos)                     /*!< HRPWM0_CSG1 SC: GCFG Mask               */
#define HRPWM0_CSG1_SC_IST_Pos                20                                                      /*!< HRPWM0_CSG1 SC: IST Position            */
#define HRPWM0_CSG1_SC_IST_Msk                (0x01UL << HRPWM0_CSG1_SC_IST_Pos)                      /*!< HRPWM0_CSG1 SC: IST Mask                */
#define HRPWM0_CSG1_SC_PSE_Pos                21                                                      /*!< HRPWM0_CSG1 SC: PSE Position            */
#define HRPWM0_CSG1_SC_PSE_Msk                (0x01UL << HRPWM0_CSG1_SC_PSE_Pos)                      /*!< HRPWM0_CSG1 SC: PSE Mask                */
#define HRPWM0_CSG1_SC_PSWM_Pos               24                                                      /*!< HRPWM0_CSG1 SC: PSWM Position           */
#define HRPWM0_CSG1_SC_PSWM_Msk               (0x03UL << HRPWM0_CSG1_SC_PSWM_Pos)                     /*!< HRPWM0_CSG1 SC: PSWM Mask               */

/* -------------------------------  HRPWM0_CSG1_PC  ------------------------------- */
#define HRPWM0_CSG1_PC_PSWV_Pos               0                                                       /*!< HRPWM0_CSG1 PC: PSWV Position           */
#define HRPWM0_CSG1_PC_PSWV_Msk               (0x3fUL << HRPWM0_CSG1_PC_PSWV_Pos)                     /*!< HRPWM0_CSG1 PC: PSWV Mask               */

/* ------------------------------  HRPWM0_CSG1_DSV1  ------------------------------ */
#define HRPWM0_CSG1_DSV1_DSV1_Pos             0                                                       /*!< HRPWM0_CSG1 DSV1: DSV1 Position         */
#define HRPWM0_CSG1_DSV1_DSV1_Msk             (0x000003ffUL << HRPWM0_CSG1_DSV1_DSV1_Pos)             /*!< HRPWM0_CSG1 DSV1: DSV1 Mask             */

/* ------------------------------  HRPWM0_CSG1_DSV2  ------------------------------ */
#define HRPWM0_CSG1_DSV2_DSV2_Pos             0                                                       /*!< HRPWM0_CSG1 DSV2: DSV2 Position         */
#define HRPWM0_CSG1_DSV2_DSV2_Msk             (0x000003ffUL << HRPWM0_CSG1_DSV2_DSV2_Pos)             /*!< HRPWM0_CSG1 DSV2: DSV2 Mask             */

/* ------------------------------  HRPWM0_CSG1_SDSV1  ----------------------------- */
#define HRPWM0_CSG1_SDSV1_SDSV1_Pos           0                                                       /*!< HRPWM0_CSG1 SDSV1: SDSV1 Position       */
#define HRPWM0_CSG1_SDSV1_SDSV1_Msk           (0x000003ffUL << HRPWM0_CSG1_SDSV1_SDSV1_Pos)           /*!< HRPWM0_CSG1 SDSV1: SDSV1 Mask           */

/* -------------------------------  HRPWM0_CSG1_SPC  ------------------------------ */
#define HRPWM0_CSG1_SPC_SPSWV_Pos             0                                                       /*!< HRPWM0_CSG1 SPC: SPSWV Position         */
#define HRPWM0_CSG1_SPC_SPSWV_Msk             (0x3fUL << HRPWM0_CSG1_SPC_SPSWV_Pos)                   /*!< HRPWM0_CSG1 SPC: SPSWV Mask             */

