FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4400.h
/* -------------------------------  HRPWM0_CSG1_CC  ------------------------------- */
#define HRPWM0_CSG1_CC_IBS_Pos                0                                                       /*!< HRPWM0_CSG1 CC: IBS Position            */
#define HRPWM0_CSG1_CC_IBS_Msk                (0x0fUL << HRPWM0_CSG1_CC_IBS_Pos)                      /*!< HRPWM0_CSG1 CC: IBS Mask                */
#define HRPWM0_CSG1_CC_IMCS_Pos               8                                                       /*!< HRPWM0_CSG1 CC: IMCS Position           */
#define HRPWM0_CSG1_CC_IMCS_Msk               (0x01UL << HRPWM0_CSG1_CC_IMCS_Pos)                     /*!< HRPWM0_CSG1 CC: IMCS Mask               */
#define HRPWM0_CSG1_CC_IMCC_Pos               9                                                       /*!< HRPWM0_CSG1 CC: IMCC Position           */
#define HRPWM0_CSG1_CC_IMCC_Msk               (0x03UL << HRPWM0_CSG1_CC_IMCC_Pos)                     /*!< HRPWM0_CSG1 CC: IMCC Mask               */
#define HRPWM0_CSG1_CC_ESE_Pos                11                                                      /*!< HRPWM0_CSG1 CC: ESE Position            */
#define HRPWM0_CSG1_CC_ESE_Msk                (0x01UL << HRPWM0_CSG1_CC_ESE_Pos)                      /*!< HRPWM0_CSG1 CC: ESE Mask                */
#define HRPWM0_CSG1_CC_OIE_Pos                12                                                      /*!< HRPWM0_CSG1 CC: OIE Position            */
#define HRPWM0_CSG1_CC_OIE_Msk                (0x01UL << HRPWM0_CSG1_CC_OIE_Pos)                      /*!< HRPWM0_CSG1 CC: OIE Mask                */
#define HRPWM0_CSG1_CC_OSE_Pos                13                                                      /*!< HRPWM0_CSG1 CC: OSE Position            */
#define HRPWM0_CSG1_CC_OSE_Msk                (0x01UL << HRPWM0_CSG1_CC_OSE_Pos)                      /*!< HRPWM0_CSG1 CC: OSE Mask                */
#define HRPWM0_CSG1_CC_BLMC_Pos               14                                                      /*!< HRPWM0_CSG1 CC: BLMC Position           */
#define HRPWM0_CSG1_CC_BLMC_Msk               (0x03UL << HRPWM0_CSG1_CC_BLMC_Pos)                     /*!< HRPWM0_CSG1 CC: BLMC Mask               */
#define HRPWM0_CSG1_CC_EBE_Pos                16                                                      /*!< HRPWM0_CSG1 CC: EBE Position            */
#define HRPWM0_CSG1_CC_EBE_Msk                (0x01UL << HRPWM0_CSG1_CC_EBE_Pos)                      /*!< HRPWM0_CSG1 CC: EBE Mask                */
#define HRPWM0_CSG1_CC_COFE_Pos               17                                                      /*!< HRPWM0_CSG1 CC: COFE Position           */
#define HRPWM0_CSG1_CC_COFE_Msk               (0x01UL << HRPWM0_CSG1_CC_COFE_Pos)                     /*!< HRPWM0_CSG1 CC: COFE Mask               */
#define HRPWM0_CSG1_CC_COFM_Pos               18                                                      /*!< HRPWM0_CSG1 CC: COFM Position           */
#define HRPWM0_CSG1_CC_COFM_Msk               (0x0fUL << HRPWM0_CSG1_CC_COFM_Pos)                     /*!< HRPWM0_CSG1 CC: COFM Mask               */
#define HRPWM0_CSG1_CC_COFC_Pos               24                                                      /*!< HRPWM0_CSG1 CC: COFC Position           */
#define HRPWM0_CSG1_CC_COFC_Msk               (0x03UL << HRPWM0_CSG1_CC_COFC_Pos)                     /*!< HRPWM0_CSG1 CC: COFC Mask               */

/* -------------------------------  HRPWM0_CSG1_PLC  ------------------------------ */
#define HRPWM0_CSG1_PLC_IPLS_Pos              0                                                       /*!< HRPWM0_CSG1 PLC: IPLS Position          */
#define HRPWM0_CSG1_PLC_IPLS_Msk              (0x0fUL << HRPWM0_CSG1_PLC_IPLS_Pos)                    /*!< HRPWM0_CSG1 PLC: IPLS Mask              */
#define HRPWM0_CSG1_PLC_PLCL_Pos              8                                                       /*!< HRPWM0_CSG1 PLC: PLCL Position          */
#define HRPWM0_CSG1_PLC_PLCL_Msk              (0x03UL << HRPWM0_CSG1_PLC_PLCL_Pos)                    /*!< HRPWM0_CSG1 PLC: PLCL Mask              */
#define HRPWM0_CSG1_PLC_PSL_Pos               10                                                      /*!< HRPWM0_CSG1 PLC: PSL Position           */
#define HRPWM0_CSG1_PLC_PSL_Msk               (0x01UL << HRPWM0_CSG1_PLC_PSL_Pos)                     /*!< HRPWM0_CSG1 PLC: PSL Mask               */
#define HRPWM0_CSG1_PLC_PLSW_Pos              11                                                      /*!< HRPWM0_CSG1 PLC: PLSW Position          */
#define HRPWM0_CSG1_PLC_PLSW_Msk              (0x01UL << HRPWM0_CSG1_PLC_PLSW_Pos)                    /*!< HRPWM0_CSG1 PLC: PLSW Mask              */
#define HRPWM0_CSG1_PLC_PLEC_Pos              12                                                      /*!< HRPWM0_CSG1 PLC: PLEC Position          */
#define HRPWM0_CSG1_PLC_PLEC_Msk              (0x03UL << HRPWM0_CSG1_PLC_PLEC_Pos)                    /*!< HRPWM0_CSG1 PLC: PLEC Mask              */
#define HRPWM0_CSG1_PLC_PLXC_Pos              14                                                      /*!< HRPWM0_CSG1 PLC: PLXC Position          */
#define HRPWM0_CSG1_PLC_PLXC_Msk              (0x03UL << HRPWM0_CSG1_PLC_PLXC_Pos)                    /*!< HRPWM0_CSG1 PLC: PLXC Mask              */

/* -------------------------------  HRPWM0_CSG1_BLV  ------------------------------ */
#define HRPWM0_CSG1_BLV_BLV_Pos               0                                                       /*!< HRPWM0_CSG1 BLV: BLV Position           */
#define HRPWM0_CSG1_BLV_BLV_Msk               (0x000000ffUL << HRPWM0_CSG1_BLV_BLV_Pos)               /*!< HRPWM0_CSG1 BLV: BLV Mask               */

/* -------------------------------  HRPWM0_CSG1_SRE  ------------------------------ */
#define HRPWM0_CSG1_SRE_VLS1E_Pos             0                                                       /*!< HRPWM0_CSG1 SRE: VLS1E Position         */
#define HRPWM0_CSG1_SRE_VLS1E_Msk             (0x01UL << HRPWM0_CSG1_SRE_VLS1E_Pos)                   /*!< HRPWM0_CSG1 SRE: VLS1E Mask             */
#define HRPWM0_CSG1_SRE_VLS2E_Pos             1                                                       /*!< HRPWM0_CSG1 SRE: VLS2E Position         */
#define HRPWM0_CSG1_SRE_VLS2E_Msk             (0x01UL << HRPWM0_CSG1_SRE_VLS2E_Pos)                   /*!< HRPWM0_CSG1 SRE: VLS2E Mask             */
#define HRPWM0_CSG1_SRE_TRGSE_Pos             2                                                       /*!< HRPWM0_CSG1 SRE: TRGSE Position         */
#define HRPWM0_CSG1_SRE_TRGSE_Msk             (0x01UL << HRPWM0_CSG1_SRE_TRGSE_Pos)                   /*!< HRPWM0_CSG1 SRE: TRGSE Mask             */
#define HRPWM0_CSG1_SRE_STRSE_Pos             3                                                       /*!< HRPWM0_CSG1 SRE: STRSE Position         */
#define HRPWM0_CSG1_SRE_STRSE_Msk             (0x01UL << HRPWM0_CSG1_SRE_STRSE_Pos)                   /*!< HRPWM0_CSG1 SRE: STRSE Mask             */
#define HRPWM0_CSG1_SRE_STPSE_Pos             4                                                       /*!< HRPWM0_CSG1 SRE: STPSE Position         */
#define HRPWM0_CSG1_SRE_STPSE_Msk             (0x01UL << HRPWM0_CSG1_SRE_STPSE_Pos)                   /*!< HRPWM0_CSG1 SRE: STPSE Mask             */
#define HRPWM0_CSG1_SRE_STDE_Pos              5                                                       /*!< HRPWM0_CSG1 SRE: STDE Position          */
#define HRPWM0_CSG1_SRE_STDE_Msk              (0x01UL << HRPWM0_CSG1_SRE_STDE_Pos)                    /*!< HRPWM0_CSG1 SRE: STDE Mask              */
#define HRPWM0_CSG1_SRE_CRSE_Pos              6                                                       /*!< HRPWM0_CSG1 SRE: CRSE Position          */
#define HRPWM0_CSG1_SRE_CRSE_Msk              (0x01UL << HRPWM0_CSG1_SRE_CRSE_Pos)                    /*!< HRPWM0_CSG1 SRE: CRSE Mask              */
#define HRPWM0_CSG1_SRE_CFSE_Pos              7                                                       /*!< HRPWM0_CSG1 SRE: CFSE Position          */
#define HRPWM0_CSG1_SRE_CFSE_Msk              (0x01UL << HRPWM0_CSG1_SRE_CFSE_Pos)                    /*!< HRPWM0_CSG1 SRE: CFSE Mask              */
#define HRPWM0_CSG1_SRE_CSEE_Pos              8                                                       /*!< HRPWM0_CSG1 SRE: CSEE Position          */
#define HRPWM0_CSG1_SRE_CSEE_Msk              (0x01UL << HRPWM0_CSG1_SRE_CSEE_Pos)                    /*!< HRPWM0_CSG1 SRE: CSEE Mask              */

/* -------------------------------  HRPWM0_CSG1_SRS  ------------------------------ */
#define HRPWM0_CSG1_SRS_VLS1S_Pos             0                                                       /*!< HRPWM0_CSG1 SRS: VLS1S Position         */
#define HRPWM0_CSG1_SRS_VLS1S_Msk             (0x03UL << HRPWM0_CSG1_SRS_VLS1S_Pos)                   /*!< HRPWM0_CSG1 SRS: VLS1S Mask             */
#define HRPWM0_CSG1_SRS_VLS2S_Pos             2                                                       /*!< HRPWM0_CSG1 SRS: VLS2S Position         */
#define HRPWM0_CSG1_SRS_VLS2S_Msk             (0x03UL << HRPWM0_CSG1_SRS_VLS2S_Pos)                   /*!< HRPWM0_CSG1 SRS: VLS2S Mask             */
#define HRPWM0_CSG1_SRS_TRLS_Pos              4                                                       /*!< HRPWM0_CSG1 SRS: TRLS Position          */
#define HRPWM0_CSG1_SRS_TRLS_Msk              (0x03UL << HRPWM0_CSG1_SRS_TRLS_Pos)                    /*!< HRPWM0_CSG1 SRS: TRLS Mask              */
#define HRPWM0_CSG1_SRS_SSLS_Pos              6                                                       /*!< HRPWM0_CSG1 SRS: SSLS Position          */
#define HRPWM0_CSG1_SRS_SSLS_Msk              (0x03UL << HRPWM0_CSG1_SRS_SSLS_Pos)                    /*!< HRPWM0_CSG1 SRS: SSLS Mask              */
#define HRPWM0_CSG1_SRS_STLS_Pos              8                                                       /*!< HRPWM0_CSG1 SRS: STLS Position          */
#define HRPWM0_CSG1_SRS_STLS_Msk              (0x03UL << HRPWM0_CSG1_SRS_STLS_Pos)                    /*!< HRPWM0_CSG1 SRS: STLS Mask              */
#define HRPWM0_CSG1_SRS_CRFLS_Pos             10                                                      /*!< HRPWM0_CSG1 SRS: CRFLS Position         */
#define HRPWM0_CSG1_SRS_CRFLS_Msk             (0x03UL << HRPWM0_CSG1_SRS_CRFLS_Pos)                   /*!< HRPWM0_CSG1 SRS: CRFLS Mask             */
#define HRPWM0_CSG1_SRS_CSLS_Pos              12                                                      /*!< HRPWM0_CSG1 SRS: CSLS Position          */
#define HRPWM0_CSG1_SRS_CSLS_Msk              (0x03UL << HRPWM0_CSG1_SRS_CSLS_Pos)                    /*!< HRPWM0_CSG1 SRS: CSLS Mask              */

/* -------------------------------  HRPWM0_CSG1_SWS  ------------------------------ */
#define HRPWM0_CSG1_SWS_SVLS1_Pos             0                                                       /*!< HRPWM0_CSG1 SWS: SVLS1 Position         */
#define HRPWM0_CSG1_SWS_SVLS1_Msk             (0x01UL << HRPWM0_CSG1_SWS_SVLS1_Pos)                   /*!< HRPWM0_CSG1 SWS: SVLS1 Mask             */
#define HRPWM0_CSG1_SWS_SVLS2_Pos             1                                                       /*!< HRPWM0_CSG1 SWS: SVLS2 Position         */
#define HRPWM0_CSG1_SWS_SVLS2_Msk             (0x01UL << HRPWM0_CSG1_SWS_SVLS2_Pos)                   /*!< HRPWM0_CSG1 SWS: SVLS2 Mask             */
#define HRPWM0_CSG1_SWS_STRGS_Pos             2                                                       /*!< HRPWM0_CSG1 SWS: STRGS Position         */
#define HRPWM0_CSG1_SWS_STRGS_Msk             (0x01UL << HRPWM0_CSG1_SWS_STRGS_Pos)                   /*!< HRPWM0_CSG1 SWS: STRGS Mask             */
#define HRPWM0_CSG1_SWS_SSTRS_Pos             3                                                       /*!< HRPWM0_CSG1 SWS: SSTRS Position         */
#define HRPWM0_CSG1_SWS_SSTRS_Msk             (0x01UL << HRPWM0_CSG1_SWS_SSTRS_Pos)                   /*!< HRPWM0_CSG1 SWS: SSTRS Mask             */
#define HRPWM0_CSG1_SWS_SSTPS_Pos             4                                                       /*!< HRPWM0_CSG1 SWS: SSTPS Position         */
#define HRPWM0_CSG1_SWS_SSTPS_Msk             (0x01UL << HRPWM0_CSG1_SWS_SSTPS_Pos)                   /*!< HRPWM0_CSG1 SWS: SSTPS Mask             */
#define HRPWM0_CSG1_SWS_SSTD_Pos              5                                                       /*!< HRPWM0_CSG1 SWS: SSTD Position          */
#define HRPWM0_CSG1_SWS_SSTD_Msk              (0x01UL << HRPWM0_CSG1_SWS_SSTD_Pos)                    /*!< HRPWM0_CSG1 SWS: SSTD Mask              */
#define HRPWM0_CSG1_SWS_SCRS_Pos              6                                                       /*!< HRPWM0_CSG1 SWS: SCRS Position          */
#define HRPWM0_CSG1_SWS_SCRS_Msk              (0x01UL << HRPWM0_CSG1_SWS_SCRS_Pos)                    /*!< HRPWM0_CSG1 SWS: SCRS Mask              */
#define HRPWM0_CSG1_SWS_SCFS_Pos              7                                                       /*!< HRPWM0_CSG1 SWS: SCFS Position          */
#define HRPWM0_CSG1_SWS_SCFS_Msk              (0x01UL << HRPWM0_CSG1_SWS_SCFS_Pos)                    /*!< HRPWM0_CSG1 SWS: SCFS Mask              */
#define HRPWM0_CSG1_SWS_SCSS_Pos              8                                                       /*!< HRPWM0_CSG1 SWS: SCSS Position          */
#define HRPWM0_CSG1_SWS_SCSS_Msk              (0x01UL << HRPWM0_CSG1_SWS_SCSS_Pos)                    /*!< HRPWM0_CSG1 SWS: SCSS Mask              */

/* -------------------------------  HRPWM0_CSG1_SWC  ------------------------------ */
#define HRPWM0_CSG1_SWC_CVLS1_Pos             0                                                       /*!< HRPWM0_CSG1 SWC: CVLS1 Position         */
#define HRPWM0_CSG1_SWC_CVLS1_Msk             (0x01UL << HRPWM0_CSG1_SWC_CVLS1_Pos)                   /*!< HRPWM0_CSG1 SWC: CVLS1 Mask             */
#define HRPWM0_CSG1_SWC_CVLS2_Pos             1                                                       /*!< HRPWM0_CSG1 SWC: CVLS2 Position         */
#define HRPWM0_CSG1_SWC_CVLS2_Msk             (0x01UL << HRPWM0_CSG1_SWC_CVLS2_Pos)                   /*!< HRPWM0_CSG1 SWC: CVLS2 Mask             */
#define HRPWM0_CSG1_SWC_CTRGS_Pos             2                                                       /*!< HRPWM0_CSG1 SWC: CTRGS Position         */
#define HRPWM0_CSG1_SWC_CTRGS_Msk             (0x01UL << HRPWM0_CSG1_SWC_CTRGS_Pos)                   /*!< HRPWM0_CSG1 SWC: CTRGS Mask             */
#define HRPWM0_CSG1_SWC_CSTRS_Pos             3                                                       /*!< HRPWM0_CSG1 SWC: CSTRS Position         */
#define HRPWM0_CSG1_SWC_CSTRS_Msk             (0x01UL << HRPWM0_CSG1_SWC_CSTRS_Pos)                   /*!< HRPWM0_CSG1 SWC: CSTRS Mask             */
#define HRPWM0_CSG1_SWC_CSTPS_Pos             4                                                       /*!< HRPWM0_CSG1 SWC: CSTPS Position         */
#define HRPWM0_CSG1_SWC_CSTPS_Msk             (0x01UL << HRPWM0_CSG1_SWC_CSTPS_Pos)                   /*!< HRPWM0_CSG1 SWC: CSTPS Mask             */
#define HRPWM0_CSG1_SWC_CSTD_Pos              5                                                       /*!< HRPWM0_CSG1 SWC: CSTD Position          */
#define HRPWM0_CSG1_SWC_CSTD_Msk              (0x01UL << HRPWM0_CSG1_SWC_CSTD_Pos)                    /*!< HRPWM0_CSG1 SWC: CSTD Mask              */
#define HRPWM0_CSG1_SWC_CCRS_Pos              6                                                       /*!< HRPWM0_CSG1 SWC: CCRS Position          */
#define HRPWM0_CSG1_SWC_CCRS_Msk              (0x01UL << HRPWM0_CSG1_SWC_CCRS_Pos)                    /*!< HRPWM0_CSG1 SWC: CCRS Mask              */
#define HRPWM0_CSG1_SWC_CCFS_Pos              7                                                       /*!< HRPWM0_CSG1 SWC: CCFS Position          */
#define HRPWM0_CSG1_SWC_CCFS_Msk              (0x01UL << HRPWM0_CSG1_SWC_CCFS_Pos)                    /*!< HRPWM0_CSG1 SWC: CCFS Mask              */
#define HRPWM0_CSG1_SWC_CCSS_Pos              8                                                       /*!< HRPWM0_CSG1 SWC: CCSS Position          */
#define HRPWM0_CSG1_SWC_CCSS_Msk              (0x01UL << HRPWM0_CSG1_SWC_CCSS_Pos)                    /*!< HRPWM0_CSG1 SWC: CCSS Mask              */

/* ------------------------------  HRPWM0_CSG1_ISTAT  ----------------------------- */
#define HRPWM0_CSG1_ISTAT_VLS1S_Pos           0                                                       /*!< HRPWM0_CSG1 ISTAT: VLS1S Position       */
#define HRPWM0_CSG1_ISTAT_VLS1S_Msk           (0x01UL << HRPWM0_CSG1_ISTAT_VLS1S_Pos)                 /*!< HRPWM0_CSG1 ISTAT: VLS1S Mask           */
#define HRPWM0_CSG1_ISTAT_VLS2S_Pos           1                                                       /*!< HRPWM0_CSG1 ISTAT: VLS2S Position       */
#define HRPWM0_CSG1_ISTAT_VLS2S_Msk           (0x01UL << HRPWM0_CSG1_ISTAT_VLS2S_Pos)                 /*!< HRPWM0_CSG1 ISTAT: VLS2S Mask           */
#define HRPWM0_CSG1_ISTAT_TRGSS_Pos           2                                                       /*!< HRPWM0_CSG1 ISTAT: TRGSS Position       */
#define HRPWM0_CSG1_ISTAT_TRGSS_Msk           (0x01UL << HRPWM0_CSG1_ISTAT_TRGSS_Pos)                 /*!< HRPWM0_CSG1 ISTAT: TRGSS Mask           */
#define HRPWM0_CSG1_ISTAT_STRSS_Pos           3                                                       /*!< HRPWM0_CSG1 ISTAT: STRSS Position       */
#define HRPWM0_CSG1_ISTAT_STRSS_Msk           (0x01UL << HRPWM0_CSG1_ISTAT_STRSS_Pos)                 /*!< HRPWM0_CSG1 ISTAT: STRSS Mask           */
#define HRPWM0_CSG1_ISTAT_STPSS_Pos           4                                                       /*!< HRPWM0_CSG1 ISTAT: STPSS Position       */
#define HRPWM0_CSG1_ISTAT_STPSS_Msk           (0x01UL << HRPWM0_CSG1_ISTAT_STPSS_Pos)                 /*!< HRPWM0_CSG1 ISTAT: STPSS Mask           */
#define HRPWM0_CSG1_ISTAT_STDS_Pos            5                                                       /*!< HRPWM0_CSG1 ISTAT: STDS Position        */
#define HRPWM0_CSG1_ISTAT_STDS_Msk            (0x01UL << HRPWM0_CSG1_ISTAT_STDS_Pos)                  /*!< HRPWM0_CSG1 ISTAT: STDS Mask            */
#define HRPWM0_CSG1_ISTAT_CRSS_Pos            6                                                       /*!< HRPWM0_CSG1 ISTAT: CRSS Position        */
#define HRPWM0_CSG1_ISTAT_CRSS_Msk            (0x01UL << HRPWM0_CSG1_ISTAT_CRSS_Pos)                  /*!< HRPWM0_CSG1 ISTAT: CRSS Mask            */
#define HRPWM0_CSG1_ISTAT_CFSS_Pos            7                                                       /*!< HRPWM0_CSG1 ISTAT: CFSS Position        */
#define HRPWM0_CSG1_ISTAT_CFSS_Msk            (0x01UL << HRPWM0_CSG1_ISTAT_CFSS_Pos)                  /*!< HRPWM0_CSG1 ISTAT: CFSS Mask            */
#define HRPWM0_CSG1_ISTAT_CSES_Pos            8                                                       /*!< HRPWM0_CSG1 ISTAT: CSES Position        */
#define HRPWM0_CSG1_ISTAT_CSES_Msk            (0x01UL << HRPWM0_CSG1_ISTAT_CSES_Pos)                  /*!< HRPWM0_CSG1 ISTAT: CSES Mask            */


/* ================================================================================ */
/* ================      struct 'HRPWM0_CSG2' Position & Mask      ================ */
/* ================================================================================ */


/* -------------------------------  HRPWM0_CSG2_DCI  ------------------------------ */
#define HRPWM0_CSG2_DCI_SVIS_Pos              0                                                       /*!< HRPWM0_CSG2 DCI: SVIS Position          */
#define HRPWM0_CSG2_DCI_SVIS_Msk              (0x0fUL << HRPWM0_CSG2_DCI_SVIS_Pos)                    /*!< HRPWM0_CSG2 DCI: SVIS Mask              */
#define HRPWM0_CSG2_DCI_STRIS_Pos             4                                                       /*!< HRPWM0_CSG2 DCI: STRIS Position         */
#define HRPWM0_CSG2_DCI_STRIS_Msk             (0x0fUL << HRPWM0_CSG2_DCI_STRIS_Pos)                   /*!< HRPWM0_CSG2 DCI: STRIS Mask             */
#define HRPWM0_CSG2_DCI_STPIS_Pos             8                                                       /*!< HRPWM0_CSG2 DCI: STPIS Position         */
#define HRPWM0_CSG2_DCI_STPIS_Msk             (0x0fUL << HRPWM0_CSG2_DCI_STPIS_Pos)                   /*!< HRPWM0_CSG2 DCI: STPIS Mask             */
#define HRPWM0_CSG2_DCI_TRGIS_Pos             12                                                      /*!< HRPWM0_CSG2 DCI: TRGIS Position         */
#define HRPWM0_CSG2_DCI_TRGIS_Msk             (0x0fUL << HRPWM0_CSG2_DCI_TRGIS_Pos)                   /*!< HRPWM0_CSG2 DCI: TRGIS Mask             */
#define HRPWM0_CSG2_DCI_STIS_Pos              16                                                      /*!< HRPWM0_CSG2 DCI: STIS Position          */
#define HRPWM0_CSG2_DCI_STIS_Msk              (0x0fUL << HRPWM0_CSG2_DCI_STIS_Pos)                    /*!< HRPWM0_CSG2 DCI: STIS Mask              */
#define HRPWM0_CSG2_DCI_SCS_Pos               20                                                      /*!< HRPWM0_CSG2 DCI: SCS Position           */
#define HRPWM0_CSG2_DCI_SCS_Msk               (0x03UL << HRPWM0_CSG2_DCI_SCS_Pos)                     /*!< HRPWM0_CSG2 DCI: SCS Mask               */

/* -------------------------------  HRPWM0_CSG2_IES  ------------------------------ */
#define HRPWM0_CSG2_IES_SVLS_Pos              0                                                       /*!< HRPWM0_CSG2 IES: SVLS Position          */
#define HRPWM0_CSG2_IES_SVLS_Msk              (0x03UL << HRPWM0_CSG2_IES_SVLS_Pos)                    /*!< HRPWM0_CSG2 IES: SVLS Mask              */
#define HRPWM0_CSG2_IES_STRES_Pos             2                                                       /*!< HRPWM0_CSG2 IES: STRES Position         */
#define HRPWM0_CSG2_IES_STRES_Msk             (0x03UL << HRPWM0_CSG2_IES_STRES_Pos)                   /*!< HRPWM0_CSG2 IES: STRES Mask             */
#define HRPWM0_CSG2_IES_STPES_Pos             4                                                       /*!< HRPWM0_CSG2 IES: STPES Position         */
#define HRPWM0_CSG2_IES_STPES_Msk             (0x03UL << HRPWM0_CSG2_IES_STPES_Pos)                   /*!< HRPWM0_CSG2 IES: STPES Mask             */
#define HRPWM0_CSG2_IES_TRGES_Pos             6                                                       /*!< HRPWM0_CSG2 IES: TRGES Position         */
#define HRPWM0_CSG2_IES_TRGES_Msk             (0x03UL << HRPWM0_CSG2_IES_TRGES_Pos)                   /*!< HRPWM0_CSG2 IES: TRGES Mask             */
#define HRPWM0_CSG2_IES_STES_Pos              8                                                       /*!< HRPWM0_CSG2 IES: STES Position          */
#define HRPWM0_CSG2_IES_STES_Msk              (0x03UL << HRPWM0_CSG2_IES_STES_Pos)                    /*!< HRPWM0_CSG2 IES: STES Mask              */

