FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4400.h
/* ------------------------------  HRPWM0_CSG2_ISTAT  ----------------------------- */
#define HRPWM0_CSG2_ISTAT_VLS1S_Pos           0                                                       /*!< HRPWM0_CSG2 ISTAT: VLS1S Position       */
#define HRPWM0_CSG2_ISTAT_VLS1S_Msk           (0x01UL << HRPWM0_CSG2_ISTAT_VLS1S_Pos)                 /*!< HRPWM0_CSG2 ISTAT: VLS1S Mask           */
#define HRPWM0_CSG2_ISTAT_VLS2S_Pos           1                                                       /*!< HRPWM0_CSG2 ISTAT: VLS2S Position       */
#define HRPWM0_CSG2_ISTAT_VLS2S_Msk           (0x01UL << HRPWM0_CSG2_ISTAT_VLS2S_Pos)                 /*!< HRPWM0_CSG2 ISTAT: VLS2S Mask           */
#define HRPWM0_CSG2_ISTAT_TRGSS_Pos           2                                                       /*!< HRPWM0_CSG2 ISTAT: TRGSS Position       */
#define HRPWM0_CSG2_ISTAT_TRGSS_Msk           (0x01UL << HRPWM0_CSG2_ISTAT_TRGSS_Pos)                 /*!< HRPWM0_CSG2 ISTAT: TRGSS Mask           */
#define HRPWM0_CSG2_ISTAT_STRSS_Pos           3                                                       /*!< HRPWM0_CSG2 ISTAT: STRSS Position       */
#define HRPWM0_CSG2_ISTAT_STRSS_Msk           (0x01UL << HRPWM0_CSG2_ISTAT_STRSS_Pos)                 /*!< HRPWM0_CSG2 ISTAT: STRSS Mask           */
#define HRPWM0_CSG2_ISTAT_STPSS_Pos           4                                                       /*!< HRPWM0_CSG2 ISTAT: STPSS Position       */
#define HRPWM0_CSG2_ISTAT_STPSS_Msk           (0x01UL << HRPWM0_CSG2_ISTAT_STPSS_Pos)                 /*!< HRPWM0_CSG2 ISTAT: STPSS Mask           */
#define HRPWM0_CSG2_ISTAT_STDS_Pos            5                                                       /*!< HRPWM0_CSG2 ISTAT: STDS Position        */
#define HRPWM0_CSG2_ISTAT_STDS_Msk            (0x01UL << HRPWM0_CSG2_ISTAT_STDS_Pos)                  /*!< HRPWM0_CSG2 ISTAT: STDS Mask            */
#define HRPWM0_CSG2_ISTAT_CRSS_Pos            6                                                       /*!< HRPWM0_CSG2 ISTAT: CRSS Position        */
#define HRPWM0_CSG2_ISTAT_CRSS_Msk            (0x01UL << HRPWM0_CSG2_ISTAT_CRSS_Pos)                  /*!< HRPWM0_CSG2 ISTAT: CRSS Mask            */
#define HRPWM0_CSG2_ISTAT_CFSS_Pos            7                                                       /*!< HRPWM0_CSG2 ISTAT: CFSS Position        */
#define HRPWM0_CSG2_ISTAT_CFSS_Msk            (0x01UL << HRPWM0_CSG2_ISTAT_CFSS_Pos)                  /*!< HRPWM0_CSG2 ISTAT: CFSS Mask            */
#define HRPWM0_CSG2_ISTAT_CSES_Pos            8                                                       /*!< HRPWM0_CSG2 ISTAT: CSES Position        */
#define HRPWM0_CSG2_ISTAT_CSES_Msk            (0x01UL << HRPWM0_CSG2_ISTAT_CSES_Pos)                  /*!< HRPWM0_CSG2 ISTAT: CSES Mask            */


/* ================================================================================ */
/* ================       Group 'HRPWM0_HRC' Position & Mask       ================ */
/* ================================================================================ */


/* --------------------------------  HRPWM0_HRC_GC  ------------------------------- */
#define HRPWM0_HRC_GC_HRM0_Pos                0                                                       /*!< HRPWM0_HRC GC: HRM0 Position            */
#define HRPWM0_HRC_GC_HRM0_Msk                (0x03UL << HRPWM0_HRC_GC_HRM0_Pos)                      /*!< HRPWM0_HRC GC: HRM0 Mask                */
#define HRPWM0_HRC_GC_HRM1_Pos                2                                                       /*!< HRPWM0_HRC GC: HRM1 Position            */
#define HRPWM0_HRC_GC_HRM1_Msk                (0x03UL << HRPWM0_HRC_GC_HRM1_Pos)                      /*!< HRPWM0_HRC GC: HRM1 Mask                */
#define HRPWM0_HRC_GC_DTE_Pos                 8                                                       /*!< HRPWM0_HRC GC: DTE Position             */
#define HRPWM0_HRC_GC_DTE_Msk                 (0x01UL << HRPWM0_HRC_GC_DTE_Pos)                       /*!< HRPWM0_HRC GC: DTE Mask                 */
#define HRPWM0_HRC_GC_TR0E_Pos                9                                                       /*!< HRPWM0_HRC GC: TR0E Position            */
#define HRPWM0_HRC_GC_TR0E_Msk                (0x01UL << HRPWM0_HRC_GC_TR0E_Pos)                      /*!< HRPWM0_HRC GC: TR0E Mask                */
#define HRPWM0_HRC_GC_TR1E_Pos                10                                                      /*!< HRPWM0_HRC GC: TR1E Position            */
#define HRPWM0_HRC_GC_TR1E_Msk                (0x01UL << HRPWM0_HRC_GC_TR1E_Pos)                      /*!< HRPWM0_HRC GC: TR1E Mask                */
#define HRPWM0_HRC_GC_STC_Pos                 11                                                      /*!< HRPWM0_HRC GC: STC Position             */
#define HRPWM0_HRC_GC_STC_Msk                 (0x01UL << HRPWM0_HRC_GC_STC_Pos)                       /*!< HRPWM0_HRC GC: STC Mask                 */
#define HRPWM0_HRC_GC_DSTC_Pos                12                                                      /*!< HRPWM0_HRC GC: DSTC Position            */
#define HRPWM0_HRC_GC_DSTC_Msk                (0x01UL << HRPWM0_HRC_GC_DSTC_Pos)                      /*!< HRPWM0_HRC GC: DSTC Mask                */
#define HRPWM0_HRC_GC_OCS0_Pos                13                                                      /*!< HRPWM0_HRC GC: OCS0 Position            */
#define HRPWM0_HRC_GC_OCS0_Msk                (0x01UL << HRPWM0_HRC_GC_OCS0_Pos)                      /*!< HRPWM0_HRC GC: OCS0 Mask                */
#define HRPWM0_HRC_GC_OCS1_Pos                14                                                      /*!< HRPWM0_HRC GC: OCS1 Position            */
#define HRPWM0_HRC_GC_OCS1_Msk                (0x01UL << HRPWM0_HRC_GC_OCS1_Pos)                      /*!< HRPWM0_HRC GC: OCS1 Mask                */
#define HRPWM0_HRC_GC_DTUS_Pos                16                                                      /*!< HRPWM0_HRC GC: DTUS Position            */
#define HRPWM0_HRC_GC_DTUS_Msk                (0x01UL << HRPWM0_HRC_GC_DTUS_Pos)                      /*!< HRPWM0_HRC GC: DTUS Mask                */

