FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4400.h
/* -------------------------------  HRPWM0_HRC_DCF  ------------------------------- */
#define HRPWM0_HRC_DCF_DTFV_Pos               0                                                       /*!< HRPWM0_HRC DCF: DTFV Position           */
#define HRPWM0_HRC_DCF_DTFV_Msk               (0x0000ffffUL << HRPWM0_HRC_DCF_DTFV_Pos)               /*!< HRPWM0_HRC DCF: DTFV Mask               */

/* -------------------------------  HRPWM0_HRC_CR1  ------------------------------- */
#define HRPWM0_HRC_CR1_CR1_Pos                0                                                       /*!< HRPWM0_HRC CR1: CR1 Position            */
#define HRPWM0_HRC_CR1_CR1_Msk                (0x000000ffUL << HRPWM0_HRC_CR1_CR1_Pos)                /*!< HRPWM0_HRC CR1: CR1 Mask                */

/* -------------------------------  HRPWM0_HRC_CR2  ------------------------------- */
#define HRPWM0_HRC_CR2_CR2_Pos                0                                                       /*!< HRPWM0_HRC CR2: CR2 Position            */
#define HRPWM0_HRC_CR2_CR2_Msk                (0x000000ffUL << HRPWM0_HRC_CR2_CR2_Pos)                /*!< HRPWM0_HRC CR2: CR2 Mask                */

/* -------------------------------  HRPWM0_HRC_SSC  ------------------------------- */
#define HRPWM0_HRC_SSC_SST_Pos                0                                                       /*!< HRPWM0_HRC SSC: SST Position            */
#define HRPWM0_HRC_SSC_SST_Msk                (0x01UL << HRPWM0_HRC_SSC_SST_Pos)                      /*!< HRPWM0_HRC SSC: SST Mask                */

/* -------------------------------  HRPWM0_HRC_SDCR  ------------------------------ */
#define HRPWM0_HRC_SDCR_SDTRV_Pos             0                                                       /*!< HRPWM0_HRC SDCR: SDTRV Position         */
#define HRPWM0_HRC_SDCR_SDTRV_Msk             (0x0000ffffUL << HRPWM0_HRC_SDCR_SDTRV_Pos)             /*!< HRPWM0_HRC SDCR: SDTRV Mask             */

/* -------------------------------  HRPWM0_HRC_SDCF  ------------------------------ */
#define HRPWM0_HRC_SDCF_SDTFV_Pos             0                                                       /*!< HRPWM0_HRC SDCF: SDTFV Position         */
#define HRPWM0_HRC_SDCF_SDTFV_Msk             (0x0000ffffUL << HRPWM0_HRC_SDCF_SDTFV_Pos)             /*!< HRPWM0_HRC SDCF: SDTFV Mask             */

/* -------------------------------  HRPWM0_HRC_SCR1  ------------------------------ */
#define HRPWM0_HRC_SCR1_SCR1_Pos              0                                                       /*!< HRPWM0_HRC SCR1: SCR1 Position          */
#define HRPWM0_HRC_SCR1_SCR1_Msk              (0x000000ffUL << HRPWM0_HRC_SCR1_SCR1_Pos)              /*!< HRPWM0_HRC SCR1: SCR1 Mask              */

/* -------------------------------  HRPWM0_HRC_SCR2  ------------------------------ */
#define HRPWM0_HRC_SCR2_SCR2_Pos              0                                                       /*!< HRPWM0_HRC SCR2: SCR2 Position          */
#define HRPWM0_HRC_SCR2_SCR2_Msk              (0x000000ffUL << HRPWM0_HRC_SCR2_SCR2_Pos)              /*!< HRPWM0_HRC SCR2: SCR2 Mask              */


/* ================================================================================ */
/* ================      struct 'HRPWM0_HRC0' Position & Mask      ================ */
/* ================================================================================ */


/* -------------------------------  HRPWM0_HRC0_GC  ------------------------------- */
#define HRPWM0_HRC0_GC_HRM0_Pos               0                                                       /*!< HRPWM0_HRC0 GC: HRM0 Position           */
#define HRPWM0_HRC0_GC_HRM0_Msk               (0x03UL << HRPWM0_HRC0_GC_HRM0_Pos)                     /*!< HRPWM0_HRC0 GC: HRM0 Mask               */
#define HRPWM0_HRC0_GC_HRM1_Pos               2                                                       /*!< HRPWM0_HRC0 GC: HRM1 Position           */
#define HRPWM0_HRC0_GC_HRM1_Msk               (0x03UL << HRPWM0_HRC0_GC_HRM1_Pos)                     /*!< HRPWM0_HRC0 GC: HRM1 Mask               */
#define HRPWM0_HRC0_GC_DTE_Pos                8                                                       /*!< HRPWM0_HRC0 GC: DTE Position            */
#define HRPWM0_HRC0_GC_DTE_Msk                (0x01UL << HRPWM0_HRC0_GC_DTE_Pos)                      /*!< HRPWM0_HRC0 GC: DTE Mask                */
#define HRPWM0_HRC0_GC_TR0E_Pos               9                                                       /*!< HRPWM0_HRC0 GC: TR0E Position           */
#define HRPWM0_HRC0_GC_TR0E_Msk               (0x01UL << HRPWM0_HRC0_GC_TR0E_Pos)                     /*!< HRPWM0_HRC0 GC: TR0E Mask               */
#define HRPWM0_HRC0_GC_TR1E_Pos               10                                                      /*!< HRPWM0_HRC0 GC: TR1E Position           */
#define HRPWM0_HRC0_GC_TR1E_Msk               (0x01UL << HRPWM0_HRC0_GC_TR1E_Pos)                     /*!< HRPWM0_HRC0 GC: TR1E Mask               */
#define HRPWM0_HRC0_GC_STC_Pos                11                                                      /*!< HRPWM0_HRC0 GC: STC Position            */
#define HRPWM0_HRC0_GC_STC_Msk                (0x01UL << HRPWM0_HRC0_GC_STC_Pos)                      /*!< HRPWM0_HRC0 GC: STC Mask                */
#define HRPWM0_HRC0_GC_DSTC_Pos               12                                                      /*!< HRPWM0_HRC0 GC: DSTC Position           */
#define HRPWM0_HRC0_GC_DSTC_Msk               (0x01UL << HRPWM0_HRC0_GC_DSTC_Pos)                     /*!< HRPWM0_HRC0 GC: DSTC Mask               */
#define HRPWM0_HRC0_GC_OCS0_Pos               13                                                      /*!< HRPWM0_HRC0 GC: OCS0 Position           */
#define HRPWM0_HRC0_GC_OCS0_Msk               (0x01UL << HRPWM0_HRC0_GC_OCS0_Pos)                     /*!< HRPWM0_HRC0 GC: OCS0 Mask               */
#define HRPWM0_HRC0_GC_OCS1_Pos               14                                                      /*!< HRPWM0_HRC0 GC: OCS1 Position           */
#define HRPWM0_HRC0_GC_OCS1_Msk               (0x01UL << HRPWM0_HRC0_GC_OCS1_Pos)                     /*!< HRPWM0_HRC0 GC: OCS1 Mask               */
#define HRPWM0_HRC0_GC_DTUS_Pos               16                                                      /*!< HRPWM0_HRC0 GC: DTUS Position           */
#define HRPWM0_HRC0_GC_DTUS_Msk               (0x01UL << HRPWM0_HRC0_GC_DTUS_Pos)                     /*!< HRPWM0_HRC0 GC: DTUS Mask               */

/* -------------------------------  HRPWM0_HRC0_PL  ------------------------------- */
#define HRPWM0_HRC0_PL_PSL0_Pos               0                                                       /*!< HRPWM0_HRC0 PL: PSL0 Position           */
#define HRPWM0_HRC0_PL_PSL0_Msk               (0x01UL << HRPWM0_HRC0_PL_PSL0_Pos)                     /*!< HRPWM0_HRC0 PL: PSL0 Mask               */
#define HRPWM0_HRC0_PL_PSL1_Pos               1                                                       /*!< HRPWM0_HRC0 PL: PSL1 Position           */
#define HRPWM0_HRC0_PL_PSL1_Msk               (0x01UL << HRPWM0_HRC0_PL_PSL1_Pos)                     /*!< HRPWM0_HRC0 PL: PSL1 Mask               */

/* ------------------------------  HRPWM0_HRC0_GSEL  ------------------------------ */
#define HRPWM0_HRC0_GSEL_C0SS_Pos             0                                                       /*!< HRPWM0_HRC0 GSEL: C0SS Position         */
#define HRPWM0_HRC0_GSEL_C0SS_Msk             (0x07UL << HRPWM0_HRC0_GSEL_C0SS_Pos)                   /*!< HRPWM0_HRC0 GSEL: C0SS Mask             */
#define HRPWM0_HRC0_GSEL_C0CS_Pos             3                                                       /*!< HRPWM0_HRC0 GSEL: C0CS Position         */
#define HRPWM0_HRC0_GSEL_C0CS_Msk             (0x07UL << HRPWM0_HRC0_GSEL_C0CS_Pos)                   /*!< HRPWM0_HRC0 GSEL: C0CS Mask             */
#define HRPWM0_HRC0_GSEL_S0M_Pos              6                                                       /*!< HRPWM0_HRC0 GSEL: S0M Position          */
#define HRPWM0_HRC0_GSEL_S0M_Msk              (0x03UL << HRPWM0_HRC0_GSEL_S0M_Pos)                    /*!< HRPWM0_HRC0 GSEL: S0M Mask              */
#define HRPWM0_HRC0_GSEL_C0M_Pos              8                                                       /*!< HRPWM0_HRC0 GSEL: C0M Position          */
#define HRPWM0_HRC0_GSEL_C0M_Msk              (0x03UL << HRPWM0_HRC0_GSEL_C0M_Pos)                    /*!< HRPWM0_HRC0 GSEL: C0M Mask              */
#define HRPWM0_HRC0_GSEL_S0ES_Pos             10                                                      /*!< HRPWM0_HRC0 GSEL: S0ES Position         */
#define HRPWM0_HRC0_GSEL_S0ES_Msk             (0x03UL << HRPWM0_HRC0_GSEL_S0ES_Pos)                   /*!< HRPWM0_HRC0 GSEL: S0ES Mask             */
#define HRPWM0_HRC0_GSEL_C0ES_Pos             12                                                      /*!< HRPWM0_HRC0 GSEL: C0ES Position         */
#define HRPWM0_HRC0_GSEL_C0ES_Msk             (0x03UL << HRPWM0_HRC0_GSEL_C0ES_Pos)                   /*!< HRPWM0_HRC0 GSEL: C0ES Mask             */
#define HRPWM0_HRC0_GSEL_C1SS_Pos             16                                                      /*!< HRPWM0_HRC0 GSEL: C1SS Position         */
#define HRPWM0_HRC0_GSEL_C1SS_Msk             (0x07UL << HRPWM0_HRC0_GSEL_C1SS_Pos)                   /*!< HRPWM0_HRC0 GSEL: C1SS Mask             */
#define HRPWM0_HRC0_GSEL_C1CS_Pos             19                                                      /*!< HRPWM0_HRC0 GSEL: C1CS Position         */
#define HRPWM0_HRC0_GSEL_C1CS_Msk             (0x07UL << HRPWM0_HRC0_GSEL_C1CS_Pos)                   /*!< HRPWM0_HRC0 GSEL: C1CS Mask             */
#define HRPWM0_HRC0_GSEL_S1M_Pos              22                                                      /*!< HRPWM0_HRC0 GSEL: S1M Position          */
#define HRPWM0_HRC0_GSEL_S1M_Msk              (0x03UL << HRPWM0_HRC0_GSEL_S1M_Pos)                    /*!< HRPWM0_HRC0 GSEL: S1M Mask              */
#define HRPWM0_HRC0_GSEL_C1M_Pos              24                                                      /*!< HRPWM0_HRC0 GSEL: C1M Position          */
#define HRPWM0_HRC0_GSEL_C1M_Msk              (0x03UL << HRPWM0_HRC0_GSEL_C1M_Pos)                    /*!< HRPWM0_HRC0 GSEL: C1M Mask              */
#define HRPWM0_HRC0_GSEL_S1ES_Pos             26                                                      /*!< HRPWM0_HRC0 GSEL: S1ES Position         */
#define HRPWM0_HRC0_GSEL_S1ES_Msk             (0x03UL << HRPWM0_HRC0_GSEL_S1ES_Pos)                   /*!< HRPWM0_HRC0 GSEL: S1ES Mask             */
#define HRPWM0_HRC0_GSEL_C1ES_Pos             28                                                      /*!< HRPWM0_HRC0 GSEL: C1ES Position         */
#define HRPWM0_HRC0_GSEL_C1ES_Msk             (0x03UL << HRPWM0_HRC0_GSEL_C1ES_Pos)                   /*!< HRPWM0_HRC0 GSEL: C1ES Mask             */

/* ------------------------------  HRPWM0_HRC0_TSEL  ------------------------------ */
#define HRPWM0_HRC0_TSEL_TSEL0_Pos            0                                                       /*!< HRPWM0_HRC0 TSEL: TSEL0 Position        */
#define HRPWM0_HRC0_TSEL_TSEL0_Msk            (0x07UL << HRPWM0_HRC0_TSEL_TSEL0_Pos)                  /*!< HRPWM0_HRC0 TSEL: TSEL0 Mask            */
#define HRPWM0_HRC0_TSEL_TSEL1_Pos            3                                                       /*!< HRPWM0_HRC0 TSEL: TSEL1 Position        */
#define HRPWM0_HRC0_TSEL_TSEL1_Msk            (0x07UL << HRPWM0_HRC0_TSEL_TSEL1_Pos)                  /*!< HRPWM0_HRC0 TSEL: TSEL1 Mask            */
#define HRPWM0_HRC0_TSEL_TS0E_Pos             16                                                      /*!< HRPWM0_HRC0 TSEL: TS0E Position         */
#define HRPWM0_HRC0_TSEL_TS0E_Msk             (0x01UL << HRPWM0_HRC0_TSEL_TS0E_Pos)                   /*!< HRPWM0_HRC0 TSEL: TS0E Mask             */
#define HRPWM0_HRC0_TSEL_TS1E_Pos             17                                                      /*!< HRPWM0_HRC0 TSEL: TS1E Position         */
#define HRPWM0_HRC0_TSEL_TS1E_Msk             (0x01UL << HRPWM0_HRC0_TSEL_TS1E_Pos)                   /*!< HRPWM0_HRC0 TSEL: TS1E Mask             */

