FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4400.h
/* ----------------------------------  PORT1_OUT  --------------------------------- */
#define PORT1_OUT_P0_Pos                      0                                                       /*!< PORT1 OUT: P0 Position                  */
#define PORT1_OUT_P0_Msk                      (0x01UL << PORT1_OUT_P0_Pos)                            /*!< PORT1 OUT: P0 Mask                      */
#define PORT1_OUT_P1_Pos                      1                                                       /*!< PORT1 OUT: P1 Position                  */
#define PORT1_OUT_P1_Msk                      (0x01UL << PORT1_OUT_P1_Pos)                            /*!< PORT1 OUT: P1 Mask                      */
#define PORT1_OUT_P2_Pos                      2                                                       /*!< PORT1 OUT: P2 Position                  */
#define PORT1_OUT_P2_Msk                      (0x01UL << PORT1_OUT_P2_Pos)                            /*!< PORT1 OUT: P2 Mask                      */
#define PORT1_OUT_P3_Pos                      3                                                       /*!< PORT1 OUT: P3 Position                  */
#define PORT1_OUT_P3_Msk                      (0x01UL << PORT1_OUT_P3_Pos)                            /*!< PORT1 OUT: P3 Mask                      */
#define PORT1_OUT_P4_Pos                      4                                                       /*!< PORT1 OUT: P4 Position                  */
#define PORT1_OUT_P4_Msk                      (0x01UL << PORT1_OUT_P4_Pos)                            /*!< PORT1 OUT: P4 Mask                      */
#define PORT1_OUT_P5_Pos                      5                                                       /*!< PORT1 OUT: P5 Position                  */
#define PORT1_OUT_P5_Msk                      (0x01UL << PORT1_OUT_P5_Pos)                            /*!< PORT1 OUT: P5 Mask                      */
#define PORT1_OUT_P6_Pos                      6                                                       /*!< PORT1 OUT: P6 Position                  */
#define PORT1_OUT_P6_Msk                      (0x01UL << PORT1_OUT_P6_Pos)                            /*!< PORT1 OUT: P6 Mask                      */
#define PORT1_OUT_P7_Pos                      7                                                       /*!< PORT1 OUT: P7 Position                  */
#define PORT1_OUT_P7_Msk                      (0x01UL << PORT1_OUT_P7_Pos)                            /*!< PORT1 OUT: P7 Mask                      */
#define PORT1_OUT_P8_Pos                      8                                                       /*!< PORT1 OUT: P8 Position                  */
#define PORT1_OUT_P8_Msk                      (0x01UL << PORT1_OUT_P8_Pos)                            /*!< PORT1 OUT: P8 Mask                      */
#define PORT1_OUT_P9_Pos                      9                                                       /*!< PORT1 OUT: P9 Position                  */
#define PORT1_OUT_P9_Msk                      (0x01UL << PORT1_OUT_P9_Pos)                            /*!< PORT1 OUT: P9 Mask                      */
#define PORT1_OUT_P10_Pos                     10                                                      /*!< PORT1 OUT: P10 Position                 */
#define PORT1_OUT_P10_Msk                     (0x01UL << PORT1_OUT_P10_Pos)                           /*!< PORT1 OUT: P10 Mask                     */
#define PORT1_OUT_P11_Pos                     11                                                      /*!< PORT1 OUT: P11 Position                 */
#define PORT1_OUT_P11_Msk                     (0x01UL << PORT1_OUT_P11_Pos)                           /*!< PORT1 OUT: P11 Mask                     */
#define PORT1_OUT_P12_Pos                     12                                                      /*!< PORT1 OUT: P12 Position                 */
#define PORT1_OUT_P12_Msk                     (0x01UL << PORT1_OUT_P12_Pos)                           /*!< PORT1 OUT: P12 Mask                     */
#define PORT1_OUT_P13_Pos                     13                                                      /*!< PORT1 OUT: P13 Position                 */
#define PORT1_OUT_P13_Msk                     (0x01UL << PORT1_OUT_P13_Pos)                           /*!< PORT1 OUT: P13 Mask                     */
#define PORT1_OUT_P14_Pos                     14                                                      /*!< PORT1 OUT: P14 Position                 */
#define PORT1_OUT_P14_Msk                     (0x01UL << PORT1_OUT_P14_Pos)                           /*!< PORT1 OUT: P14 Mask                     */
#define PORT1_OUT_P15_Pos                     15                                                      /*!< PORT1 OUT: P15 Position                 */
#define PORT1_OUT_P15_Msk                     (0x01UL << PORT1_OUT_P15_Pos)                           /*!< PORT1 OUT: P15 Mask                     */

/* ----------------------------------  PORT1_OMR  --------------------------------- */
#define PORT1_OMR_PS0_Pos                     0                                                       /*!< PORT1 OMR: PS0 Position                 */
#define PORT1_OMR_PS0_Msk                     (0x01UL << PORT1_OMR_PS0_Pos)                           /*!< PORT1 OMR: PS0 Mask                     */
#define PORT1_OMR_PS1_Pos                     1                                                       /*!< PORT1 OMR: PS1 Position                 */
#define PORT1_OMR_PS1_Msk                     (0x01UL << PORT1_OMR_PS1_Pos)                           /*!< PORT1 OMR: PS1 Mask                     */
#define PORT1_OMR_PS2_Pos                     2                                                       /*!< PORT1 OMR: PS2 Position                 */
#define PORT1_OMR_PS2_Msk                     (0x01UL << PORT1_OMR_PS2_Pos)                           /*!< PORT1 OMR: PS2 Mask                     */
#define PORT1_OMR_PS3_Pos                     3                                                       /*!< PORT1 OMR: PS3 Position                 */
#define PORT1_OMR_PS3_Msk                     (0x01UL << PORT1_OMR_PS3_Pos)                           /*!< PORT1 OMR: PS3 Mask                     */
#define PORT1_OMR_PS4_Pos                     4                                                       /*!< PORT1 OMR: PS4 Position                 */
#define PORT1_OMR_PS4_Msk                     (0x01UL << PORT1_OMR_PS4_Pos)                           /*!< PORT1 OMR: PS4 Mask                     */
#define PORT1_OMR_PS5_Pos                     5                                                       /*!< PORT1 OMR: PS5 Position                 */
#define PORT1_OMR_PS5_Msk                     (0x01UL << PORT1_OMR_PS5_Pos)                           /*!< PORT1 OMR: PS5 Mask                     */
#define PORT1_OMR_PS6_Pos                     6                                                       /*!< PORT1 OMR: PS6 Position                 */
#define PORT1_OMR_PS6_Msk                     (0x01UL << PORT1_OMR_PS6_Pos)                           /*!< PORT1 OMR: PS6 Mask                     */
#define PORT1_OMR_PS7_Pos                     7                                                       /*!< PORT1 OMR: PS7 Position                 */
#define PORT1_OMR_PS7_Msk                     (0x01UL << PORT1_OMR_PS7_Pos)                           /*!< PORT1 OMR: PS7 Mask                     */
#define PORT1_OMR_PS8_Pos                     8                                                       /*!< PORT1 OMR: PS8 Position                 */
#define PORT1_OMR_PS8_Msk                     (0x01UL << PORT1_OMR_PS8_Pos)                           /*!< PORT1 OMR: PS8 Mask                     */
#define PORT1_OMR_PS9_Pos                     9                                                       /*!< PORT1 OMR: PS9 Position                 */
#define PORT1_OMR_PS9_Msk                     (0x01UL << PORT1_OMR_PS9_Pos)                           /*!< PORT1 OMR: PS9 Mask                     */
#define PORT1_OMR_PS10_Pos                    10                                                      /*!< PORT1 OMR: PS10 Position                */
#define PORT1_OMR_PS10_Msk                    (0x01UL << PORT1_OMR_PS10_Pos)                          /*!< PORT1 OMR: PS10 Mask                    */
#define PORT1_OMR_PS11_Pos                    11                                                      /*!< PORT1 OMR: PS11 Position                */
#define PORT1_OMR_PS11_Msk                    (0x01UL << PORT1_OMR_PS11_Pos)                          /*!< PORT1 OMR: PS11 Mask                    */
#define PORT1_OMR_PS12_Pos                    12                                                      /*!< PORT1 OMR: PS12 Position                */
#define PORT1_OMR_PS12_Msk                    (0x01UL << PORT1_OMR_PS12_Pos)                          /*!< PORT1 OMR: PS12 Mask                    */
#define PORT1_OMR_PS13_Pos                    13                                                      /*!< PORT1 OMR: PS13 Position                */
#define PORT1_OMR_PS13_Msk                    (0x01UL << PORT1_OMR_PS13_Pos)                          /*!< PORT1 OMR: PS13 Mask                    */
#define PORT1_OMR_PS14_Pos                    14                                                      /*!< PORT1 OMR: PS14 Position                */
#define PORT1_OMR_PS14_Msk                    (0x01UL << PORT1_OMR_PS14_Pos)                          /*!< PORT1 OMR: PS14 Mask                    */
#define PORT1_OMR_PS15_Pos                    15                                                      /*!< PORT1 OMR: PS15 Position                */
#define PORT1_OMR_PS15_Msk                    (0x01UL << PORT1_OMR_PS15_Pos)                          /*!< PORT1 OMR: PS15 Mask                    */
#define PORT1_OMR_PR0_Pos                     16                                                      /*!< PORT1 OMR: PR0 Position                 */
#define PORT1_OMR_PR0_Msk                     (0x01UL << PORT1_OMR_PR0_Pos)                           /*!< PORT1 OMR: PR0 Mask                     */
#define PORT1_OMR_PR1_Pos                     17                                                      /*!< PORT1 OMR: PR1 Position                 */
#define PORT1_OMR_PR1_Msk                     (0x01UL << PORT1_OMR_PR1_Pos)                           /*!< PORT1 OMR: PR1 Mask                     */
#define PORT1_OMR_PR2_Pos                     18                                                      /*!< PORT1 OMR: PR2 Position                 */
#define PORT1_OMR_PR2_Msk                     (0x01UL << PORT1_OMR_PR2_Pos)                           /*!< PORT1 OMR: PR2 Mask                     */
#define PORT1_OMR_PR3_Pos                     19                                                      /*!< PORT1 OMR: PR3 Position                 */
#define PORT1_OMR_PR3_Msk                     (0x01UL << PORT1_OMR_PR3_Pos)                           /*!< PORT1 OMR: PR3 Mask                     */
#define PORT1_OMR_PR4_Pos                     20                                                      /*!< PORT1 OMR: PR4 Position                 */
#define PORT1_OMR_PR4_Msk                     (0x01UL << PORT1_OMR_PR4_Pos)                           /*!< PORT1 OMR: PR4 Mask                     */
#define PORT1_OMR_PR5_Pos                     21                                                      /*!< PORT1 OMR: PR5 Position                 */
#define PORT1_OMR_PR5_Msk                     (0x01UL << PORT1_OMR_PR5_Pos)                           /*!< PORT1 OMR: PR5 Mask                     */
#define PORT1_OMR_PR6_Pos                     22                                                      /*!< PORT1 OMR: PR6 Position                 */
#define PORT1_OMR_PR6_Msk                     (0x01UL << PORT1_OMR_PR6_Pos)                           /*!< PORT1 OMR: PR6 Mask                     */
#define PORT1_OMR_PR7_Pos                     23                                                      /*!< PORT1 OMR: PR7 Position                 */
#define PORT1_OMR_PR7_Msk                     (0x01UL << PORT1_OMR_PR7_Pos)                           /*!< PORT1 OMR: PR7 Mask                     */
#define PORT1_OMR_PR8_Pos                     24                                                      /*!< PORT1 OMR: PR8 Position                 */
#define PORT1_OMR_PR8_Msk                     (0x01UL << PORT1_OMR_PR8_Pos)                           /*!< PORT1 OMR: PR8 Mask                     */
#define PORT1_OMR_PR9_Pos                     25                                                      /*!< PORT1 OMR: PR9 Position                 */
#define PORT1_OMR_PR9_Msk                     (0x01UL << PORT1_OMR_PR9_Pos)                           /*!< PORT1 OMR: PR9 Mask                     */
#define PORT1_OMR_PR10_Pos                    26                                                      /*!< PORT1 OMR: PR10 Position                */
#define PORT1_OMR_PR10_Msk                    (0x01UL << PORT1_OMR_PR10_Pos)                          /*!< PORT1 OMR: PR10 Mask                    */
#define PORT1_OMR_PR11_Pos                    27                                                      /*!< PORT1 OMR: PR11 Position                */
#define PORT1_OMR_PR11_Msk                    (0x01UL << PORT1_OMR_PR11_Pos)                          /*!< PORT1 OMR: PR11 Mask                    */
#define PORT1_OMR_PR12_Pos                    28                                                      /*!< PORT1 OMR: PR12 Position                */
#define PORT1_OMR_PR12_Msk                    (0x01UL << PORT1_OMR_PR12_Pos)                          /*!< PORT1 OMR: PR12 Mask                    */
#define PORT1_OMR_PR13_Pos                    29                                                      /*!< PORT1 OMR: PR13 Position                */
#define PORT1_OMR_PR13_Msk                    (0x01UL << PORT1_OMR_PR13_Pos)                          /*!< PORT1 OMR: PR13 Mask                    */
#define PORT1_OMR_PR14_Pos                    30                                                      /*!< PORT1 OMR: PR14 Position                */
#define PORT1_OMR_PR14_Msk                    (0x01UL << PORT1_OMR_PR14_Pos)                          /*!< PORT1 OMR: PR14 Mask                    */
#define PORT1_OMR_PR15_Pos                    31                                                      /*!< PORT1 OMR: PR15 Position                */
#define PORT1_OMR_PR15_Msk                    (0x01UL << PORT1_OMR_PR15_Pos)                          /*!< PORT1 OMR: PR15 Mask                    */

/* ---------------------------------  PORT1_IOCR0  -------------------------------- */
#define PORT1_IOCR0_PC0_Pos                   3                                                       /*!< PORT1 IOCR0: PC0 Position               */
#define PORT1_IOCR0_PC0_Msk                   (0x1fUL << PORT1_IOCR0_PC0_Pos)                         /*!< PORT1 IOCR0: PC0 Mask                   */
#define PORT1_IOCR0_PC1_Pos                   11                                                      /*!< PORT1 IOCR0: PC1 Position               */
#define PORT1_IOCR0_PC1_Msk                   (0x1fUL << PORT1_IOCR0_PC1_Pos)                         /*!< PORT1 IOCR0: PC1 Mask                   */
#define PORT1_IOCR0_PC2_Pos                   19                                                      /*!< PORT1 IOCR0: PC2 Position               */
#define PORT1_IOCR0_PC2_Msk                   (0x1fUL << PORT1_IOCR0_PC2_Pos)                         /*!< PORT1 IOCR0: PC2 Mask                   */
#define PORT1_IOCR0_PC3_Pos                   27                                                      /*!< PORT1 IOCR0: PC3 Position               */
#define PORT1_IOCR0_PC3_Msk                   (0x1fUL << PORT1_IOCR0_PC3_Pos)                         /*!< PORT1 IOCR0: PC3 Mask                   */

/* ---------------------------------  PORT1_IOCR4  -------------------------------- */
#define PORT1_IOCR4_PC4_Pos                   3                                                       /*!< PORT1 IOCR4: PC4 Position               */
#define PORT1_IOCR4_PC4_Msk                   (0x1fUL << PORT1_IOCR4_PC4_Pos)                         /*!< PORT1 IOCR4: PC4 Mask                   */
#define PORT1_IOCR4_PC5_Pos                   11                                                      /*!< PORT1 IOCR4: PC5 Position               */
#define PORT1_IOCR4_PC5_Msk                   (0x1fUL << PORT1_IOCR4_PC5_Pos)                         /*!< PORT1 IOCR4: PC5 Mask                   */
#define PORT1_IOCR4_PC6_Pos                   19                                                      /*!< PORT1 IOCR4: PC6 Position               */
#define PORT1_IOCR4_PC6_Msk                   (0x1fUL << PORT1_IOCR4_PC6_Pos)                         /*!< PORT1 IOCR4: PC6 Mask                   */
#define PORT1_IOCR4_PC7_Pos                   27                                                      /*!< PORT1 IOCR4: PC7 Position               */
#define PORT1_IOCR4_PC7_Msk                   (0x1fUL << PORT1_IOCR4_PC7_Pos)                         /*!< PORT1 IOCR4: PC7 Mask                   */

/* ---------------------------------  PORT1_IOCR8  -------------------------------- */
#define PORT1_IOCR8_PC8_Pos                   3                                                       /*!< PORT1 IOCR8: PC8 Position               */
#define PORT1_IOCR8_PC8_Msk                   (0x1fUL << PORT1_IOCR8_PC8_Pos)                         /*!< PORT1 IOCR8: PC8 Mask                   */
#define PORT1_IOCR8_PC9_Pos                   11                                                      /*!< PORT1 IOCR8: PC9 Position               */
#define PORT1_IOCR8_PC9_Msk                   (0x1fUL << PORT1_IOCR8_PC9_Pos)                         /*!< PORT1 IOCR8: PC9 Mask                   */
#define PORT1_IOCR8_PC10_Pos                  19                                                      /*!< PORT1 IOCR8: PC10 Position              */
#define PORT1_IOCR8_PC10_Msk                  (0x1fUL << PORT1_IOCR8_PC10_Pos)                        /*!< PORT1 IOCR8: PC10 Mask                  */
#define PORT1_IOCR8_PC11_Pos                  27                                                      /*!< PORT1 IOCR8: PC11 Position              */
#define PORT1_IOCR8_PC11_Msk                  (0x1fUL << PORT1_IOCR8_PC11_Pos)                        /*!< PORT1 IOCR8: PC11 Mask                  */

/* --------------------------------  PORT1_IOCR12  -------------------------------- */
#define PORT1_IOCR12_PC12_Pos                 3                                                       /*!< PORT1 IOCR12: PC12 Position             */
#define PORT1_IOCR12_PC12_Msk                 (0x1fUL << PORT1_IOCR12_PC12_Pos)                       /*!< PORT1 IOCR12: PC12 Mask                 */
#define PORT1_IOCR12_PC13_Pos                 11                                                      /*!< PORT1 IOCR12: PC13 Position             */
#define PORT1_IOCR12_PC13_Msk                 (0x1fUL << PORT1_IOCR12_PC13_Pos)                       /*!< PORT1 IOCR12: PC13 Mask                 */
#define PORT1_IOCR12_PC14_Pos                 19                                                      /*!< PORT1 IOCR12: PC14 Position             */
#define PORT1_IOCR12_PC14_Msk                 (0x1fUL << PORT1_IOCR12_PC14_Pos)                       /*!< PORT1 IOCR12: PC14 Mask                 */
#define PORT1_IOCR12_PC15_Pos                 27                                                      /*!< PORT1 IOCR12: PC15 Position             */
#define PORT1_IOCR12_PC15_Msk                 (0x1fUL << PORT1_IOCR12_PC15_Pos)                       /*!< PORT1 IOCR12: PC15 Mask                 */

