FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4400.h
/* ---------------------------------  PORT3_PDR0  --------------------------------- */
#define PORT3_PDR0_PD0_Pos                    0                                                       /*!< PORT3 PDR0: PD0 Position                */
#define PORT3_PDR0_PD0_Msk                    (0x07UL << PORT3_PDR0_PD0_Pos)                          /*!< PORT3 PDR0: PD0 Mask                    */
#define PORT3_PDR0_PD1_Pos                    4                                                       /*!< PORT3 PDR0: PD1 Position                */
#define PORT3_PDR0_PD1_Msk                    (0x07UL << PORT3_PDR0_PD1_Pos)                          /*!< PORT3 PDR0: PD1 Mask                    */
#define PORT3_PDR0_PD2_Pos                    8                                                       /*!< PORT3 PDR0: PD2 Position                */
#define PORT3_PDR0_PD2_Msk                    (0x07UL << PORT3_PDR0_PD2_Pos)                          /*!< PORT3 PDR0: PD2 Mask                    */
#define PORT3_PDR0_PD3_Pos                    12                                                      /*!< PORT3 PDR0: PD3 Position                */
#define PORT3_PDR0_PD3_Msk                    (0x07UL << PORT3_PDR0_PD3_Pos)                          /*!< PORT3 PDR0: PD3 Mask                    */
#define PORT3_PDR0_PD4_Pos                    16                                                      /*!< PORT3 PDR0: PD4 Position                */
#define PORT3_PDR0_PD4_Msk                    (0x07UL << PORT3_PDR0_PD4_Pos)                          /*!< PORT3 PDR0: PD4 Mask                    */
#define PORT3_PDR0_PD5_Pos                    20                                                      /*!< PORT3 PDR0: PD5 Position                */
#define PORT3_PDR0_PD5_Msk                    (0x07UL << PORT3_PDR0_PD5_Pos)                          /*!< PORT3 PDR0: PD5 Mask                    */
#define PORT3_PDR0_PD6_Pos                    24                                                      /*!< PORT3 PDR0: PD6 Position                */
#define PORT3_PDR0_PD6_Msk                    (0x07UL << PORT3_PDR0_PD6_Pos)                          /*!< PORT3 PDR0: PD6 Mask                    */
#define PORT3_PDR0_PD7_Pos                    28                                                      /*!< PORT3 PDR0: PD7 Position                */
#define PORT3_PDR0_PD7_Msk                    (0x07UL << PORT3_PDR0_PD7_Pos)                          /*!< PORT3 PDR0: PD7 Mask                    */

/* ---------------------------------  PORT3_PDISC  -------------------------------- */
#define PORT3_PDISC_PDIS0_Pos                 0                                                       /*!< PORT3 PDISC: PDIS0 Position             */
#define PORT3_PDISC_PDIS0_Msk                 (0x01UL << PORT3_PDISC_PDIS0_Pos)                       /*!< PORT3 PDISC: PDIS0 Mask                 */
#define PORT3_PDISC_PDIS1_Pos                 1                                                       /*!< PORT3 PDISC: PDIS1 Position             */
#define PORT3_PDISC_PDIS1_Msk                 (0x01UL << PORT3_PDISC_PDIS1_Pos)                       /*!< PORT3 PDISC: PDIS1 Mask                 */
#define PORT3_PDISC_PDIS2_Pos                 2                                                       /*!< PORT3 PDISC: PDIS2 Position             */
#define PORT3_PDISC_PDIS2_Msk                 (0x01UL << PORT3_PDISC_PDIS2_Pos)                       /*!< PORT3 PDISC: PDIS2 Mask                 */
#define PORT3_PDISC_PDIS3_Pos                 3                                                       /*!< PORT3 PDISC: PDIS3 Position             */
#define PORT3_PDISC_PDIS3_Msk                 (0x01UL << PORT3_PDISC_PDIS3_Pos)                       /*!< PORT3 PDISC: PDIS3 Mask                 */
#define PORT3_PDISC_PDIS4_Pos                 4                                                       /*!< PORT3 PDISC: PDIS4 Position             */
#define PORT3_PDISC_PDIS4_Msk                 (0x01UL << PORT3_PDISC_PDIS4_Pos)                       /*!< PORT3 PDISC: PDIS4 Mask                 */
#define PORT3_PDISC_PDIS5_Pos                 5                                                       /*!< PORT3 PDISC: PDIS5 Position             */
#define PORT3_PDISC_PDIS5_Msk                 (0x01UL << PORT3_PDISC_PDIS5_Pos)                       /*!< PORT3 PDISC: PDIS5 Mask                 */
#define PORT3_PDISC_PDIS6_Pos                 6                                                       /*!< PORT3 PDISC: PDIS6 Position             */
#define PORT3_PDISC_PDIS6_Msk                 (0x01UL << PORT3_PDISC_PDIS6_Pos)                       /*!< PORT3 PDISC: PDIS6 Mask                 */
#define PORT3_PDISC_PDIS7_Pos                 7                                                       /*!< PORT3 PDISC: PDIS7 Position             */
#define PORT3_PDISC_PDIS7_Msk                 (0x01UL << PORT3_PDISC_PDIS7_Pos)                       /*!< PORT3 PDISC: PDIS7 Mask                 */
#define PORT3_PDISC_PDIS8_Pos                 8                                                       /*!< PORT3 PDISC: PDIS8 Position             */
#define PORT3_PDISC_PDIS8_Msk                 (0x01UL << PORT3_PDISC_PDIS8_Pos)                       /*!< PORT3 PDISC: PDIS8 Mask                 */
#define PORT3_PDISC_PDIS9_Pos                 9                                                       /*!< PORT3 PDISC: PDIS9 Position             */
#define PORT3_PDISC_PDIS9_Msk                 (0x01UL << PORT3_PDISC_PDIS9_Pos)                       /*!< PORT3 PDISC: PDIS9 Mask                 */
#define PORT3_PDISC_PDIS10_Pos                10                                                      /*!< PORT3 PDISC: PDIS10 Position            */
#define PORT3_PDISC_PDIS10_Msk                (0x01UL << PORT3_PDISC_PDIS10_Pos)                      /*!< PORT3 PDISC: PDIS10 Mask                */
#define PORT3_PDISC_PDIS11_Pos                11                                                      /*!< PORT3 PDISC: PDIS11 Position            */
#define PORT3_PDISC_PDIS11_Msk                (0x01UL << PORT3_PDISC_PDIS11_Pos)                      /*!< PORT3 PDISC: PDIS11 Mask                */
#define PORT3_PDISC_PDIS12_Pos                12                                                      /*!< PORT3 PDISC: PDIS12 Position            */
#define PORT3_PDISC_PDIS12_Msk                (0x01UL << PORT3_PDISC_PDIS12_Pos)                      /*!< PORT3 PDISC: PDIS12 Mask                */
#define PORT3_PDISC_PDIS13_Pos                13                                                      /*!< PORT3 PDISC: PDIS13 Position            */
#define PORT3_PDISC_PDIS13_Msk                (0x01UL << PORT3_PDISC_PDIS13_Pos)                      /*!< PORT3 PDISC: PDIS13 Mask                */
#define PORT3_PDISC_PDIS14_Pos                14                                                      /*!< PORT3 PDISC: PDIS14 Position            */
#define PORT3_PDISC_PDIS14_Msk                (0x01UL << PORT3_PDISC_PDIS14_Pos)                      /*!< PORT3 PDISC: PDIS14 Mask                */
#define PORT3_PDISC_PDIS15_Pos                15                                                      /*!< PORT3 PDISC: PDIS15 Position            */
#define PORT3_PDISC_PDIS15_Msk                (0x01UL << PORT3_PDISC_PDIS15_Pos)                      /*!< PORT3 PDISC: PDIS15 Mask                */

