FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4400.h
/* ----------------------------------  PORT4_PPS  --------------------------------- */
#define PORT4_PPS_PPS0_Pos                    0                                                       /*!< PORT4 PPS: PPS0 Position                */
#define PORT4_PPS_PPS0_Msk                    (0x01UL << PORT4_PPS_PPS0_Pos)                          /*!< PORT4 PPS: PPS0 Mask                    */
#define PORT4_PPS_PPS1_Pos                    1                                                       /*!< PORT4 PPS: PPS1 Position                */
#define PORT4_PPS_PPS1_Msk                    (0x01UL << PORT4_PPS_PPS1_Pos)                          /*!< PORT4 PPS: PPS1 Mask                    */
#define PORT4_PPS_PPS2_Pos                    2                                                       /*!< PORT4 PPS: PPS2 Position                */
#define PORT4_PPS_PPS2_Msk                    (0x01UL << PORT4_PPS_PPS2_Pos)                          /*!< PORT4 PPS: PPS2 Mask                    */
#define PORT4_PPS_PPS3_Pos                    3                                                       /*!< PORT4 PPS: PPS3 Position                */
#define PORT4_PPS_PPS3_Msk                    (0x01UL << PORT4_PPS_PPS3_Pos)                          /*!< PORT4 PPS: PPS3 Mask                    */
#define PORT4_PPS_PPS4_Pos                    4                                                       /*!< PORT4 PPS: PPS4 Position                */
#define PORT4_PPS_PPS4_Msk                    (0x01UL << PORT4_PPS_PPS4_Pos)                          /*!< PORT4 PPS: PPS4 Mask                    */
#define PORT4_PPS_PPS5_Pos                    5                                                       /*!< PORT4 PPS: PPS5 Position                */
#define PORT4_PPS_PPS5_Msk                    (0x01UL << PORT4_PPS_PPS5_Pos)                          /*!< PORT4 PPS: PPS5 Mask                    */
#define PORT4_PPS_PPS6_Pos                    6                                                       /*!< PORT4 PPS: PPS6 Position                */
#define PORT4_PPS_PPS6_Msk                    (0x01UL << PORT4_PPS_PPS6_Pos)                          /*!< PORT4 PPS: PPS6 Mask                    */
#define PORT4_PPS_PPS7_Pos                    7                                                       /*!< PORT4 PPS: PPS7 Position                */
#define PORT4_PPS_PPS7_Msk                    (0x01UL << PORT4_PPS_PPS7_Pos)                          /*!< PORT4 PPS: PPS7 Mask                    */
#define PORT4_PPS_PPS8_Pos                    8                                                       /*!< PORT4 PPS: PPS8 Position                */
#define PORT4_PPS_PPS8_Msk                    (0x01UL << PORT4_PPS_PPS8_Pos)                          /*!< PORT4 PPS: PPS8 Mask                    */
#define PORT4_PPS_PPS9_Pos                    9                                                       /*!< PORT4 PPS: PPS9 Position                */
#define PORT4_PPS_PPS9_Msk                    (0x01UL << PORT4_PPS_PPS9_Pos)                          /*!< PORT4 PPS: PPS9 Mask                    */
#define PORT4_PPS_PPS10_Pos                   10                                                      /*!< PORT4 PPS: PPS10 Position               */
#define PORT4_PPS_PPS10_Msk                   (0x01UL << PORT4_PPS_PPS10_Pos)                         /*!< PORT4 PPS: PPS10 Mask                   */
#define PORT4_PPS_PPS11_Pos                   11                                                      /*!< PORT4 PPS: PPS11 Position               */
#define PORT4_PPS_PPS11_Msk                   (0x01UL << PORT4_PPS_PPS11_Pos)                         /*!< PORT4 PPS: PPS11 Mask                   */
#define PORT4_PPS_PPS12_Pos                   12                                                      /*!< PORT4 PPS: PPS12 Position               */
#define PORT4_PPS_PPS12_Msk                   (0x01UL << PORT4_PPS_PPS12_Pos)                         /*!< PORT4 PPS: PPS12 Mask                   */
#define PORT4_PPS_PPS13_Pos                   13                                                      /*!< PORT4 PPS: PPS13 Position               */
#define PORT4_PPS_PPS13_Msk                   (0x01UL << PORT4_PPS_PPS13_Pos)                         /*!< PORT4 PPS: PPS13 Mask                   */
#define PORT4_PPS_PPS14_Pos                   14                                                      /*!< PORT4 PPS: PPS14 Position               */
#define PORT4_PPS_PPS14_Msk                   (0x01UL << PORT4_PPS_PPS14_Pos)                         /*!< PORT4 PPS: PPS14 Mask                   */
#define PORT4_PPS_PPS15_Pos                   15                                                      /*!< PORT4 PPS: PPS15 Position               */
#define PORT4_PPS_PPS15_Msk                   (0x01UL << PORT4_PPS_PPS15_Pos)                         /*!< PORT4 PPS: PPS15 Mask                   */

/* ---------------------------------  PORT4_HWSEL  -------------------------------- */
#define PORT4_HWSEL_HW0_Pos                   0                                                       /*!< PORT4 HWSEL: HW0 Position               */
#define PORT4_HWSEL_HW0_Msk                   (0x03UL << PORT4_HWSEL_HW0_Pos)                         /*!< PORT4 HWSEL: HW0 Mask                   */
#define PORT4_HWSEL_HW1_Pos                   2                                                       /*!< PORT4 HWSEL: HW1 Position               */
#define PORT4_HWSEL_HW1_Msk                   (0x03UL << PORT4_HWSEL_HW1_Pos)                         /*!< PORT4 HWSEL: HW1 Mask                   */
#define PORT4_HWSEL_HW2_Pos                   4                                                       /*!< PORT4 HWSEL: HW2 Position               */
#define PORT4_HWSEL_HW2_Msk                   (0x03UL << PORT4_HWSEL_HW2_Pos)                         /*!< PORT4 HWSEL: HW2 Mask                   */
#define PORT4_HWSEL_HW3_Pos                   6                                                       /*!< PORT4 HWSEL: HW3 Position               */
#define PORT4_HWSEL_HW3_Msk                   (0x03UL << PORT4_HWSEL_HW3_Pos)                         /*!< PORT4 HWSEL: HW3 Mask                   */
#define PORT4_HWSEL_HW4_Pos                   8                                                       /*!< PORT4 HWSEL: HW4 Position               */
#define PORT4_HWSEL_HW4_Msk                   (0x03UL << PORT4_HWSEL_HW4_Pos)                         /*!< PORT4 HWSEL: HW4 Mask                   */
#define PORT4_HWSEL_HW5_Pos                   10                                                      /*!< PORT4 HWSEL: HW5 Position               */
#define PORT4_HWSEL_HW5_Msk                   (0x03UL << PORT4_HWSEL_HW5_Pos)                         /*!< PORT4 HWSEL: HW5 Mask                   */
#define PORT4_HWSEL_HW6_Pos                   12                                                      /*!< PORT4 HWSEL: HW6 Position               */
#define PORT4_HWSEL_HW6_Msk                   (0x03UL << PORT4_HWSEL_HW6_Pos)                         /*!< PORT4 HWSEL: HW6 Mask                   */
#define PORT4_HWSEL_HW7_Pos                   14                                                      /*!< PORT4 HWSEL: HW7 Position               */
#define PORT4_HWSEL_HW7_Msk                   (0x03UL << PORT4_HWSEL_HW7_Pos)                         /*!< PORT4 HWSEL: HW7 Mask                   */
#define PORT4_HWSEL_HW8_Pos                   16                                                      /*!< PORT4 HWSEL: HW8 Position               */
#define PORT4_HWSEL_HW8_Msk                   (0x03UL << PORT4_HWSEL_HW8_Pos)                         /*!< PORT4 HWSEL: HW8 Mask                   */
#define PORT4_HWSEL_HW9_Pos                   18                                                      /*!< PORT4 HWSEL: HW9 Position               */
#define PORT4_HWSEL_HW9_Msk                   (0x03UL << PORT4_HWSEL_HW9_Pos)                         /*!< PORT4 HWSEL: HW9 Mask                   */
#define PORT4_HWSEL_HW10_Pos                  20                                                      /*!< PORT4 HWSEL: HW10 Position              */
#define PORT4_HWSEL_HW10_Msk                  (0x03UL << PORT4_HWSEL_HW10_Pos)                        /*!< PORT4 HWSEL: HW10 Mask                  */
#define PORT4_HWSEL_HW11_Pos                  22                                                      /*!< PORT4 HWSEL: HW11 Position              */
#define PORT4_HWSEL_HW11_Msk                  (0x03UL << PORT4_HWSEL_HW11_Pos)                        /*!< PORT4 HWSEL: HW11 Mask                  */
#define PORT4_HWSEL_HW12_Pos                  24                                                      /*!< PORT4 HWSEL: HW12 Position              */
#define PORT4_HWSEL_HW12_Msk                  (0x03UL << PORT4_HWSEL_HW12_Pos)                        /*!< PORT4 HWSEL: HW12 Mask                  */
#define PORT4_HWSEL_HW13_Pos                  26                                                      /*!< PORT4 HWSEL: HW13 Position              */
#define PORT4_HWSEL_HW13_Msk                  (0x03UL << PORT4_HWSEL_HW13_Pos)                        /*!< PORT4 HWSEL: HW13 Mask                  */
#define PORT4_HWSEL_HW14_Pos                  28                                                      /*!< PORT4 HWSEL: HW14 Position              */
#define PORT4_HWSEL_HW14_Msk                  (0x03UL << PORT4_HWSEL_HW14_Pos)                        /*!< PORT4 HWSEL: HW14 Mask                  */
#define PORT4_HWSEL_HW15_Pos                  30                                                      /*!< PORT4 HWSEL: HW15 Position              */
#define PORT4_HWSEL_HW15_Msk                  (0x03UL << PORT4_HWSEL_HW15_Pos)                        /*!< PORT4 HWSEL: HW15 Mask                  */


/* ================================================================================ */
/* ================         struct 'PORT5' Position & Mask         ================ */
/* ================================================================================ */


/* ----------------------------------  PORT5_OUT  --------------------------------- */
#define PORT5_OUT_P0_Pos                      0                                                       /*!< PORT5 OUT: P0 Position                  */
#define PORT5_OUT_P0_Msk                      (0x01UL << PORT5_OUT_P0_Pos)                            /*!< PORT5 OUT: P0 Mask                      */
#define PORT5_OUT_P1_Pos                      1                                                       /*!< PORT5 OUT: P1 Position                  */
#define PORT5_OUT_P1_Msk                      (0x01UL << PORT5_OUT_P1_Pos)                            /*!< PORT5 OUT: P1 Mask                      */
#define PORT5_OUT_P2_Pos                      2                                                       /*!< PORT5 OUT: P2 Position                  */
#define PORT5_OUT_P2_Msk                      (0x01UL << PORT5_OUT_P2_Pos)                            /*!< PORT5 OUT: P2 Mask                      */
#define PORT5_OUT_P3_Pos                      3                                                       /*!< PORT5 OUT: P3 Position                  */
#define PORT5_OUT_P3_Msk                      (0x01UL << PORT5_OUT_P3_Pos)                            /*!< PORT5 OUT: P3 Mask                      */
#define PORT5_OUT_P4_Pos                      4                                                       /*!< PORT5 OUT: P4 Position                  */
#define PORT5_OUT_P4_Msk                      (0x01UL << PORT5_OUT_P4_Pos)                            /*!< PORT5 OUT: P4 Mask                      */
#define PORT5_OUT_P5_Pos                      5                                                       /*!< PORT5 OUT: P5 Position                  */
#define PORT5_OUT_P5_Msk                      (0x01UL << PORT5_OUT_P5_Pos)                            /*!< PORT5 OUT: P5 Mask                      */
#define PORT5_OUT_P6_Pos                      6                                                       /*!< PORT5 OUT: P6 Position                  */
#define PORT5_OUT_P6_Msk                      (0x01UL << PORT5_OUT_P6_Pos)                            /*!< PORT5 OUT: P6 Mask                      */
#define PORT5_OUT_P7_Pos                      7                                                       /*!< PORT5 OUT: P7 Position                  */
#define PORT5_OUT_P7_Msk                      (0x01UL << PORT5_OUT_P7_Pos)                            /*!< PORT5 OUT: P7 Mask                      */
#define PORT5_OUT_P8_Pos                      8                                                       /*!< PORT5 OUT: P8 Position                  */
#define PORT5_OUT_P8_Msk                      (0x01UL << PORT5_OUT_P8_Pos)                            /*!< PORT5 OUT: P8 Mask                      */
#define PORT5_OUT_P9_Pos                      9                                                       /*!< PORT5 OUT: P9 Position                  */
#define PORT5_OUT_P9_Msk                      (0x01UL << PORT5_OUT_P9_Pos)                            /*!< PORT5 OUT: P9 Mask                      */
#define PORT5_OUT_P10_Pos                     10                                                      /*!< PORT5 OUT: P10 Position                 */
#define PORT5_OUT_P10_Msk                     (0x01UL << PORT5_OUT_P10_Pos)                           /*!< PORT5 OUT: P10 Mask                     */
#define PORT5_OUT_P11_Pos                     11                                                      /*!< PORT5 OUT: P11 Position                 */
#define PORT5_OUT_P11_Msk                     (0x01UL << PORT5_OUT_P11_Pos)                           /*!< PORT5 OUT: P11 Mask                     */
#define PORT5_OUT_P12_Pos                     12                                                      /*!< PORT5 OUT: P12 Position                 */
#define PORT5_OUT_P12_Msk                     (0x01UL << PORT5_OUT_P12_Pos)                           /*!< PORT5 OUT: P12 Mask                     */
#define PORT5_OUT_P13_Pos                     13                                                      /*!< PORT5 OUT: P13 Position                 */
#define PORT5_OUT_P13_Msk                     (0x01UL << PORT5_OUT_P13_Pos)                           /*!< PORT5 OUT: P13 Mask                     */
#define PORT5_OUT_P14_Pos                     14                                                      /*!< PORT5 OUT: P14 Position                 */
#define PORT5_OUT_P14_Msk                     (0x01UL << PORT5_OUT_P14_Pos)                           /*!< PORT5 OUT: P14 Mask                     */
#define PORT5_OUT_P15_Pos                     15                                                      /*!< PORT5 OUT: P15 Position                 */
#define PORT5_OUT_P15_Msk                     (0x01UL << PORT5_OUT_P15_Pos)                           /*!< PORT5 OUT: P15 Mask                     */

