FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4400.h
/* --------------------------------  PORT14_IOCR8  -------------------------------- */
#define PORT14_IOCR8_PC8_Pos                  3                                                       /*!< PORT14 IOCR8: PC8 Position              */
#define PORT14_IOCR8_PC8_Msk                  (0x1fUL << PORT14_IOCR8_PC8_Pos)                        /*!< PORT14 IOCR8: PC8 Mask                  */
#define PORT14_IOCR8_PC9_Pos                  11                                                      /*!< PORT14 IOCR8: PC9 Position              */
#define PORT14_IOCR8_PC9_Msk                  (0x1fUL << PORT14_IOCR8_PC9_Pos)                        /*!< PORT14 IOCR8: PC9 Mask                  */
#define PORT14_IOCR8_PC10_Pos                 19                                                      /*!< PORT14 IOCR8: PC10 Position             */
#define PORT14_IOCR8_PC10_Msk                 (0x1fUL << PORT14_IOCR8_PC10_Pos)                       /*!< PORT14 IOCR8: PC10 Mask                 */
#define PORT14_IOCR8_PC11_Pos                 27                                                      /*!< PORT14 IOCR8: PC11 Position             */
#define PORT14_IOCR8_PC11_Msk                 (0x1fUL << PORT14_IOCR8_PC11_Pos)                       /*!< PORT14 IOCR8: PC11 Mask                 */

/* --------------------------------  PORT14_IOCR12  ------------------------------- */
#define PORT14_IOCR12_PC12_Pos                3                                                       /*!< PORT14 IOCR12: PC12 Position            */
#define PORT14_IOCR12_PC12_Msk                (0x1fUL << PORT14_IOCR12_PC12_Pos)                      /*!< PORT14 IOCR12: PC12 Mask                */
#define PORT14_IOCR12_PC13_Pos                11                                                      /*!< PORT14 IOCR12: PC13 Position            */
#define PORT14_IOCR12_PC13_Msk                (0x1fUL << PORT14_IOCR12_PC13_Pos)                      /*!< PORT14 IOCR12: PC13 Mask                */
#define PORT14_IOCR12_PC14_Pos                19                                                      /*!< PORT14 IOCR12: PC14 Position            */
#define PORT14_IOCR12_PC14_Msk                (0x1fUL << PORT14_IOCR12_PC14_Pos)                      /*!< PORT14 IOCR12: PC14 Mask                */
#define PORT14_IOCR12_PC15_Pos                27                                                      /*!< PORT14 IOCR12: PC15 Position            */
#define PORT14_IOCR12_PC15_Msk                (0x1fUL << PORT14_IOCR12_PC15_Pos)                      /*!< PORT14 IOCR12: PC15 Mask                */

/* ----------------------------------  PORT14_IN  --------------------------------- */
#define PORT14_IN_P0_Pos                      0                                                       /*!< PORT14 IN: P0 Position                  */
#define PORT14_IN_P0_Msk                      (0x01UL << PORT14_IN_P0_Pos)                            /*!< PORT14 IN: P0 Mask                      */
#define PORT14_IN_P1_Pos                      1                                                       /*!< PORT14 IN: P1 Position                  */
#define PORT14_IN_P1_Msk                      (0x01UL << PORT14_IN_P1_Pos)                            /*!< PORT14 IN: P1 Mask                      */
#define PORT14_IN_P2_Pos                      2                                                       /*!< PORT14 IN: P2 Position                  */
#define PORT14_IN_P2_Msk                      (0x01UL << PORT14_IN_P2_Pos)                            /*!< PORT14 IN: P2 Mask                      */
#define PORT14_IN_P3_Pos                      3                                                       /*!< PORT14 IN: P3 Position                  */
#define PORT14_IN_P3_Msk                      (0x01UL << PORT14_IN_P3_Pos)                            /*!< PORT14 IN: P3 Mask                      */
#define PORT14_IN_P4_Pos                      4                                                       /*!< PORT14 IN: P4 Position                  */
#define PORT14_IN_P4_Msk                      (0x01UL << PORT14_IN_P4_Pos)                            /*!< PORT14 IN: P4 Mask                      */
#define PORT14_IN_P5_Pos                      5                                                       /*!< PORT14 IN: P5 Position                  */
#define PORT14_IN_P5_Msk                      (0x01UL << PORT14_IN_P5_Pos)                            /*!< PORT14 IN: P5 Mask                      */
#define PORT14_IN_P6_Pos                      6                                                       /*!< PORT14 IN: P6 Position                  */
#define PORT14_IN_P6_Msk                      (0x01UL << PORT14_IN_P6_Pos)                            /*!< PORT14 IN: P6 Mask                      */
#define PORT14_IN_P7_Pos                      7                                                       /*!< PORT14 IN: P7 Position                  */
#define PORT14_IN_P7_Msk                      (0x01UL << PORT14_IN_P7_Pos)                            /*!< PORT14 IN: P7 Mask                      */
#define PORT14_IN_P8_Pos                      8                                                       /*!< PORT14 IN: P8 Position                  */
#define PORT14_IN_P8_Msk                      (0x01UL << PORT14_IN_P8_Pos)                            /*!< PORT14 IN: P8 Mask                      */
#define PORT14_IN_P9_Pos                      9                                                       /*!< PORT14 IN: P9 Position                  */
#define PORT14_IN_P9_Msk                      (0x01UL << PORT14_IN_P9_Pos)                            /*!< PORT14 IN: P9 Mask                      */
#define PORT14_IN_P10_Pos                     10                                                      /*!< PORT14 IN: P10 Position                 */
#define PORT14_IN_P10_Msk                     (0x01UL << PORT14_IN_P10_Pos)                           /*!< PORT14 IN: P10 Mask                     */
#define PORT14_IN_P11_Pos                     11                                                      /*!< PORT14 IN: P11 Position                 */
#define PORT14_IN_P11_Msk                     (0x01UL << PORT14_IN_P11_Pos)                           /*!< PORT14 IN: P11 Mask                     */
#define PORT14_IN_P12_Pos                     12                                                      /*!< PORT14 IN: P12 Position                 */
#define PORT14_IN_P12_Msk                     (0x01UL << PORT14_IN_P12_Pos)                           /*!< PORT14 IN: P12 Mask                     */
#define PORT14_IN_P13_Pos                     13                                                      /*!< PORT14 IN: P13 Position                 */
#define PORT14_IN_P13_Msk                     (0x01UL << PORT14_IN_P13_Pos)                           /*!< PORT14 IN: P13 Mask                     */
#define PORT14_IN_P14_Pos                     14                                                      /*!< PORT14 IN: P14 Position                 */
#define PORT14_IN_P14_Msk                     (0x01UL << PORT14_IN_P14_Pos)                           /*!< PORT14 IN: P14 Mask                     */
#define PORT14_IN_P15_Pos                     15                                                      /*!< PORT14 IN: P15 Position                 */
#define PORT14_IN_P15_Msk                     (0x01UL << PORT14_IN_P15_Pos)                           /*!< PORT14 IN: P15 Mask                     */

