FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4400.h
/* ---------------------------------  PORT15_OMR  --------------------------------- */
#define PORT15_OMR_PS0_Pos                    0                                                       /*!< PORT15 OMR: PS0 Position                */
#define PORT15_OMR_PS0_Msk                    (0x01UL << PORT15_OMR_PS0_Pos)                          /*!< PORT15 OMR: PS0 Mask                    */
#define PORT15_OMR_PS1_Pos                    1                                                       /*!< PORT15 OMR: PS1 Position                */
#define PORT15_OMR_PS1_Msk                    (0x01UL << PORT15_OMR_PS1_Pos)                          /*!< PORT15 OMR: PS1 Mask                    */
#define PORT15_OMR_PS2_Pos                    2                                                       /*!< PORT15 OMR: PS2 Position                */
#define PORT15_OMR_PS2_Msk                    (0x01UL << PORT15_OMR_PS2_Pos)                          /*!< PORT15 OMR: PS2 Mask                    */
#define PORT15_OMR_PS3_Pos                    3                                                       /*!< PORT15 OMR: PS3 Position                */
#define PORT15_OMR_PS3_Msk                    (0x01UL << PORT15_OMR_PS3_Pos)                          /*!< PORT15 OMR: PS3 Mask                    */
#define PORT15_OMR_PS4_Pos                    4                                                       /*!< PORT15 OMR: PS4 Position                */
#define PORT15_OMR_PS4_Msk                    (0x01UL << PORT15_OMR_PS4_Pos)                          /*!< PORT15 OMR: PS4 Mask                    */
#define PORT15_OMR_PS5_Pos                    5                                                       /*!< PORT15 OMR: PS5 Position                */
#define PORT15_OMR_PS5_Msk                    (0x01UL << PORT15_OMR_PS5_Pos)                          /*!< PORT15 OMR: PS5 Mask                    */
#define PORT15_OMR_PS6_Pos                    6                                                       /*!< PORT15 OMR: PS6 Position                */
#define PORT15_OMR_PS6_Msk                    (0x01UL << PORT15_OMR_PS6_Pos)                          /*!< PORT15 OMR: PS6 Mask                    */
#define PORT15_OMR_PS7_Pos                    7                                                       /*!< PORT15 OMR: PS7 Position                */
#define PORT15_OMR_PS7_Msk                    (0x01UL << PORT15_OMR_PS7_Pos)                          /*!< PORT15 OMR: PS7 Mask                    */
#define PORT15_OMR_PS8_Pos                    8                                                       /*!< PORT15 OMR: PS8 Position                */
#define PORT15_OMR_PS8_Msk                    (0x01UL << PORT15_OMR_PS8_Pos)                          /*!< PORT15 OMR: PS8 Mask                    */
#define PORT15_OMR_PS9_Pos                    9                                                       /*!< PORT15 OMR: PS9 Position                */
#define PORT15_OMR_PS9_Msk                    (0x01UL << PORT15_OMR_PS9_Pos)                          /*!< PORT15 OMR: PS9 Mask                    */
#define PORT15_OMR_PS10_Pos                   10                                                      /*!< PORT15 OMR: PS10 Position               */
#define PORT15_OMR_PS10_Msk                   (0x01UL << PORT15_OMR_PS10_Pos)                         /*!< PORT15 OMR: PS10 Mask                   */
#define PORT15_OMR_PS11_Pos                   11                                                      /*!< PORT15 OMR: PS11 Position               */
#define PORT15_OMR_PS11_Msk                   (0x01UL << PORT15_OMR_PS11_Pos)                         /*!< PORT15 OMR: PS11 Mask                   */
#define PORT15_OMR_PS12_Pos                   12                                                      /*!< PORT15 OMR: PS12 Position               */
#define PORT15_OMR_PS12_Msk                   (0x01UL << PORT15_OMR_PS12_Pos)                         /*!< PORT15 OMR: PS12 Mask                   */
#define PORT15_OMR_PS13_Pos                   13                                                      /*!< PORT15 OMR: PS13 Position               */
#define PORT15_OMR_PS13_Msk                   (0x01UL << PORT15_OMR_PS13_Pos)                         /*!< PORT15 OMR: PS13 Mask                   */
#define PORT15_OMR_PS14_Pos                   14                                                      /*!< PORT15 OMR: PS14 Position               */
#define PORT15_OMR_PS14_Msk                   (0x01UL << PORT15_OMR_PS14_Pos)                         /*!< PORT15 OMR: PS14 Mask                   */
#define PORT15_OMR_PS15_Pos                   15                                                      /*!< PORT15 OMR: PS15 Position               */
#define PORT15_OMR_PS15_Msk                   (0x01UL << PORT15_OMR_PS15_Pos)                         /*!< PORT15 OMR: PS15 Mask                   */
#define PORT15_OMR_PR0_Pos                    16                                                      /*!< PORT15 OMR: PR0 Position                */
#define PORT15_OMR_PR0_Msk                    (0x01UL << PORT15_OMR_PR0_Pos)                          /*!< PORT15 OMR: PR0 Mask                    */
#define PORT15_OMR_PR1_Pos                    17                                                      /*!< PORT15 OMR: PR1 Position                */
#define PORT15_OMR_PR1_Msk                    (0x01UL << PORT15_OMR_PR1_Pos)                          /*!< PORT15 OMR: PR1 Mask                    */
#define PORT15_OMR_PR2_Pos                    18                                                      /*!< PORT15 OMR: PR2 Position                */
#define PORT15_OMR_PR2_Msk                    (0x01UL << PORT15_OMR_PR2_Pos)                          /*!< PORT15 OMR: PR2 Mask                    */
#define PORT15_OMR_PR3_Pos                    19                                                      /*!< PORT15 OMR: PR3 Position                */
#define PORT15_OMR_PR3_Msk                    (0x01UL << PORT15_OMR_PR3_Pos)                          /*!< PORT15 OMR: PR3 Mask                    */
#define PORT15_OMR_PR4_Pos                    20                                                      /*!< PORT15 OMR: PR4 Position                */
#define PORT15_OMR_PR4_Msk                    (0x01UL << PORT15_OMR_PR4_Pos)                          /*!< PORT15 OMR: PR4 Mask                    */
#define PORT15_OMR_PR5_Pos                    21                                                      /*!< PORT15 OMR: PR5 Position                */
#define PORT15_OMR_PR5_Msk                    (0x01UL << PORT15_OMR_PR5_Pos)                          /*!< PORT15 OMR: PR5 Mask                    */
#define PORT15_OMR_PR6_Pos                    22                                                      /*!< PORT15 OMR: PR6 Position                */
#define PORT15_OMR_PR6_Msk                    (0x01UL << PORT15_OMR_PR6_Pos)                          /*!< PORT15 OMR: PR6 Mask                    */
#define PORT15_OMR_PR7_Pos                    23                                                      /*!< PORT15 OMR: PR7 Position                */
#define PORT15_OMR_PR7_Msk                    (0x01UL << PORT15_OMR_PR7_Pos)                          /*!< PORT15 OMR: PR7 Mask                    */
#define PORT15_OMR_PR8_Pos                    24                                                      /*!< PORT15 OMR: PR8 Position                */
#define PORT15_OMR_PR8_Msk                    (0x01UL << PORT15_OMR_PR8_Pos)                          /*!< PORT15 OMR: PR8 Mask                    */
#define PORT15_OMR_PR9_Pos                    25                                                      /*!< PORT15 OMR: PR9 Position                */
#define PORT15_OMR_PR9_Msk                    (0x01UL << PORT15_OMR_PR9_Pos)                          /*!< PORT15 OMR: PR9 Mask                    */
#define PORT15_OMR_PR10_Pos                   26                                                      /*!< PORT15 OMR: PR10 Position               */
#define PORT15_OMR_PR10_Msk                   (0x01UL << PORT15_OMR_PR10_Pos)                         /*!< PORT15 OMR: PR10 Mask                   */
#define PORT15_OMR_PR11_Pos                   27                                                      /*!< PORT15 OMR: PR11 Position               */
#define PORT15_OMR_PR11_Msk                   (0x01UL << PORT15_OMR_PR11_Pos)                         /*!< PORT15 OMR: PR11 Mask                   */
#define PORT15_OMR_PR12_Pos                   28                                                      /*!< PORT15 OMR: PR12 Position               */
#define PORT15_OMR_PR12_Msk                   (0x01UL << PORT15_OMR_PR12_Pos)                         /*!< PORT15 OMR: PR12 Mask                   */
#define PORT15_OMR_PR13_Pos                   29                                                      /*!< PORT15 OMR: PR13 Position               */
#define PORT15_OMR_PR13_Msk                   (0x01UL << PORT15_OMR_PR13_Pos)                         /*!< PORT15 OMR: PR13 Mask                   */
#define PORT15_OMR_PR14_Pos                   30                                                      /*!< PORT15 OMR: PR14 Position               */
#define PORT15_OMR_PR14_Msk                   (0x01UL << PORT15_OMR_PR14_Pos)                         /*!< PORT15 OMR: PR14 Mask                   */
#define PORT15_OMR_PR15_Pos                   31                                                      /*!< PORT15 OMR: PR15 Position               */
#define PORT15_OMR_PR15_Msk                   (0x01UL << PORT15_OMR_PR15_Pos)                         /*!< PORT15 OMR: PR15 Mask                   */

